{
  "glossary": [
    {
      "title": "Accessibility feature",
      "body": "<p>Example of an accessibility feature:</p><ul> <li>a component for loading a more contrasting colour palette for users;</li> <li>a font size enlargement component;</li> <li>a component providing access to a simplified language version.</li> </ul>"
    },
    {
      "title": "Accessibility information",
      "body": "<p>Accessibility information is all the information (attributes, programmatic relationships, alternatives, etc.) required to make content accessible. For example: the alternative of a graphic element, the semantics of a passage of text, the title of an online frame, etc.</p><p>For example, in HTML, the <code>alt</code> attribute of an image is accessibility information.</p><p>An editing tool should have functions that enable all the information needed to create accessible content to be defined:</p><ul> <li>defining the alternative of an image or, on the contrary, declaring it decorative;</li> <li>be able to define section headings;</li> <li>the ability to define form field labels.</li> </ul><p>All accessibility criteria relating to the considered content technology are concerned. For example, for an HTML page, all the RAWeb level A and AA criteria must be met. For an application, all the criteria in this framework must be met.</p>"
    },
    {
      "title": "Accessible and operable by keyboard and any pointing device",
      "body": "<p>Pointing devices in a mobile environment can be, but are not limited to:</p><ul> <li>touch;</li> <li>mouse;</li> <li>eye tracking devices;</li> <li>the point scanning feature <a href=\"https://support.apple.com/en-gb/119835\">on iOS</a> or <a href=\"https://support.google.com/accessibility/android/answer/6395627?hl=en\">Android</a>;</li> <li>voice control.</li> </ul><p>A user interface component (link, button, form field, etc.) can be accessed by any pointing device when the user</p><ul> <li>can set the focus on the component, regardless of the device;</li> <li>can initiate the action provided for by the user interface component by means of a manipulation specific to the device (a certain key on the keyboard, a gesture on the screen, for example);</li> </ul><p><strong>Warning:</strong> for certain user interface components such as potentiometers (slider, rotary knob), several interactions are possible and therefore several manipulations specific to the device may be required to interact with the component. On the keyboard, for example for potentiometers, the direction arrows (right, left, up and down) are used to interact with and modify the component.</p><p>In this framework, the expression \"accessible and operable by keyboard and any pointing device\" also refers to this definition.</p><p><strong>Important note:</strong> the use of certain technologies may make focus management too complex or too unstable to rely solely on tab, arrow and enter keys. In this case, providing keyboard shortcuts may be the only way to make the component usable. The criterion can only be considered compliant if the keyboard shortcuts used are properly documented, functional and comply with <a href=\"referentiel-technique.md#crit-10-4\">criterion 10.4</a>.</p>"
    },
    {
      "title": "Accessible to assistive technologies",
      "body": "<p>For information to be accessible to assistive technologies, it must be made available to them, either through the software itself or via an accessibility API, the latter method being the most widespread.</p><p>This can be achieved by means of descriptive properties that may not be visible on the interface, but which are rendered by assistive technologies, or by means of API parameters that define states, for example (selected, active, disabled, etc.)</p>"
    },
    {
      "title": "Accessible version",
      "body": "<p>Downloadable documents whose format types are recognised as compatible with accessibility must be made accessible either directly or via an accessible version (for a downloadable document). The document formats recognised as compatible are</p><ul> <li>Microsoft Office (Word 2003, OOXML);</li> <li>Open Office Org (ODF);</li> <li>Adobe PDF;</li> <li>ePub/Daisy.</li> </ul><p>PDF documents must comply with the <a href=\"../rapdf1/index.html\">PDF accessibility assessment framework (RAPDF 1)</a>. Other types of content must comply with the criteria of <a href=\"https://www.etsi.org/deliver/etsi_en/301500_301599/301549/03.02.01_60/en_301549v030201p.pdf#page=52\">section 10 <span lang=\"en\">Non-web documents</span></a> of European standard EN 301 549 v3.2.1.</p><p><strong>Note:</strong> TXT format cannot be used to produce an accessible version for a downloadable document.</p>"
    },
    {
      "title": "Adjacent colour",
      "body": "<p>Colour directly in contact with the colours of the component or graphic element, this can be the background colour or any other colour in direct contact.</p><p><strong>Example:</strong> In a \"no-entry\" sign, the red of the sign is the colour adjacent to the white line in the centre of the sign.</p><p>It is important to understand that <a href=\"referentiel-technique.md#crit-2-3\">criterion 2.3</a> on the contrasts of user interface components and graphic elements only assesses <strong>non-textual</strong> elements. As soon as the contrast of text needs to be assessed, even if it is present in a user interface component, <a href=\"referentiel-technique.md#crit-2-2\">criterion 2.2</a> applies.</p><p>Not all colours in a graphic element or user interface component need to be evaluated. It is essential to assess</p><ul> <li><strong>Information-conveying colours</strong> (not all colours convey information): <ul> <li>For example, in an application's navigation panel, the navigation buttons have a grey background colour, but the active screen button has a green background colour. It is necessary to check that the green colour in direct junction with the grey background colour has a contrast ratio of at least 3:1.</li> </ul> </li> <li><strong>Colours used to identify the location of an element or interactive zones</strong>, for example <ul> <li>The border of a form field, if this is the only means of identifying the location of the interaction, must have a colour with a contrast ratio of at least 3:1 with the adjacent colour, generally the background colour;</li> <li>The borders of checkboxes and radio buttons, and their status (selected or not). It is essential here to assess the contrast ratio of the border of these components with the adjacent colours (generally the background colour) but also to assess the contrast ratio of these components when they are selected. It is necessary to assess whether the visual element used to signify the selection has a sufficient contrast ratio.</li> </ul> </li> <li><strong>The colours of non-text information elements</strong> (graphic elements): <ul> <li>A chevron is positioned to the right of the item selected in a list of items, the contrast ratio between the colour of the chevron and the adjacent colours (generally the background colour) must be at least 3:1.</li> </ul> </li> </ul><p>The background colour of a form submit button, for example (\"Submit\"), does not have to contrast with the screen background. This is because the button is located by the text, which must already comply with the text contrast constraints (<a href=\"referentiel-technique.md#crit-2-2\">criterion 2.2</a>). The size of the button and its edges are not considered to be information that meets this criterion.</p><p><strong>Note 1:</strong> In the case of a gradient, the adjacent colour with the least contrast in the gradient will be considered as the adjacent colour.</p><p><strong>Note 2:</strong> In the case of multiple colours, all the colours are to be considered as adjacent colours.</p>"
    },
    {
      "title": "Alternative audio only version",
      "body": "<p>An \"audio only\" version is an audio version, in the form of a simple file in MP3 format for example, used as an alternative to a video only (video without audio information). The only users affected by accessibility are blind people, who cannot see the video.</p><p>The \"audio only\" version must contain all the important visual information in the video.</p><p>Generally speaking, it is easier to produce an audio version than a text version when the video is highly descriptive (text transcription often requires a great deal of editorial work). It should be remembered, however, that only a text transcript provides universal access to the information in the video, in the event that a user is unable to launch the video, for example.</p>"
    },
    {
      "title": "Application mechanism for displaying a correct contrast ratio",
      "body": "<p>A user interface component provided by the application author, the activation of which modifies the appearance of the screen.</p><p>This could be, for example, a replacement mechanism enabling content to be displayed with a sufficient contrast ratio. The appearance of this user interface component shall comply with <a href=\"referentiel-technique.md#crit-2-2\">criterion 2.2</a> and <a href=\"referentiel-technique.md#crit-2-3\">criterion 2.3</a> without itself having recourse to a mechanism enabling a compliant contrast ratio to be displayed.</p><p>Another example is a replacement mechanism to replace text graphic elements with styled text.</p><p>This mechanism must preserve the content and functionality of the application or screen it modifies.</p>"
    },
    {
      "title": "Audio description (time-based media)",
      "body": "<p>Narration added (via a sound file) to an audio track to describe important visual details that cannot be understood from the main audio track alone. The audio description must be synchronised with the time-based media by an application device linked to the media player.</p><p><strong>Note 1:</strong> the audio description of a video provides information about actions, characters, scene changes, on-screen text and other visual content.</p><p><strong>Note 2:</strong> in standard audio description, narration is added during pauses in the dialogue (see also extended audio description).</p><p><strong>Note 3:</strong> when all the information in the video is already given in the audio track, no additional audio description is required.</p>"
    },
    {
      "title": "Biological characteristics",
      "body": "<p>User identification or control methods based on usable biological characteristics may include</p><ul> <li>fingerprint recognition;</li> <li>facial recognition;</li> <li>voice recognition.</li> </ul>"
    },
    {
      "title": "CAPTCHA",
      "body": "<p>A CAPTCHA is a test used to distinguish a human user from a computer. The test often uses graphic elements containing distorted text, mixed with other shapes or using altered colour schemes, which the user is asked to retype. Other forms of CAPTCHA may be based on logical questions or sound clips.</p><p>W3C provides full documentation on the accessibility of this type of test: <a href=\"https://www.w3.org/TR/turingtest/\">Inaccessibility of CAPTCHA</a>.</p>"
    },
    {
      "title": "Clearly identifiable adjacent",
      "body": "<p>The element is made available adjacent to the object identified by the criterion in the graphical representation and in the keyboard navigation order. If necessary, the item may be available elsewhere in the software and be accessible with a function (a button for example) which is adjacent to the object identified in the criterion, explicit and clearly identifiable (the name of the function is explicit).</p>"
    },
    {
      "title": "Complex action",
      "body": "<p>A complex action is one in which the downward and upward actions of the pointer are inseparable events in the action, so that it is not possible for the user to cancel the downward action simply by moving the pointer outside the interactive zone. This is the case, for example, with drag'n'drop mechanisms, where the downward action of the pointer selects an item and the upward action of the pointer positions the item.</p>"
    },
    {
      "title": "Changes of context",
      "body": "<p>Major changes in the content of a screen which, if made without the user being aware of them, can disorientate the user who cannot see the whole screen at the same time. change of contexts include changes to:</p><ul> <li>application;</li> <li>user agent;</li> <li>rendition space;</li> <li>focus;</li> <li>content that modifies the meaning of the screen.</li> </ul><p><strong>Note:</strong> a change in content is not always a change in context. A change in content, such as the expansion of a tree structure, a dynamic menu or moving a tab, does not necessarily change the context, unless it also changes one of the elements listed above (the focus, for example).</p><p><strong>Example:</strong> opening in another user agent, moving the focus to a different component or significantly reorganising the screen content are all examples of a change of context.</p>"
    },
    {
      "title": "Compatible with assistive technologies",
      "body": "<p>Content or functionality must be compatible with assistive technologies and software accessibility features via an accessibility API.</p><p>This concerns the technology, its functions and its uses:</p><ul> <li>The way the technology is used must be compatible with assistive technologies. This means that the way in which the technology is used has been tested for interoperability with users of assistive technologies in the software content.</li> <li>The technology runs natively on the platform and uses the platform's accessibility API.</li> </ul>"
    },
    {
      "title": "Complex and simple gestures",
      "body": "<p>A simple gesture with a screen involves touching a single point on the screen. This may be a single press or click, a double press or click, or a long press.</p><p>A complex gesture can be</p><ul> <li>a gesture involving several points of contact on the screen (example: a gesture with two fingers on the screen to zoom in or out on a map);</li> <li>a gesture based on following a trajectory on the screen (e.g. a function that detects the movement of a finger to the left or right on a tactile surface to trigger switching to the previous/next item in a carousel).</li> </ul>"
    },
    {
      "title": "Complex data table",
      "body": "<p>When a data table contains headers that are not distributed solely over the first row and/or column of the grid, or whose scope does not apply to the entire column or row, it is referred to as a complex data table. It is then necessary to provide a \"summary\" to explain its nature and structure in order to make it easier to consult for users of assistive technologies, for example.</p>"
    },
    {
      "title": "Component whose nature is not obvious",
      "body": "<p>An interactive component mixed with non-interactive elements (text, for example) and which is not visually distinguishable from the non-interactive elements.</p>"
    },
    {
      "title": "Consistent (reading sequence)",
      "body": "<p>Understandable content is readable (the order of the elements is logical) and coherent (the reading sequence is consistent).</p>"
    },
    {
      "title": "Contrast",
      "body": "<p>Marked opposition between the brightness of a foreground colour and a background colour. The contrast ratio is based on the difference in relative luminance between the background and the foreground according to the rule: (L1 + 0.05) / (L2 + 0.05) where L1 is the lightest relative luminance and L2 the darkest relative luminance. Luminosity is calculated using the following formula: L = 0.2126 * R + 0.7152 * G + 0.0722 * B. Where R, G and B are defined by</p><ul> <li>If RsRGB &lt;= 0.03928 then R = RsRGB/12.92 otherwise R = ((RsRGB+0.055)/1.055) ^ 2.4;</li> <li>If GsRGB &lt;= 0.03928 then G = GsRGB/12.92 otherwise G = ((GsRGB+0.055)/1.055) ^ 2.4;</li> <li>If BsRGB &lt;= 0.03928 then B = BsRGB/12.92 otherwise B = ((BsRGB+0.055)/1.055) ^ 2.4.</li> </ul><p>and RsRGB, GsRGB and BsRGB are defined by</p><ul> <li>RsRGB = R8bit/255;</li> <li>GsRGB = G8bit/255;</li> <li>BsRGB = B8bit/255.</li> </ul><p>The \"^\" character is the power operator.</p><p><strong>Note:</strong> the contrast measurement concerns text, content in graphic elements, text and image of text in animations, captions text and embedded text in videos. Text in the elements of a graphic element or video (e.g. a sign, poster, etc.) is not affected.</p><p><strong>Source:</strong> <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G18#procedure\">WCAG contrast calculation procedure</a>.</p>"
    },
    {
      "title": "Contrast (text size)",
      "body": "<p>The standard distinguishes between several sizes of text to be evaluated, each size having a contrast threshold. These sizes are evaluated in pixels or points. The larger the text (greater than 18.5px bold or 24px normal weight), the lower the required ratio (3:1).</p><p>Given the difficulty of assessing font sizes on mobile devices, all text should be considered at normal size except for text that is significantly very large.</p><p>For example, text could be considered \"significantly very large\" if its constituent letters are at least 1.5 cm high and/or wide.</p>"
    },
    {
      "title": "Control (moving or blinking content)",
      "body": "<p>The ability for the user to control the display or playback of moving or blinking content using any pointing device (touch, keyboard, mouse, etc.).</p><p>All moving content, with the exception of time-based media supported by the <a href=\"referentiel-technique.html#topic-3\">Multimedia</a> theme, is concerned: animated graphic elements and moving content, for example.</p><p><strong>Note 1:</strong> where appropriate, the control method should be available as the first element of the interface.</p><p><strong>Note 2:</strong> the control method for moving or blinking content must allow the user to interact with the rest of the application. As a result, stopping or pausing via an event triggered only when focused does not meet this criterion.</p><p><strong>Note 3:</strong> In some cases, movement is an integral part of the component and it is not possible to give the user control over it, for example a progress bar whose function is to indicate by movement the progress of an event such as a download. In this case, the criterion does not apply.</p>"
    },
    {
      "title": "Control (automatically triggered sound)",
      "body": "<p>Option for the user to stop or restart an automatically triggered sound.</p><p><strong>Note:</strong> the sound control method should be available as the first item on the screen.</p>"
    },
    {
      "title": "Data table",
      "body": "<p>Element used to structure information in rows and columns using data cells and header cells.</p>"
    },
    {
      "title": "(Data) table title",
      "body": "<p>Text linked to the table that identifies the content of a data table clearly and concisely.</p>"
    },
    {
      "title": "Decorative graphic element",
      "body": "<p><a href=\"#graphic-element\">Graphic element</a> having no function and conveying no specific information in relation to the content with which it is associated. Examples:</p><ul> <li>A graphic element part of the layout.</li> <li>A graphic element next to a button label used simply as a graphic embellishment (icon, layout).</li> <li>A graphic element that does not provide any information necessary for understanding the text to which it is associated (a decorative image).</li> </ul>"
    },
    {
      "title": "Detailed description",
      "body": "<p>Content associated with a <a href=\"#graphic-element\">graphic element</a> in addition to its textual alternative in order to fully describe the information conveyed by the element.</p>"
    },
    {
      "title": "Editing tool",
      "body": "<p>Application used to create or modify content for distribution to other users. An editing tool can be used by one or more users working together.</p><p>An editing tool can be</p><ul> <li>the tool as delivered by the editor;</li> <li>the tool enhanced with extensions not developed by the publisher;</li> <li>a set of tools.</li> </ul><p>Examples of editing tools</p><ul> <li>an application for editing and controlling the content of a website or application, e.g. CMS (Content Management System), LMS (Learning Management System), LCMS (Learning Content Management System), content aggregator;</li> <li>multimedia editing tools;</li> <li>applications for creating web applications;</li> <li>application for editing code;</li> <li>application for exporting in web technology format (for example, software for saving in HTML);</li> <li>applications that generate content using templates, scripts, command lines, etc.;</li> <li>an application for editing portions of web pages or applications (typically, blog systems, wikis and forums);</li> <li>mail application for sending e-mails.</li> </ul><p>Examples of editing tools that are not included in the scope</p><ul> <li>An application where the content created is not made available to other users (note-taking application with no sharing functionality, for example). In this case, the edited content is only available to the owner and is not made available to other users.</li> <li>Forms intended for users. For example, an order form for an e-commerce application. Although forms allow content to be edited, this content is not made available to other users.</li> <li>Independent accessibility control tools: these tools do not modify the content they control.</li> </ul>"
    },
    {
      "title": "Error management (form)",
      "body": "<p>All the processes used to inform the user</p><ul> <li>mandatory fields,</li> <li>expected type or format indications,</li> <li>input errors in a form.</li> </ul>"
    },
    {
      "title": "Graphic element",
      "body": "<p>Element using a visual representation such as images, pictograms or graphics.</p><p>This element may be made up of one or more parts which need to be visible in order to be understood (for example, each point on each line of a statistics chart).</p><p>The \"Image\" role is not rendered uniformly in all environments.</p><ul> <li>TalkBack (Android): the nature of graphic elements is not rendered when they are integrated into a native application; the screen reader will render the description if it is defined but will not announce \"image\". However, for images embedded in <a href=\"glossary.md#web-views\">web views</a>, the screen reader will render \"Graphic elements\".</li> <li>VoiceOver (iOS): whether in a native application or in a web view, VoiceOver renders \"Image\" for images it can access.</li> </ul><p>Generally speaking, depending on the development method, it is also possible that the role is not rendered on either TalkBack or VoiceOver. In this case, observation alone will determine the nature of the element.</p><p>In most cases, it is not essential for the \"Image\" role to be rendered. Except in special cases where identification of the role is essential, the absence of a rendered role cannot constitute non-compliance.</p>"
    },
    {
      "title": "Graphic element conveying information",
      "body": "<p>A <a href=\"#graphic-element\">graphic element</a> that conveys information needed to understand the content with which it is associated.</p>"
    },
    {
      "title": "Graphic element with legend",
      "body": "<p>When a text adjacent to a graphic element contains information about the graphic element (e.g. copyright, date, author, etc.) or is intended to supplement the information provided by the graphic element (e.g. a text associated with an image in an image gallery), it is referred to as a captioned graphic element.</p><p>When a graphic element is captioned, it is necessary to associate the legend with the graphic element, so that assistive technologies can treat the graphic element and its legend as a single whole.</p>"
    },
    {
      "title": "Ignored by assistive technologies",
      "body": "<p>Rendering elements such as decorative graphic elements that do not provide relevant information can create complex consultation conditions by overloading the rendering by assistive technologies with useless information.</p><p>It is therefore important to be able to prevent these elements from being rendered. Most accessibility APIs have properties or methods for preventing this type of element from being rendered.</p>"
    },
    {
      "title": "Information (provided by colour)",
      "body": "<p>Information transmitted visually by means of a colour. The indication that fields in red are mandatory in a form, the active button in a list of buttons, the change of colour of an item name to indicate its unavailability in a list of items are all examples of information given by colour.</p><p>Indication by colour alone must be accompanied by another method for users who do not see or perceive colours or their associations well.</p><p>The indication given by colour must be provided</p><ul> <li>by means of formatting for users with limited colour perception;</li> <li>and by descriptive (non-visible) information present on the element so that screen readers can render the information to users who cannot see.</li> </ul>"
    },
    {
      "title": "Indication conveyed by shape, size or location",
      "body": "<p>This may be, for example</p><ul> <li>the presence of a visual marker, to indicate the active screen in a navigation menu (indication given by position);</li> <li>a highlight to indicate an active tab (indication given by the shape);</li> <li>changing the font size in a tag cloud (indication given by the size);</li> <li>or any other similar graphic effect.</li> </ul>"
    },
    {
      "title": "Input unit",
      "body": "<p>For character-by-character input, the smallest text input unit is the character.</p><p>For a system with word prediction functionality, the smallest input unit is the word.</p><p>For some speech recognition systems, the text is not retranscribed until an entire word or phrase has been spoken. In this case, the smallest input unit is the word or phrase.</p>"
    },
    {
      "title": "Key features of captions",
      "body": "<p>It is possible to apply presentation effects to captions (text colour, style, font) in order to convey information to users (e.g. identify the person speaking). These key features of captions are essential for users to understand them and should be retained during the transformation process (sending or recording the video, for example) if they are present.</p>"
    },
    {
      "title": "Key repeat",
      "body": "<p>Feature which consists of printing (on the screen, in an input zone for example) a character several times as long as the corresponding key on the keyboard (visual or physical) is activated.</p>"
    },
    {
      "title": "Keyboard shortcut",
      "body": "<p>A means of triggering an action associated with a user interface component by pressing one or more keys on a keyboard.</p>"
    },
    {
      "title": "Keyboard trap",
      "body": "<p>A keyboard trap occurs when a user navigating with the keyboard from a position on the screen (e.g. a form field, a button, a complex component) cannot reach the next or previous component.</p><p>There are special cases where it is necessary to capture the keyboard focus and prevent the user from reaching the elements following or preceding the element currently being viewed. For example, in a modal window it is imperative that the user navigating with the keyboard cannot reach components outside the modal window as long as the latter is active.</p>"
    },
    {
      "title": "Label and field located next to each other",
      "body": "<p>The label and its field must be visually close, so that the relationship between the two cannot lead to confusion.</p>"
    },
    {
      "title": "Name, role, value, properties and changes of state",
      "body": "<p>A component must have an appropriate role and name, and any values, states and properties must also be accessible and correctly passed on to the accessibility APIs.</p><p>The name can be the title of the component, such as the accessible name of a button, for example.</p><p>The value is, for example, the selected item in a drop-down list or the current value of a cursor.</p><p>The role corresponds to the type of element defined in the specification of the technology used. The role (button, link, input field, for example) is generally rendered by assistive technologies.</p><p>Parameters correspond to specific information about a component. For example, a parameter that transmits to the APIs the information that the component controls such and such content.</p><p>Changes of state must also be made available. For example, using a property to tell the APIs that the component is \"open\" or \"closed\". Note: a state can also be transmitted via the name, when it is dynamically changed to correspond to the state of the controlled zone in particular.</p><p>These parameters are not mandatory, but may be required if they are essential for making the component accessible. It is up to the auditor to consider the cases where these parameters are essential, depending on the context in which the component is used.</p><p>The auditor must also check that, where they are present, these parameters are used correctly.</p>"
    },
    {
      "title": "Native platform controls",
      "body": "<p>Platforms have native controls, for example a native color picker for colour selection, a calendar or a specific field containing the format control for date selection, etc. Form fields that expect particular formats (such as a date, for example) should use the platform's native controls to ensure maximum compatibility with assistive technologies.</p>"
    },
    {
      "title": "Only for layout purposes",
      "body": "<p>Use of interface elements for a purpose other than that stated in the specifications. For example, a misuse in an application could be the use of an interactive element (button for example) as plain text.</p>"
    },
    {
      "title": "Personal user data",
      "body": "<p>Personal data concerning the user in a form can be</p><ul> <li>surname;</li> <li>first name;</li> <li>password;</li> <li>e-mail address;</li> <li>postal address;</li> <li>postcode;</li> <li>telephone number;</li> <li>credit card codes;</li> <li>birthday;</li> <li>the URL of a web page presenting the user or the organisation that the person represents.</li> </ul>"
    },
    {
      "title": "Primary control (of a time-based media)",
      "body": "<p>Primary control functions are the basic functions of a media player: play, pause, stop, audio control.</p>"
    },
    {
      "title": "QVGA",
      "body": "<p>QVGA (Quarter Video Graphics Array) resolution is a display standard that corresponds to a size of 320 pixels X 240 pixels (i.e. 76,800 pixels).</p>"
    },
    {
      "title": "Real-time text communication",
      "body": "<p>Real-time text (RTT) is a mode of written communication which allows users to read the text being written by the sender, without waiting for the sender to validate (for example with the enter key).</p><p>Example of real-time text communication integrated into a platform: <a href=\"https://support.apple.com/en-us/HT207033\">Answer or make RTT or TTY calls from your iPhone</a></p>"
    },
    {
      "title": "Refresh process",
      "body": "<p>A technique for modifying the content of one or more screen elements. The user must be able to control each refresh process independently.</p>"
    },
    {
      "title": "Related form controls",
      "body": "<p>In a form, all the fields that can be grouped together by the nature of the information required. The purpose of grouping is to identify fields that should be treated as a whole.</p><p>Here are some examples:</p><ul> <li>Three successive fields for entering a date (day/month/year);</li> <li>Successive fields for a telephone number;</li> <li>A block for entering the user's identity and address, when the form contains several contact blocks;</li> <li>A set of radio buttons or tick boxes relating to a question.</li> </ul><p>These fields must be grouped together when the field labels are not sufficient to inform the user that the fields are part of a group.</p><p>When the form consists of a single block of information of the same kind (the user's identity and address, for example) or a single field (a search engine, for example), the grouping of fields is not mandatory.</p>"
    },
    {
      "title": "Relay service",
      "body": "<p>Relay services allow users, whatever their mode of communication (text, sign, speech) to interact remotely during real-time communication with other participants, by providing conversion between modes of communication.</p><p>For example, there are relays that enable a user who communicates using sign language to communicate with someone who does not, via a service that provides live interpreting.</p>"
    },
    {
      "title": "Replacement mechanism",
      "body": "<p>A replacement mechanism is a feature that allows the user to access a version of the application with certain parameters (usually display parameters) modified (for example, font and background colours).</p><p>This mechanism may be provided by the platform itself or by the application. Where the platform has a robust replacement mechanism, authors should use it instead of an application-specific replacement mechanism.</p><p>Platforms offer users several replacement mechanisms. The activation of these replacement mechanisms is detectable by the applications, which can in turn serve specific information and presentations.</p><h5>Replacement mechanisms available in iOS</h5><ul> <li><strong>Increase contrast</strong>: The option is available from the path: <em>Settings &gt; Accessibility &gt; Display &amp; text size &gt; Increase contrast</em>. When enabled, this option allows different styles to be loaded that have been defined by the author for this specific option in order to offer a higher contrast version to users who need it. In addition, this option increases the contrast of native iOS components such as switch buttons.</li> <li><strong>Differentiate without colour</strong>: This option is available via the path: <em>Settings &gt; Accessibility &gt; Display &amp; text size &gt; Differentiate without colour</em>. When enabled, this option allows you to load additional visual information other than colour (for example, shape or size) that has been defined by the author for this specific option, in order to highlight a graphic element whose colouring carries information (an active button, for example).</li> </ul><h5>Replacement mechanisms available on Android</h5><p>There are no replacement mechanisms in Android that are equivalent to those in iOS, or that are sufficiently robust.</p><p>The replacement mechanism available on Android (\"<strong>High contrast text</strong>\") is still experimental. Its use is not currently recommended.</p><h5>Other replacement mechanisms not provided by the platforms</h5><p>If the platform does not provide a replacement mechanism for certain parameters, the application can provide one from its interface.</p>"
    },
    {
      "title": "Status message",
      "body": "<p>A status message informs the user of a change in content on the screen without interrupting their main activity (there is no change of context, such as repositioning the focus on the message).</p><p>A status message can inform about</p><ul> <li>The success or result of an action;</li> <li>The busy state of an application;</li> <li>The progress of a process;</li> <li>The existence of an error.</li> </ul><p>A status message is not necessarily visible on the screen, but it must always be accessible to assistive technologies.</p>"
    },
    {
      "title": "Styled text",
      "body": "<p>Text whose appearance is controlled by the platform's formatting technology (such as CSS for HTML pages).</p>"
    },
    {
      "title": "Sudden change in brightness or blinking effect",
      "body": "<p>Alternating relative brightness that can cause seizures in some people, if they are large enough in a specific frequency range.</p>"
    },
    {
      "title": "Summary (of table)",
      "body": "<p>A summary (of table) is a passage of text associated with a complex data table. It provides information about the nature and structure of the table to make it easier to use for users of assistive technologies, for example.</p><p><strong>Note:</strong> although the main users affected are those using screen readers, other users may also benefit from this information, such as certain people with visual or intellectual impairments. In this case, the summary, although hidden by default, should be made visible by means of a button, for example.</p>"
    },
    {
      "title": "Support services",
      "body": "<p>A support service can be</p><ul> <li>a help desk,</li> <li>a call centre,</li> <li>a technical support,</li> <li>a <a href=\"#relay-service\">relay service</a>,</li> <li>a training service.</li> </ul>"
    },
    {
      "title": "Synchronised captions (media object)",
      "body": "<p>Text of audio information (a character's words, important noise to understand the action, etc.) present in a time-based medium and displayed synchronously with the flow of the multimedia object.</p><p><strong>Note 1:</strong> to differentiate between sound sources (different characters, voice-over, etc.), it is recommended that an appropriate mechanism be used (bracketing, italics, explicit announcement such as \"voice-over: ...\").</p><p><strong>Note 2:</strong> subtitling for translation should not be confused with captioning for the deaf and hard of hearing. Subtitling and captioning serve different purposes. Only the presence and relevance of captions for the deaf and hard of hearing will ensure compliance.</p>"
    },
    {
      "title": "Navigation sequence",
      "body": "<p>The order in which the keyboard focus moves (to the next element or to the previous element).</p><p><strong>Warning:</strong> when an element initiates a change in the screen (change of context, management of hidden zones, addition of content, management of form fields, etc.) it is necessary to activate the element initiating the change in order to test the consistency of the navigation sequence.</p>"
    },
    {
      "title": "Template",
      "body": "<p>A template is a document format with predefined parameters. It is used to insert content edited by the author. A template has presentation, usage and technical parameters that are not visible.</p><p>A template may concern an entire page or screen (home page template, etc.) or specific types of content (forms, videos, etc.)</p><p>A set of templates is a group of templates that allow different formatting of the same element. For example</p><ul> <li>templates for the application's home screen;</li> <li>templates for screens containing interactive elements;</li> <li>templates for creating a PDF.</li> </ul>"
    },
    {
      "title": "Test graphic element",
      "body": "<p><a href=\"#graphic-element\">Graphic element</a> used in a test, a CAPTCHA or a graphic element used as a test in a quiz or game. Example: a series of graphic elements presents a detail from a famous painting. You need to recognise the title and painter of each painting. In this situation, it is not possible to give a relevant alternative (for example the name of the painting and/or the painter) without rendering the test unusable. In this case, the alternative must simply give the possibility of identifying the graphic element, for example \"test image 1\".</p>"
    },
    {
      "title": "Text graphic element",
      "body": "<p><a href=\"#graphic-element\">Graphic element</a> displaying text.</p><p>The use of graphic elements containing text is not recommended. Where it is possible to reproduce the same effects with the technology in which the interface is developed, <a href=\"referentiel-technique.html#crit-1-8\">criterion 1.8</a> requires that the text be reproduced in this format or that a replacement mechanism allows the user to replace these graphic elements with styled text.</p>"
    },
    {
      "title": "Time-based media (audio, video and synchronised)",
      "body": "<ul> <li>Time-based media audio-only: sound content (wave, MP3...).</li> <li>Time-based media video-only: moving or sequential images or photos.</li> <li>Synchronised time-based media: audio or video streams synchronised with another format to present information and/or including interactive temporal components. Time-based media can be viewed in 2 different ways: <ul> <li>as a downloadable file that can be viewed with external software;</li> <li>content embedded in the software and viewable from the interface.</li> </ul> </li> </ul><p>Time-based media can be broadcast in real time or played back asynchronously (pre-recorded media).</p>"
    },
    {
      "title": "Time stamp",
      "body": "<p>The video time stamp is the time value declared in the caption file.</p><pre><code>1 00:00:03,000 --&gt; 00:00:06,999 The title should appear when the video reaches 3 seconds. </code></pre>"
    },
    {
      "title": "Toggle control",
      "body": "<p>A toggle control is a control that can have 2 or 3 states, so the user-defined state is persisted to the next state. It can be a screen lock control (the screen is either on or off), or a control for enabling or disabling application notifications.</p><p>Examples of toggle controls</p><ul> <li>a checkbox,</li> <li>a radio button,</li> <li>a button that can have an enabled or disabled state.</li> </ul>"
    },
    {
      "title": "Transcript (time-based media)",
      "body": "<p>Text content associated with time-based media using the appropriate technique (text present in the interface or in a text file located on the same screen or available via a button). This content gives the user access (independently of viewing the multimedia object) to</p><ul> <li>everything that is said orally;</li> <li>all the descriptive information needed for an equivalent understanding of the action.</li> </ul><p>This textual information must be presented in the chronological order in which it appears in the time-based media.</p>"
    },
    {
      "title": "Transformation",
      "body": "<p>Process managed automatically by the tool. There are two types of transformation:</p><ul> <li>content restructuring: transformation during which the input format (e.g. HTML, XML...) is the same as the output one, the restructuring only modifies elements of the markup. For example: linearising a table, dividing a document into several pages.</li> <li>content recoding: transformation during which the input format is different of the output one (e.g. HTML to XHTML, HTML to PDF). This applies in particular to editing zones that use a different syntax to that which will be used for public display.</li> </ul>"
    },
    {
      "title": "Two-way voice communication application",
      "body": "<p>Two-way voice communication applications are applications that allow 2 or more people to speak simultaneously. Videoconferencing applications, which allow people to speak at the same time, are an example.</p>"
    },
    {
      "title": "User interface component",
      "body": "<p>A user interface component is an element with which the user can interact, for example a button, a link or an input zone. Some components can be more complex, such as a menu, a dialogue window or a system of tabs. Finally, a user interface component can be based on elements native to the platform language or developed from scratch.</p>"
    },
    {
      "title": "Viewing control (time-based media)",
      "body": "<p>Possibility for the user to control the viewing of time-based media using the keyboard and any pointing device, at least. The following points must be respected:</p><p>List of mandatory features for controlling consultation</p><ul> <li>The multimedia object must always have at least the following functions: play, pause or stop;</li> <li>If the multimedia object has sound, it must have a sound on/off function;</li> <li>If the multimedia object has audio description, it must have a function for controlling the activation and deactivation of audio description;</li> <li>If the multimedia object has closed captions, it must have functionality for controlling the activation and deactivation of closed captions.</li> </ul><p>Each function must be accessible via the keyboard and any pointing device (touch, screen reader, keyboard, mouse, etc.).</p><p>If the player does not allow a second audio track to be included for audio description, a link (or button) to an alternative video with audio description is a satisfactory alternative feature. The same applies to closed captions: if the video does not have closed captions that can be activated and deactivated, the presence of an alternative video with closed captions (available via a link or a button) is a satisfactory alternative.</p><p><strong>Note:</strong> If there is no sound in a time-based media, there is no point in adding a sound activation/deactivation feature. However, if this functionality is present and requires a text alternative to be understood by certain users, then it should be given one since the user is likely to access it and want to activate it.</p>"
    },
    {
      "title": "Voice-based services",
      "body": "<p>In an oral communication system (e.g. telephony), features may be provided, for example:</p><ul> <li>a voice mailbox (answering machine);</li> <li>an automatic switchboard that requires you to say a number between 1 and 4 to be redirected to a service;</li> <li>or any other interactive voice server.</li> </ul>"
    },
    {
      "title": "Web views",
      "body": "<p>These are web pages (created in HTML and CSS) embedded in a mobile application. Web views can be entire application screens or just parts of screens (for example, advertising inserts).</p>"
    }
  ]
}