{
  "title": "Référentiel général d&#39;écoconception de services numérique",
  "description": "Référentiel piloté par la DINUM, le Ministère de la Transition Écologique, l’ADEME et l’Institut du Numérique Responsable",
  "version": "v2",
  "updated_at": "2023-11-10",
  "author": {
    "name": "MiNumEco, la mission interministérielle numérique écoresponsable"
  },
  "criteres": [{
      "id": "1.1",
      "critere": "Le service numérique a-t-il été évalué favorablement en termes d'utilité en tenant compte de ses impacts environnementaux ?",
      "thematique": "Stratégie",
      "objectif": "Prendre en compte l’utilité du service numérique dès sa conception et son inscription dans au moins l’un des objectifs de développement durable (ODD), l’un des enjeux de limites planétaires ou tout autre référentiel du même type.",
      "miseEnOeuvre": "Pour évaluer l’utilité du service, se référer à des référentiels et déterminer en amont du projet si son utilité est avérée, en particulier :\n- les [17 ODD de l'ONU](https://fr.wikipedia.org/wiki/Objectifs_de_d%C3%A9veloppement_durable)\n- les [9 limites planétaires](https://fr.wikipedia.org/wiki/Limites_plan%C3%A9taires)\n- autre ?\n\nSi l'utilité du service ne s'inscrit pas dans ces référentiels, justifier en quoi le service est utile, participe à l'intérêt général ou est en appui à une politique publique.\n\nAfficher dans la déclaration d'écoconception (se référer aux critères dédiés) ou dans les mentions légales, les ODD dans lequel le service s'inscrit.\nVérifier par exemple un ou plusieurs de ces points : sa pertinence, son utilité, sa création de valeur, son bien fondé, son service pour l'intéret général, sa réponse à des besoins essentiels, sa participation à la mise en place de commun numérique, etc.",
      "controle": "Comment a été évalué le service, par exemple quels objectifs de développement durables s'inscrit le service, quelles sont les réponses aux enjeux de limites planétaires ou autre référentiel utilisé (précisé lequel), et leur pertinence dans la déclaration d'écoconception de ce service numérique.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "1.2",
      "critere": "Le service numérique a-t-il défini ses cibles utilisatrices, les besoins métiers et les attentes réelles des utilisateurs cibles ?",
      "thematique": "Stratégie",
      "objectif": "Pour répondre au plus juste aux utilisatrices et utilisateurs du service numérique, il est indispensable, de connaître ses cibles, leurs usages, leurs besoins et leurs comportements, afin de ne pas surcharger, les services numériques en fonctionnalités et contenus, ni les appauvrir au point qu’ils ne répondent, pas aux attentes. Sans l’identification des catégories d’utilisateurs primaires et secondaires, il est, difficile de dimensionner correctement le service numérique.\n Les incertitudes poussent à extrapoler les besoins souvent au-delà des attentes réelles. On peut également ne pas répondre aux « bons besoins » parce que l’on connaît mal ses utilisateurs ou l’on répond juste à ce que demande le commanditaire. Tout cela finit par être un mauvais investissement de ressources, de temps passé et des impacts environnementaux générés. Il faut éviter toute fonctionnalité non essentielle. D’autre part, il est important de vérifier qu’un ou plusieurs services existants répondent déjà au besoin, pour ne pas les dupliquer.",
      "miseEnOeuvre": "Pour la définition des cibles utilisatrices, mobiliser les outils et composants de la phase de Recherche UX (UX research) : étude concurrentielle, analyse de l’existant, définition des personas, réalisation d’entretiens ou de sondages avec les utilisateurs, observation, etc.\nConcernant l’identification des besoins métiers et des attentes réelles des utilisateurs cibles, les étapes suivantes pourront être suivies :\n- Entretiens avec les différentes parties prenantes et les métiers concernés ;\n- Recherche UX auprès des utilisateurs ciblés ;\n- Définir les utilisateurs primaires et secondaires ;\n- Pratique alliée : les approches agiles ;\n- Observation des statistiques d’usages dans le cas d’un service déjà existant.",
      "controle": "Donner accès à ces documents de référence de la phase de recherche : entretiens utilisateurs, étude UX, benchmark, personas, étude marketing, etc. permettant de définir précisément les utilisateurs cibles. Sur la base de ces éléments, des recherches, observations, sondages ou autres devraient également être accessibles permettant précisément de définir l’expression de besoin métier ou les attentes réelles des utilisateurs ciblés.\nLe profil des cibles utilisatrices ainsi que l’analyse des besoins métiers et des attentes des utilisateurs devraient être clairement renseignés dans la déclaration d’écoconception du service numérique ainsi que les choix effectués en ce sens.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "1.3",
      "critere": "Le service numérique a-t-il défini la liste des profils de matériel que les utilisateurs vont pouvoir employer pour y accéder ?",
      "thematique": "Stratégie",
      "objectif": "Un service numérique n'exploitant que des ressources techniques de toute dernière génération peut conduire les utilisateurs à renouveler leurs équipements afin d'y accéder (obsolescence matérielle).\nAinsi, certaines utilisations peuvent être contraintes par les terminaux des utilisateurs. Pour permettre un choix plus large d'équipements même anciens et limiter les renouvellements de matériels, il est important de connaître les profils de matériel que les utilisateurs vont pouvoir employer, aujourd'hui et demain : taille d'écran, écran tactile ou non, smartphone, tablette, ordinateur portable, ordinateur de bureau, etc.",
      "miseEnOeuvre": "Définir le profil des matériels supportés, le plus ancien possible afin d'éviter toute obscolescence matérielle.",
      "controle": "Le critère est validé si le profil des matériels supportés par le service, le plus ancien possible, est définiet affiché dans la déclaration d’écoconception du service.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "1.4",
      "critere": "Le service numérique est-il utilisable sur d’anciens modèles de terminaux ?",
      "thematique": "Stratégie",
      "objectif": "Selon l’étude ADEME-Arcep, les terminaux représentent 65 à 90% de l’empreinte environnementale du numérique selon l’indicateur considéré, en particulier leur fabrication. L’allongement de la durée de vie des terminaux est donc un levier essentiel de réduction des impacts environnementaux du numérique. Le service numérique doit limiter sa contribution à leur obsolescence en fonctionnant sur des équipements les plus anciens possibles.",
      "miseEnOeuvre": "S’assurer pour chaque fonctionnalité, que le service numérique est compatible avec des équipements anciens. Par exemple, ce critère peut être ajouté dans les tests ou QA (Quality assurance).\nPrécisions concernant le critère :\n\n- Il s’agit de la compatibilité avec un matériel et non avec un système d’exploitation ou tout autre logiciel faisant fonctionner le service numérique (par exemple un navigateur). Il ne s’agit donc pas ici de rendre compatible le service numérique avec des logiciels ou des systèmes d’exploitation dont les mises à jour de sécurité n’ont pas été faites.\n- Définition de « utilisable » ici : mode dégradé accepté mais sans perte de fonctionnalité incontournable ou critique ni de contenu pour le service.\n- Si le service numérique est une application native : le service numérique doit être utilisable sur les équipements mis sur le marché il y a 7 ans ou plus, dans la dernière version du système d’exploitation proposé par cet équipement.\n- Si le service numérique fonctionne sur un navigateur web : le service numérique doit être utilisable sur les équipements équipés d’un microprocesseur mis sur le marché il y a dix ans ou plus.\n- Pour les autres services numériques, leur utilisation doit être garantie sur des équipements ou périphériques mis sur le marché il y a 7 ans ou plus.\n- Une durée de compatibilité plus longue est recommandée. Préciser dans ce cas, l’objectif, par exemple dans la déclaration d’écoconception.\n- Ce critère n’exclut pas l’usage de fonctionnalités récentes permettant la réduction des impacts environnementaux à l’usage tant que le service reste disponible sur les anciennes versions (principe d’amélioration progressive).",
      "controle": "Contrôler la mise en œuvre selon la nature du service en vérifiant les points suivants :\n- Si le service numérique est une application native : tester les fonctionnalités critiques du service numérique sur un équipement ancien (par exemple un smartphone, une tablette ou TV connectée), c’est-à-dire mis sur le marché il y a sept ans ou plus, dans la dernière version du système d’exploitation proposé par cet équipement.\n- Si le service numérique fonctionne sur un navigateur web : les fonctionnalités critiques doivent fonctionner sur un PC portable (choisir un terminal en cohérence avec le public visé au 1.3) équipé d’un microprocesseur mis sur le marché il y a dix ans.\n- Pour les autres services numériques : tester les fonctionnalités critiques du service sur un terminal (exemple : équipements connectés) mis sur le marché il y a 7 ans ou plus.\nTenir compte du moment où l’évaluation est réalisée et non de la date de mise en ligne du service.\nLe critère est validé si le service est utilisable dans les conditions susmentionnées.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "1.5",
      "critere": "Le service numérique est-il utilisable sur d’anciennes versions du systèmes d’exploitation et navigateurs web ?",
      "thematique": "Stratégie",
      "objectif": "L’objectif est de permettre à des systèmes d’exploitation ou navigateurs web anciens d’être utilisés,afin d’allonger leur durée de vie. Les systèmes d’exploitation et les navigateurs étant parfois liés à un terminal, cette pratique peut donc partiellement permettre de réduire la contribution du service numérique à leur obsolescence. Ce critère prend en compte les dispositions européennes visant à garantir la mise à disposition de mises à jour correctives pour les systèmes d’exploitation de 5 ans.",
      "miseEnOeuvre": "Si le service numérique est une application native, il doit prendre en charge les dernières versions des systèmes d’exploitation supportés et être utilisable sur les versions anciennes de ces systèmes d’exploitation (hors mises à jour correctives), jusqu’à cinq ans, en prenant en compte la première date de mise à disposition en version stable.\n Le service numérique fonctionne sur un navigateur web, il doit prendre en charge les dernières versions des navigateurs web (hors mises à jour correctives) et être utilisable sur les versions anciennes des principaux navigateurs web, jusqu’à deux ans, en prenant en compte la première date de mise à disposition en version stable",
      "controle": "Contrôler la mise en œuvre selon la nature du service en vérifiant les points suivants :\n- Si le service numérique est une application native : tester les fonctionnalités critiques du service numérique sur les systèmes d’exploitation supportés ayant cinq ans, en prenant en compte la première date de mise à disposition en version stable.\n- Si le service numérique fonctionne sur un navigateur web : tester que les fonctionnalités critiques fonctionnent sur les principaux navigateurs web dans une version datée d’au moins deux ans, en prenant en compte la première date de mise à disposition en version stable.\nLa déclaration d’écoconception du service numérique devrait spécifier :\n- Si le service numérique est une application native : les versions minimales des systèmes d’exploitation supportés.\n- Si le service numérique fonctionne sur un navigateur web : les versions minimales des navigateurs web compatibles. Si certaines fonctionnalités requièrent une version plus récente, indiquer les versions minimales avec et sans support de ces fonctionnalités.",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "1.6",
      "critere": "Le service numérique devrait participer à limiter l’achat de nouveaux terminaux en fonctionnant sur des équipements aux dimensions d’écrans variées, dont les plus petites (smartphones anciens par exemple). La possibilité d’un service numérique de s’adapter aux écrans avec une faible définition peut contribuer à lutter contre l’obsolescence des équipements induite par le logiciel.",
      "thematique": "Stratégie",
      "objectif": "Le service numérique doit participer à limiter l'achat de nouveaux terminaux en fonctionnant sur des équipements aux dimensions d'écrans variées, dont les plus petites (smartphones anciens par exemple).",
      "miseEnOeuvre": "Uniquement si applicable, rendre l’interface du service numérique adaptable à la taille de l’écran sans perte d’utilisabilité (« responsive design »).\nDans l’objectif d’éviter la multiplication des terminaux pour accéder à différents services, il est recommandé que les services numériques soient adaptatifs et capables de s’afficher parfaitement sur le petit écran d’un mobile comme sur le grand écran d’un PC. Il vaut mieux éviter de dupliquer le service numérique avec une version spécifique pour chaque terminal. Il est également préférable que les menus soient utilisables en mode tactile comme via un clavier.",
      "controle": "Tester les fonctionnalités critiques du service numérique sur différentes tailles d’affichage (ordinateur de bureau, tablette et mobile) :\n- Le service doit adapter son mode d’affichage de manière dynamique selon la taille de l’écran (responsive web design).\n- Vérifier que les différents composants type menus soient accessibles via tout type d’interface y compris tactile ou non, avec ou sans souris.\n- S’assurer de l’affichage complet du service dans une zone de visualisation de 1200 pixels de large (ce qui correspond à la définition des écrans d’ordinateurs standards de 17 pouces au format 5/4 avec 80 pixels utilisés par une barre de lancement). Le critère est validé si les conditions susmentionnées sont remplies.",
      "difficulte": "Fort",
      "priorite": "Prioritaire"
    },{
      "id": "1.7",
      "critere": "Le service numérique a-t-il été conçu avec des technologies standard interopérables plutôt que des technologies spécifiques et fermées ?",
      "thematique": "Stratégie",
      "objectif": "L’objectif est de lutter contre l’obsolescence des équipements induite par le logiciel. Tout service numérique qui s’attachera à être le plus stable et pérenne dans le temps permettra l’allongement de la durée pendant laquelle les terminaux restent utilisables. Typiquement, le recours à de nouvelles interfaces programmatiques (API) ou de nouveaux standards non supportés par les terminaux plus anciens sont susceptibles de favoriser une obsolescence rapide des terminaux. Ainsi, l’interopérabilité des standards est un vecteur pour allonger la durée d’utilisation et de vie des terminaux. Autre exemple, les applications natives peuvent avoir besoin des dernières versions d’OS (système d’exploitation) ou même les dernières versions des équipements pour fonctionner, ce qui induit une obsolescence des matériels. Jusqu’à présent, encore peu d’applications natives fonctionnent sur des équipements au-delà de 7 ans, alors que des services numériques web (ou « web app ») par exemple sont a priori disponibles dans tout navigateur et pour tout type d’équipement, ce qui leur assure une bonne interopérabilité et une bonne longévité.",
      "miseEnOeuvre": "Bien en amont du développement, évaluer la faisabilité avec des technologies standard (par exemple, web plutôt que des applications natives) pour répondre au besoin des utilisateurs et des métiers. Il s’agit aussi de s’assurer que les API utilisées sont standard et sont bien supportées (API JavaScript dans les navigateurs web par exemple). S’appuyer sur des technologies interopérables permet de lutter contre l’obsolescence logicielle. De même, construire son service à partir de composants open source permet de garder la main sur la maintenance du code utilisé, par conséquent améliorer la durabilité du code et de réduire le risque d’obsolescence induite par le logiciel sur le matériel.\nDans le cas où une application native est nécessaire (par exemple, dans certains cas, si le service numérique nécessite des traitements de données particulièrement sensibles), s’assurer qu’elle utilise des standards compatibles avec les principaux systèmes d’exploitation.",
      "controle": "Le service numérique est utilisable par une même interface sur l’ensemble des terminaux pertinents (site internet, Web app). Si le service numérique est une application native, évaluer la nécessité d’avoir choisi de développer une application native : contraintes techniques, matériel cible maîtrisés ?\nLe service numérique s’appuie sur des standards interopérables pour les principaux systèmes d’exploitation.\nLe critère est validé si le service fourni propose une version web et/ou s’appuie sur les éventuels standards interopérables communs aux principaux systèmes d’exploitation (par exemple pour les interfaces graphiques).",
      "difficulte": "Fort",
      "priorite": "Recommandé"
    },{
      "id": "1.8",
      "critere": "Le service numérique a-t-il au moins un référent identifié en écoconception numérique ?",
      "thematique": "Stratégie",
      "objectif": "L'écoconception numérique adresse un très large périmètre, qu'il est difficile d'appréhender complètement dans chaque phase projet. Il est indispensable que les professionnels intervenant sur le projet puissent s'appuyer à tout moments sur une ou des personnes référentes afin de les assister dans les meilleures pratiques à déployer.",
      "miseEnOeuvre": "Le ou les référents, internes ou externes, s'assurent de l'acculturation des équipes projet à l'écoconception de service numérique afin d'encourager sa prise en compte dans les projets.",
      "controle": "Noms des référents et certifications ou qualifications obtenues.\nLe référent pourra notamment être chargé du suivi de la mise en œuvre du référentiel général de l’écoconception des services numériques.\nLe critère est validé si un contact (nominal ou générique) est précisé dans la déclaration d’écoconception du service ou tout autre document public et aisément accessible.",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "1.9",
      "critere": "Le service numérique a-t-il identifié des indicateurs pour mesurer ses impacts environnementaux ?",
      "thematique": "Stratégie",
      "objectif": "Connaître les impacts environnementaux du service numérique. Avoir une vision globale des conséquences du service numérique, à chaque phase (début, usage, fin) et en intégrant les impacts environnementaux des équipements matériels utilisés, dans la production et dans l'usage de ce service numérique.",
      "miseEnOeuvre": "Faire un diagnostic basé sur une méthodologie ACV, une analyse de cycle de vie (screening, simplifiée ou ISO) multicritère. Les indicateurs d'impacts environnementaux à considérer à minima la consommation d'énergie primaire, les émissions GES, la consommation d'eau bleue et l'épuisement des ressources abiotiques.\nLe périmètre de l'analyse de cycle de vie peut être élargi par exemple en tenant compte des moyens de productions : impacts environnementaux des équipements de conception, les services en ligne mobilisés (environnement de test, de QA...), les déplacements des équipes, etc.",
      "controle": "Un document de référence (Analyse de cycle de vie - ACV - par exemple) des actions à entreprendre ou déjà entreprises, classées par phase projet.\n* Quels sont les indicateurs définis ?\n* Comment sont suivis ces indicateurs ?\n* Sont-ils publiés / ouverts et si oui, où ?\n* Quel est le rythme de mesure ?",
      "difficulte": "Fort",
      "priorite": "Recommandé"
    },{
      "id": "1.10",
      "critere": "Le service numérique réalise-t-il régulièrement des revues pour s'assurer du respect de la réduction ou de la limitation de ses impacts environnementaux ?",
      "thematique": "Stratégie",
      "objectif": "Minimiser l’empreinte environnementale du service numérique",
      "miseEnOeuvre": "Fixer les objectifs en matière d’empreinte environnementale du service numérique au regard du nombre d’utilisateurs escomptés. Les indicateurs suivis doivent être choisis sur la base d’une ACV ou ACV simplifiée ou concerner a minima la consommation d’énergie primaire, les émissions GES, la consommation d’eau bleue et l’épuisement des ressources abiotiques. Selon le contexte, il convient de préciser s’il s’agit d’indicateurs en valeur absolue (kg CO2e) ou relative (kg CO2e / utilisateur)",
      "controle": "Des objectifs de réduction d’impacts environnementaux sont fixés pour le service au moins en termes de consommation d’énergie primaire, d’émissions de GES, de consommation en eau et ressources abiotiques (métal/minéral). Ces objectifs peuvent s’inscrire dans une trajectoire fixée au niveau du système ou de l’organisation. Le service est conforme à ce critère si le suivi de l’atteinte de ces objectifs de réduction d’impact fait l’objet d’un bilan régulier dans un document public et auditable par un tiers, par exemple dans la déclaration d’écoconception du service.",
      "difficulte": "Moyen",
      "priorite": "Prioritaire"
    },{
      "id": "1.11",
      "critere": "Le service numérique réalise-t-il régulièrement des revues pour s’assurer du respect de sa démarche d’écoconception ?",
      "thematique": "Stratégie",
      "objectif": "Selon le contexte, un service numérique peut évoluer : équipe qui change, ajout de contenu par les utilisateurs, traitements de plus en plus gourmands, etc. Pour veiller à ce que la démarche d’écoconception dure dans le temps, il est important de réaliser régulièrement une revue",
      "miseEnOeuvre": "Revue, audit ou auto-audit régulier, tous les mois ou tous les ans selon le contexte et la taille du projet, en appliquant ce référentiel. De plus, réaliser des audits de performances et tests de charge au sein de l’application / composant / micro service avec identification des bottlenecks (goulots d’étranglement), des ressources utilisées, etc.",
      "controle": "Mise à disposition du résultat de la revue, résultat des audits de performance et de charges, résultat de l’audit en se basant sur ce référentiel.",
      "difficulte": "Fort",
      "priorite": "Recommandé"
    },{
      "id": "1.12",
      "critere": "Le service numérique minimise-t-il la collecte de données au strict nécessaire ?",
      "thematique": "Stratégie",
      "objectif": "Cette pratique vise à encourager une collecte de données responsable et raisonnée en complément des dispositifs existants prévus par le Règlement Général sur la Protection des Données (RGPD) en ce qui concerne les données personnelles. Il s’agira donc d’œuvrer à réduire la quantité de données collectées, traitées et stockées par le service, y compris les données non personnelles et métadonnées, pour optimiser l'utilisation des ressources informatiques. Afin de limiter le profilage des utilisateurs, consommateur en ressources, le critère vise également à restreindre la collecte et le traitement de métadonnées aux fins de tracking.",
      "miseEnOeuvre": "Définir clairement les données nécessaires au fonctionnement du service, en cohérence avec les cibles utilisatrices et leurs attentes telles que définies au point 1.2 du présent référentiel. Si une donnée ne contribue pas directement à l'amélioration de l'expérience utilisateur ou au fonctionnement du service, envisager de ne pas la collecter. La collecte de métadonnées dans une perspective de profilage des utilisateurs devra être évitée.\nPour chaque type de donnée jugée essentielle au fonctionnement du service et aux besoins des utilisateurs, définir les conditions de collecte qui devront expressément respecter les dispositifs du RGPD en ce qui concerne les données personnelles. Pour les données non personnelles, la durée de conservation devra également être minimisée afin de réduire le stockage excessif de données. Systématiser la mise en place d’une une information complète, le droit de s’opposer et/ou la demande de consentement explicite de l’utilisateur pour l’ensemble des données collectées, y compris pour les données non personnelles.",
      "controle": "Contrôler le type et la quantité de données collectées, traitées et stockées par le service.\nEn ce qui concerne les données personnelles, les dispositifs prévus par le RGPD en matière de minimisation de la collecte de données devront être strictement suivis.\nDe façon plus large, pour l’ensemble des données collectées (y compris non personnelles), justifier dans la déclaration d’écoconception du service le besoin de cette collecte au regard des cibles utilisatrices du service (point 1.2.), la limitation de leur traitement et de la durée de conservation et documenter les outils de recueil du consentement le cas échéant. En ce qui concerne les données personnelles, un renvoi pourra être fait au registre de traitements des données personnelles tel que prévu par le RGPD.\nNe pas collecter des métadonnées servant au profilage de l’utilisateur sauf si cette collecte est essentielle aux besoins et cibles utilisatrices du service (point 1.3.) et si l’utilisateur a donné son Autorité de régulation des communications électroniques, des postes et de la distribution de la presse 35/128 consentement explicite et éclairé et peut désactiver cette collecte à tout moment. Le cas échéant, ces éléments devront être documents dans la déclaration d’écoconception du service numérique.\nSource sur la collecte de données personnelles :\n- [CNIL, Minimiser les données collectées (2023)](https://www.cnil.fr/fr/minimiser-les-donnees-collectees).\n- [CNIL, Registre des activités de traitement](https://www.cnil.fr/fr/RGDP-le-registre-des-activites-de-traitement).",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "1.13",
      "critere": "Le service numérique publie-t-il son code source sous licence open source",
      "thematique": "Stratégie",
      "objectif": "",
      "miseEnOeuvre": "Publier le code source du service numérique en licence libre pour les éléments qui ne sont pas couverts par des obligations de confidentialité et dans la limite des droits de propriété intellectuelle applicables.",
      "controle": "",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "1.14",
      "critere": "Le service numérique repose-t-il sur des API documentées et ouvertes pour interagir avec le matériel pour interagir avec le matériel ?",
      "thematique": "Stratégie",
      "objectif": "",
      "miseEnOeuvre": "Si le logiciel / pilote est associé à un équipement, terminal ou périphérique, le concepteur doit fournir des API (interfaces d'accès pour les programmes) ouvertes et documentées, afin de permettre que d’autres services numériques alternatifs puissent être utilisés sur l’appareil en cas de défaut ou abandon du logiciel, afin de prolonger la vie de l'objet ou périphérique.",
      "controle": "Si le service numérique repose sur l’utilisation d’un terminal, équipement, appareil, le fournisseur doit rendre disponibles les API nécessaires à l’exploitation de l’objet connecté. Les API du périphérique doivent être documentées et d’usage libre, afin qu’un programme ou pilote alternatif puisse être créé pour prolonger la durée de vie de l’objet ou périphérique.",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "1.15",
      "critere": "Le service a-t-il recours à un niveau de chiffrement adapté à ses besoins ?",
      "thematique": "Stratégie",
      "objectif": "Dans la plupart des situations, le recours à des mécanismes cryptographiques est absolument essentiel pour protéger les systèmes informatiques, ainsi que les données – notamment personnelles – collectées ou traitées. Ces mécanismes ont une empreinte environnementale à considérer. Par exemple, le chiffrement augmente automatiquement la consommation énergétique, d’abord par le calcul nécessaire à cette opération et au déchiffrement, mais aussi par le stockage et la charge pour les réseaux de communications. Néanmoins, ils peuvent dans certains cas permettre d’alléger les systèmes informatiques (par la compression des archives en parallèle du chiffrement, ou en évitant de conserver ou faire circuler certains fichiers). Cette pratique vise donc à promouvoir la minimisation du coût environnemental du chiffrement, en tenant compte des contraintes de sécurité à respecter. Le chiffrement contribue par ailleurs à la protection et à la sécurité des données, et réduit le risque de failles, et de fuites de données, dont les traitements ultérieurs ont une empreinte énergétique",
      "miseEnOeuvre": "",
      "controle": "Si le service repose sur des mécanismes de chiffrement, documenter dans la déclaration d’écoconception du service la pertinence du choix de mise en œuvre des mécanismes cryptographiques en fonction des risques de sécurité informatique du service et de la minimisation de l’empreinte environnementale associée.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "2.1",
      "critere": "Le service numérique a-t-il été conçu avec une revue de conception et une revue de code en ayant pour un des objectifs de réduire les impacts environnementaux de chaque fonctionnalité ?",
      "thematique": "Spécifications",
      "objectif": "Afin d'aboutir à une solution la plus sobre possible tout en répondant au besoin, il faut miser sur l'intelligence collective de toute l'équipe. Et pour cela, il ne suffit pas seulement de valider la conception par la revue de code, une bonne pratique maintenant assez répandue. Il est nécessaire, et cela sera positif pour l'équipe et pour le projet, de réfléchir en amont du développement, aux choix de conception et d'architecture, en ayant pour un des objectifs la minimisation des impacts environnementaux.",
      "miseEnOeuvre": "En impliquant l'ensemble de l'équipe, l'ensemble des métiers, une revue conception en amont du développement est réalisée pour choisir la solution répondant au besoin tout en minimisant les impacts environnementaux. Puis, si du code a été produit pour implémenter la solution, une revue de code est faites en aval du développement.",
      "controle": "Quel est le processus de développement mis en place ?",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "2.2",
      "critere": "Le service numérique a-t-il prévu une stratégie de décommissionnement pour ses fonctionnalités, ses composants ou ses environnements non utilisés ?",
      "thematique": "Spécifications",
      "objectif": "L'objectif est de décommisionner les environnements techniques encore actifs mais qui ne sont plus utilisés : Production, QA (Quality assurance), Test, environnement de développement, etc. Ces environnements occupent de la ressource informatique inutilement.",
      "miseEnOeuvre": "Définir une stratégie de décomissionnement des environnements et des dates de rappel.",
      "controle": "Lister les environnements actifs et leur état d'utilisation.",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "2.3",
      "critere": "Le service numérique impose-t-il à ses fournisseurs de garantir une démarche de réduction de leurs impacts environnementaux ?",
      "thematique": "Spécifications",
      "objectif": "Un projet est rarement réalisé avec un périmètre couvert totalement au sein de l'organisation. De nombreuses ressources externes sont mobilisées au cours du projet et se doivent d'être alignées avec la démarche.",
      "miseEnOeuvre": "Identifier les ressources nécessaires et leur associer des exigences environnementales. Le périmètre de la démarche porte sur la conception du service numérique (non sur le fournisseur lui-même). Se référer au [Guide pratique pour des achats numériques responsables](https://ecoresponsable.numerique.gouv.fr/publications/guide-pratique-achats-numeriques-responsables/).",
      "controle": "Quelles sont les spécifications intégrant des clauses environnementales qui ont été imposées aux fournisseurs pour la conception du service numérique ?",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "2.4",
      "critere": "Le service numérique a-t-il pris en compte les impacts environnementaux des composants d'interface prêts à l'emploi utilisés ?",
      "thematique": "Spécifications",
      "objectif": "Connaitre les impacts environnementaux des composants d'interface (bouton, formulaires...), des systèmes de design qui sont des surcouches aux interfaces du système d'exploitation, utilisés dans le service numérique.",
      "miseEnOeuvre": "Mesurer par exemple le poids de ces composants d'interface pour mieux faire un choix.",
      "controle": "Ces composants d'interface sont-ils conçus afin de réduire leurs impacts environnementaux ?\nDes mesures comparatives entre composants similaires existent-elles ?",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "2.5",
      "critere": "Le service numérique a-t-il pris en compte les impacts environnementaux des services tiers utilisés lors de leur sélection ?",
      "thematique": "Spécifications",
      "objectif": "Réduire les impacts environnementaux des services tiers, donc non issus de développement interne.",
      "miseEnOeuvre": "Les services de tiers sont des services proposés par des fournisseurs externes (développeurs, organismes ou entreprises) apportant des fonctionnalités prêtes à l'emploi (par exemple suivi d'audience, lecteur vidéo, fil d'actualités des réseaux sociaux, mécanisme de captcha...) et évitant ainsi de les re-développer en interne.\nUne mesure d'outils analytics A/B test permet de connaitre les impacts environnementaux de celui-ci afin d'aider à la prise de décision sur le facteur environnemental.",
      "controle": "Mesures fournies par le service tiers.\nJustificatifs ou comparatifs validant le choix effectué.",
      "difficulte": "Fort",
      "priorite": "Prioritaire"
    },{
      "id": "2.6",
      "critere": "Le service numérique évite-t-il lorsque cela est possible d’avoir recours à des briques technologiques énergivores et consommatrices en ressources ?",
      "thematique": "Spécifications",
      "objectif": "",
      "miseEnOeuvre": "",
      "controle": "",
      "difficulte": "Fort",
      "priorite": "Recommandé"
    },{
      "id": "3.1",
      "critere": "Le service numérique repose-t-il sur une architecture, des ressources ou des composants conçus pour réduire leurs propres impacts environnementaux ?",
      "thematique": "Architecture",
      "objectif": "Le service numérique peut dépendre de composants qui ne sont pas développés par la même équipe ou qui sont fournis par des frameworks de production. Il s'agit alors de s'assurer que ces dépendances soient également conçues de manière à réduire leurs propres impacts environnementaux.",
      "miseEnOeuvre": "Évaluer la façon dont ont été conçus les composants existants. Sont-ils eux-mêmes soumis à ce référentiel ?\nVoir aussi les critères 2.4 et 2.5 pour la prise en compte des impacts des composants d'interface et des services tiers.",
      "controle": "Vérification de la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "3.2",
      "critere": "Le service numérique fonctionne-t-il sur une architecture pouvant adapter la quantité de ressources utilisées en fonction de la consommation du service ?",
      "thematique": "Architecture",
      "objectif": "L'objectif est d'éviter une architecture surdimensionnée et de privilégier une architecture capable de passer à l'échelle.",
      "miseEnOeuvre": "Évaluer finement le besoin, le nombre d'utilisateurs pour adapter les ressources informatiques nécessaires.",
      "controle": "Obtenir par exemple un comparatif entre les ressources allouées et celles consommées sur une période de temps.",
      "difficulte": "Fort",
      "priorite": "Recommandé"
    },{
      "id": "3.3",
      "critere": "Le service numérique a-t-il pris en compte l'évolution technique des protocoles ?",
      "thematique": "Architecture",
      "objectif": "Limiter l’obsolescence du service induite par l'obsolescence du protocole utilisé, par exemple :\n* face à la pénurie d'IPv4 et la généralisation d'IPv6 (à moyen terme, certains accès internet ne proposeront plus de connectivité IPv4) en garantissant son interopérabilité et sa pérennité,\n* les navigateurs tendent vers le blocage du protocole HTTP et l'obligation d'utiliser HTTPS.",
      "miseEnOeuvre": "Par exemple :\n* Définir une stratégie de test IPv6 qui inclut des tests depuis un équipement où la connectivité IPv4 est désactivée. Objectif : déceler du code ou des fonctions qui ne fonctionnent qu'en IPv4 only, qui seront inutilisables à moyen terme, avec le retrait d'IPv4,\n* Dans un contexte où l'utilisateur accède au service numérique par son navigateur, il est obligatoire d'utiliser HTTPS au lieu de HTTP.",
      "controle": "Vérifier que les différents composants du service numérique fonctionnent bien :\n* en IPv6 et ne font appel à aucun service IPv4 only,\n* en HTTPS et non en HTTP.\n\nIl sera sans doute complexe de vérifier ces cas depuis un audit externe. Demander à l'équipe si certains composants utilisent des IP ou des urls en http \"en dur\".",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "3.4",
      "critere": "Le service numérique utilise-t-il un protocole d'échange adapté aux contenus transférés ?",
      "thematique": "Architecture",
      "objectif": "Limiter ou réduire le transfert de données en choisissant un protocole adapté aux données à échanger, en répondant le plus sobrement possible aux usages actuels et à venir.",
      "miseEnOeuvre": "Il s'agit de s'assurer de l'adéquation entre le choix du protocole et le type des contenus échangés, d'analyser les protocoles existants en fonction des contenus et des fonctionnalités en tenant compte de leur empreinte environnementale.\nIl existe de nombreux protocoles, chacun ayant ses avantages et ses inconvénients. Par exemple,\n* pour le streaming vidéo : HTTP Live Streaming (HLS), Real-Time Messaging Protocol (RTMP), Web Real-Time Communications (WebRTC)...\n* pour les API : REST, SOAP, GraphQL, Protocol Buffers...",
      "controle": "Évaluer l'adéquation du protocole utilisé par rapport au contenu transféré.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "3.5",
      "critere": "Le service numérique garantit-il la mise à disposition de mises à jour correctives pendant toute la durée de vie prévue des équipements et des logiciels liés au service ?",
      "thematique": "Architecture",
      "objectif": "Limiter la contribution à l'obsolescence des équipements liés au service.",
      "miseEnOeuvre": "Maintenir le service numérique pendant toute la durée prévue de l'équipement.\nSont visés ici des équipements spécifiques et les objets connectés (IOT).",
      "controle": "Vérifier que la durée de maintenance est indiquée et que les mises à jours sont effectivement disponibles.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "3.6",
      "critere": "Le service numérique propose-t-il d'installer des mises à jour correctives indépendamment des mises à jour évolutives ?",
      "thematique": "Architecture",
      "objectif": "Limiter la contribution à l'obsolescence des équipements utilisateurs.\nPromouvoir les politiques de support à long terme (\"Long term support\").",
      "miseEnOeuvre": "Ce critère est applicable surtout pour un service numérique de type api / composants / bibliothèque / framework / outils open source et beaucoup plus rarement un produit destiné à des utilisateurs finaux.\nPar exemple, une stratégie de gestion de versions avec des versions \"Long term support\" est mise en place et un changelog (journal des modifications) indique-t-il correctement les changements effectués par les mises à jour ?",
      "controle": "Vérification de la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "3.7",
      "critere": "Le service numérique propose-t-il les mises à jour incrémentielles, afin de ne pas remplacer tout le code à chaque mise à jour ?",
      "thematique": "Architecture",
      "objectif": "",
      "miseEnOeuvre": "",
      "controle": "",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "3.8",
      "critere": "Le service numérique désactive-t-il les environnements de développement sur les plages horaires où il est inutilisé ?",
      "thematique": "Architecture",
      "objectif": "",
      "miseEnOeuvre": "",
      "controle": "",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "4.1",
      "critere": "Le service numérique est-il utilisable via une connexion bas débit ?",
      "thematique": "UX/UI",
      "objectif": "Si le service numérique s'adresse à un large public, vous ne maitrisez donc pas le niveau de connectivité. Il est nécessaire de veiller à ne pas exclure certains publics qui n'ont pas accès à de hauts débits.\nTout en permettant de réduire la fracture numérique, il s'agit aussi d'une bonne pratique pour l'environnement. En effet, les utilisateurs n'ont pas toujours conscience de ce qui ralentit un service numérique : la connexion réseau, le service numérique ou le terminal utilisé ?\nUn service numérique plus léger a, par conséquent, beaucoup moins besoin de ressources réseaux pour fonctionner.",
      "miseEnOeuvre": "Tester l'utilisabilité du service avec des connexions bas débit, mesurer et améliorer le temps de réponse. Les contenus peuvent être servis en qualité dégradées lorsque cela s'avère nécessaire.",
      "controle": "Tester l'utilisabilité du service avec des connexions bas débit (3G en mobilité et 512 Kbs en fixe).",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "4.2",
      "critere": "Le service numérique comporte-t-il uniquement des éléments animations, vidéos et sons dont la lecture automatique est désactivée ?",
      "thematique": "UX/UI",
      "objectif": "Éviter de précharger des contenus et de les lancer sans consentement de l'utilisateur.",
      "miseEnOeuvre": "Par exemple, éviter de précharger et de lire automatiquement vidéos, sons, animations, carrousel, etc.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "4.3",
      "critere": "Le service numérique affiche-t-il uniquement des contenus sans défilement de page infini ?",
      "thematique": "UX/UI",
      "objectif": "Éviter le mur de contenus, la liste infinie, l'enchaînement infini de contenus.",
      "miseEnOeuvre": "Mettre en place une pagination claire dont le chargement du contenu est à la demande de l'utilisateur et non au défilement du contenu.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "4.4",
      "critere": "Le service numérique optimise-t-il le parcours de navigation pour chaque fonctionnalité principale ?",
      "thematique": "UX/UI",
      "objectif": "Minimiser le temps passé par l'utilisateur sur le service numérique.",
      "miseEnOeuvre": "Durant la phase de conception, éliminer les fonctionnalités non essentielles et optimiser le ou les parcours de navigation pour chaque unité fonctionnelle principale du service numérique. Puis, observer les statistiques de fréquentation et d'usage, couplé aux moyens d'observation UX (expérience utilisateur), afin d'améliorer cette optimisation de parcours.\nPar exemple, une unité fonctionnelle principale du service peut être \"réserver un billet\", \"rechercher un terme\", \"trouver une adresse\", \"contacter le support\", \"discuter\", etc.\nIl s'agit d'abord d'une analyse qualitative à mettre en place et pouvant être complétée par une analyse quantitative :\n* Bien définir les unités fonctionnelles principales du service (au sens de l'Analyse de Cycle de Vie).\n* Exploiter toutes les ressources et les outils disponibles en UX afin de comprendre au mieux les usages des utilisateurs, notamment en ce qui concerne leurs parcours de navigation de chaque unité fonctionnelle principale.\n* Mettre en place un système d'analyse non intrusif et respectueux de la vie privée afin d'identifier les parcours-type sur le service numérique. Analyser de temps en temps ces statistiques pour pouvoir améliorer l'expérience utilisateur et les impacts environnementaux de ces \"chemins-critiques\".\n* Mesurer également les indicateurs techniques des parcours identifiés : nombre de requêtes, poids des ressources téléchargées et les traduire en indicateurs d'impacts environnementaux.",
      "controle": "* Outils UX de conception, d'optimisation et de contrôle continu : tri de carte, sondage, interviews, enquêtes utilisateurs, tests-U, etc.\n* Contrôle de la mise en place des statistiques d'usage.\n* Analyse de cycle de vie.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "4.5",
      "critere": "Le service numérique permet-il à l'utilisateur de décider de l'activation d'un service tiers ?",
      "thematique": "UX/UI",
      "objectif": "Limiter le chargement de services tiers non nécessaires au bon fonctionnement du service. Par exemple, sans activation des cookies, certains lecteurs vidéo sont désactivés et en attente de consentement pour pouvoir visionner la vidéo.",
      "miseEnOeuvre": "Charger des contenus non indispensables qu'à la demande explicite de l'utilisateur. Ce critère rejoint une des obligations du RGPD sur la demande de consentement avant de charger du contenu tiers.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "4.6",
      "critere": "Le service numérique utilise-t-il majoritairement des composants fonctionnels natifs du système d'exploitation, du navigateur ou du langage utilisé ?",
      "thematique": "UX/UI",
      "objectif": "Les composants fonctionnels sont par exemple des composants d'interface (menu, bouton, formulaire...). Généralement, les composants natifs d'un système n'ont besoin que de peu de ressources pour fonctionner, contrairement à des composants développés en surcouche.",
      "miseEnOeuvre": "Privilégier l'utilisation des composants fonctionnels natifs du système d'exploitation, du navigateur ou du langage utilisé pour répondre au besoin.",
      "controle": "Si c'est le cas, évaluer la nécessité d'avoir choisi d'utiliser des composants non natifs (contrainte technique par exemple ?).",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "4.7",
      "critere": "Le service numérique utilise-t-il uniquement du contenu vidéo, audio et animé porteur d'informations ?",
      "thematique": "UX/UI",
      "objectif": "Supprimer le poids des ressources médias téléchargées et utilisées pour l'esthétisme du service.",
      "miseEnOeuvre": "Vérifier la pertinence sur l'usage de vidéos, animations et audios : ces médias sont-ils porteurs ou non d'une information (VS ces médias ne sont utilisés qu'à des fins décoratifs).\nS'interroger sur la pertinence d'utiliser des contenus vidéo, d'animation et audio décoratifs.\nLes micro-animations d'interface non décoratifs et apportant une information à l'utilisateur (UX) sont autorisées.",
      "controle": "Évaluer la pertinence du choix d'afficher une animation ou une vidéo décorative, ou encore un contenu audio décoratif.",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.8",
      "critere": "Le service numérique utilise-t-il du texte ou de l'image au lieu de contenu vidéo, audio ou animé lorsque cela est possible ?",
      "thematique": "UX/UI",
      "objectif": "Réduire le poids des ressources utilisées, sachant qu'une vidéo pèse généralement beaucoup plus lourd qu'un texte contenant des images.",
      "miseEnOeuvre": "Questionner le besoin d'afficher un média (vidéo, animation ou enregistrement audio), très en amont et choisir la solution la plus sobre possible tout en répondant au besoin utilisateur.",
      "controle": "Évaluer la pertinence du choix d'affichage d'une vidéo, d'une animation ou d'un enregistrement audio.",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.9",
      "critere": "Le service numérique permet-il de mettre en pause les animations, défilement ou clignotement ?",
      "thematique": "UX/UI",
      "objectif": "Donner le contrôle à l'utilisateur pour limiter l'usage de ressources non nécessaires.",
      "miseEnOeuvre": "Proposer systématiquement une possibilité à l'utilisateur de mettre en pause les animations.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.10",
      "critere": "Le service numérique utilise-t-il majoritairement des polices de caractères du système d'exploitation ?",
      "thematique": "UX/UI",
      "objectif": "Réduire la quantité et le poids des polices personnalisées utilisées. Privilégier l'utilisation des polices systèmes lorsque la personnalisation n'est pas nécessaire.",
      "miseEnOeuvre": "Par exemple, se fixer comme objectif de n'utiliser qu'au maximum, deux polices différentes et au maximum quatre variantes au total. Vérifier par exemple la compression des polices ou l'usage des glyphes nécessaires.\nDans un contexte de site web, faire attention aussi sur le mode de chargement : bloquant, non bloquant...",
      "controle": "Évaluer le nombre et poids des polices de caractères utilisées.",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.11",
      "critere": "Le service numérique limite-t-il les requêtes serveur lors de la saisie utilisateur ?",
      "thematique": "UX/UI",
      "objectif": "Éviter de réaliser des requêtes clients / serveurs inutiles. Par exemple dans un contexte de formulaire, de suggestion de résultats, etc.",
      "miseEnOeuvre": "Pour une aide à la saisie (\"autocompletion\"), attendre par exemple d'avoir 3 caractères et 200 ms après saisie avant de lancer une requête réseau.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.12",
      "critere": "Le service numérique informe-t-il l'utilisateur du format de saisie attendu avant sa validation ?",
      "thematique": "UX/UI",
      "objectif": "Limiter les échanges clients / serveurs en vérifiant la saisie du côté du terminal utilisateur.",
      "miseEnOeuvre": "Vérifier les formats attendus lors de la saisie de l'utilisateur avant soumission du formulaire et indiquer les erreurs de saisie.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.13",
      "critere": "Le service numérique vérifie-t-il les saisies et les formats de données obligatoires à la soumission d'un formulaire sans requête serveur lorsque c'est possible ?",
      "thematique": "UX/UI",
      "objectif": "L'objectif est d'éviter les requêtes serveur inutiles. Dans certains cas il n'est pas possible de vérifier côté client en fin de formulaire, la vérification sera alors du côté serveur.",
      "miseEnOeuvre": "Valider les saisies et les formats de données obligatoires à la soumission d'un formulaire sans requête serveur lorsque cela est possible. Attention : pré-valider les données côté frontend n'exempt pas la validation côté backend.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.14",
      "critere": "Le service numérique informe-t-il l'utilisateur, avant le transfert, des poids et formats de fichier attendus ?",
      "thematique": "UX/UI",
      "objectif": "Limiter les échanges clients / serveurs de fichiers volumineux en informant l'utilisateur des prérequis attendus.",
      "miseEnOeuvre": "Indiquer à l'utilisateur, avant le transfert, des poids et des formats de fichier attendus : un type de fichier, une taille max. d'image, etc.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.15",
      "critere": "Le service numérique vérifie-t-il des limites de poids et de formats sur les fichiers pouvant être transmis par l'utilisateur ?",
      "thematique": "UX/UI",
      "objectif": "Limiter les échanges clients / serveurs de fichiers volumineux en imposant des limites à l'utilisateur.",
      "miseEnOeuvre": "La soumission du formulaire n'est pas possible si les prérequis indiqués de poids et de formats de fichiers ne sont pas respectés.\nAttention cependant, non applicable dans certains contextes où le fichier demandé peut être potentiellement assez conséquent, par exemple pour une démarche en ligne.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "4.16",
      "critere": "Le service numérique indique-t-il à l'utilisateur que l'utilisation d'une fonctionnalité a des impacts environnementaux importants ?",
      "thematique": "UX/UI",
      "objectif": "Matérialiser pour l'utilisateur les impacts environnementaux des actions les plus coûteuses.\nInformer les utilisateurs en amont des impacts environnementaux avant l'utilisation d'une fonctionnalité, lorsque cette dernière est plus coûteuse par rapport au reste du service.",
      "miseEnOeuvre": "Par exemple, pour chaque fichier téléchargeable, vidéo ou média consulté, ou pour un traitement long, comme un export de données, une information relative au poids du fichier ou le temps requis pour l'opération est préalablement affichée à l'utilisateur.\nIl n'est pas nécessaire de fournir des équivalences en impacts environnementaux. Si ces dernières sont disponibles, il faut préciser la source et la méthodologie. Toutefois, il faut veiller à ce que ces informations soient en multicritères, pas uniquement en équivalent CO2.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "4.17",
      "critere": "Le service numérique propose-t-il des notifications uniquement lorsque c'est nécessaire ?",
      "thematique": "UX/UI",
      "objectif": "Réduire l'usage de ressources informatiques en évitant d'attirer inutilement l'attention de l'utilisateur ou en consommant inutilement des ressources informatiques.",
      "miseEnOeuvre": "Les notifications envisagées par le service numérique sont dans l'intérêt de l'utilisateur en terme de besoin. Les notifications évitent également la multiplications sur différents canaux redondants (SMS, mails, notification d'application, notification d'interface, pop-in, etc.).",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "4.18",
      "critere": "Le service numérique permet-il à l'utilisateur de contrôler les notifications qu'il reçoit ?",
      "thematique": "UX/UI",
      "objectif": "Réduire l'usage de ressources informatiques en évitant d'attirer inutilement l'attention de l'utilisateur.",
      "miseEnOeuvre": "L'utilisateur peut désactiver les notifications ou choisir la fréquence de réception de ces notifications.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "4.19",
      "critere": "Le service numérique fournit-il à l'utilisateur un moyen de contrôle sur ses contenus et ses services afin de réduire les impacts environnementaux ?",
      "thematique": "UX/UI",
      "objectif": "Donner de l'autonomie à l'utilisateur pour limiter les impacts environnementaux de ses usages.",
      "miseEnOeuvre": "Exemples : des fonctions proposant de choisir la définition de l'image à télécharger, des possibilités de choix en résolutions des médias (vidéos, sons, images, documents), de désactiver l'affichage des médias, etc.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Prioritaire"
    },{
      "id": "5.1",
      "critere": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte de visualisation de chaque image ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Choisir le format image adapté à la typologie d'image et au contexte d'affichage : utiliser le format vectoriel comme le svg lorsque cela est possible (illustrations, icones, logos, graphes...), le format jpg pour des photos et le format png pour des illustrations avec aplats de couleurs.",
      "controle": "Évaluer la pertinence du format de l'image affichée.",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "5.2",
      "critere": "Le service numérique propose-t-il des images dont le niveau de compression est adapté au contenu et au contexte de visualisation ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Ex. Lors de la génération d'une image JPEG depuis un logiciel de retouche, la compression à 60 % peut être visuellement acceptable. En PNG la réduction de la palette des couleurs est conseillée.\n\nAplatir les calques pour générer un format vectoriel SVG. Minifier et optimiser encore plus la compression en utilisant des outils dédiés.",
      "controle": "Évaluer la qualité et le poids de l'image affichée.",
      "difficulte": "",
      "priorite": "Recommandé"
    },{
      "id": "5.3",
      "critere": "Le service numérique utilise-t-il, pour chaque vidéo, une définition adaptée au contenu et au contexte de visualisation ?",
      "thematique": "Contenus",
      "objectif": "Il arrive parfois que le contenu vidéo soit en haute définition alors que le contexte de visualisation n'en a pas besoin. L'objectif est de réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Par exemple, éviter les vidéos avec une définition de 1080p ou plus affichées sur le site web quand le terminal cible ou détecté est un smartphone. S'il n'est pas possible de mettre en place cette adaptation selon le terminal cible, utiliser un contenu vidéo avec la plus faible définition possible sans que cela n'altère sa compréhension.",
      "controle": "Tester la lecture des vidéos sur différents terminaux et vérifier que ces vidéos ont un format adapté.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "5.4",
      "critere": "Le service numérique propose-t-il des vidéos dont le niveau de compression est adapté au contenu et au contexte de visualisation ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Par exemple, optimisation du Bitrate (débit) au sein du format.",
      "controle": "Évaluer la qualité et le poids de la vidéo proposée.",
      "difficulte": "Fort",
      "priorite": "Prioritaire"
    },{
      "id": "5.5",
      "critere": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte d'écoute de chaque contenu audio ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Utiliser par exemple le MP3, OGG ou AAC au lieu du FLAC, AIFF ou WAV.",
      "controle": "Évaluer la pertinence du format de fichier audio par rapport au contenu proposé : musique, parlé, etc.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "5.6",
      "critere": "Le service numérique propose-t-il des contenus audio dont le niveau de compression est adapté au contenu et au contexte d'écoute ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Exemples :\n- optimisation du Bitrate (débit), du Ratio (Taux de compression) et de la Fréquence au sein du format,\n- choix adapté Stéréo pour de la musique ou Mono pour des dialogues,\n- éviter le ratio poids en mega-octet/durée en minute supérieur à 1.",
      "controle": "Évaluer la pertinence du poids de fichier audio par rapport au contenu proposé.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "5.7",
      "critere": "Le service numérique utilise-t-il un format de fichier adapté au contenu et au contexte d'utilisation pour chaque document ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Ex : réserver un PDF optimisé web (donc comportant des visuels en 72 dpi) pour une visualisation en ligne et un PDF optimisé impression HD (donc comportant des visuels en 150 ou 300 dpi) pour une utilisation destinée à l'impression HD.",
      "controle": "Évaluer la pertinence du format du document proposé.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "5.8",
      "critere": "Le service numérique propose-t-il des documents dont le niveau de compression est adapté au contenu et au contexte d'utilisation ?",
      "thematique": "Contenus",
      "objectif": "Réduire le poids des fichiers téléchargés par les utilisateurs.",
      "miseEnOeuvre": "Exemple : optimiser les paramètres de compression pour générer un PDF en résolution 72 dpi pour tous les médias du document.",
      "controle": "Évaluer le poids du document par rapport à son contenu.",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "5.9",
      "critere": "Le service numérique a-t-il une stratégie d'archivage et de suppression, automatiques ou manuelles, des contenus obsolètes ou périmés ?",
      "thematique": "Contenus",
      "objectif": "Alléger les bases de données et les serveurs physiques de données non utiles.",
      "miseEnOeuvre": "Définir une stratégie d'archivage et de suppression des contenus obsolètes, périmés, dépassés ou inutiles à conserver dans le service numérique. Cette stratégie peut être automatique en définissant une date d’expiration et un processus d'archivage et/ou de purge automatique.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "6.1",
      "critere": "Le service numérique s'astreint-il à un poids maximum par écran ?",
      "thematique": "Frontend",
      "objectif": "Réduire ou limiter les données téléchargées",
      "miseEnOeuvre": "Par écran, il est entendu ici \"écran virtuel\" et non physique. Si le service numérique est un site web, l'écran désigne la page, pour une API, l'écran désigné la réponse du serveur.\nDéfinir et suivre un indicateur poids maximum par écran, en tenant compte de toutes les ressources téléchargées (composants d'interface, données, contenus, scripts, feuilles de style...). Par exemple pour une page web (avec toutes les ressources chargées) qui pèse 2 Mo, l'objectif serait de descendre à 500 Ko. Selon le contexte, cet objectif peut être beaucoup plus bas.",
      "controle": "Quel est le poids maximum par écran défini ?",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.2",
      "critere": "Le service numérique s'astreint-il à une limite de requêtes par écran ?",
      "thematique": "Frontend",
      "objectif": "Réduire ou limiter les échanges client - serveur.",
      "miseEnOeuvre": "Par écran, il est entendu ici \"écran virtuel\" et non physique. Si le service numérique est un site web, l'écran désigne la page, pour une API, l'écran désigné la réponse du serveur.\nDéfinir et suivre un indicateur nombre de requêtes client/serveur maximum par écran, en tenant compte de toutes les ressources téléchargées (composants d'interface, données, contenus, scripts, feuilles de style...). Par xemple, pour une site web, il serait intéressant d'avoir moins de 30 requêtes par page au lieu de 100.\nAttention, le nombre de requêtes seul ne peut être garant de la sobriété du service numérique, puisqu'une seule suffit à charger plusieurs dizaines de mégaoctets. Il faut bien veiller à valider tous les critères de ce référentiel, notamment le critère 6.1 sur la limitation du poids maximum par écran.",
      "controle": "Quel est le nombre de requêtes maximum par écran défini ?",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.3",
      "critere": "Le service numérique utilise-t-il des mécanismes de mises en cache pour la totalité des contenus transférés dont il a le contrôle ?",
      "thematique": "Frontend",
      "objectif": "Réduire le poids des données échangées.",
      "miseEnOeuvre": "La stratégie de cache doit être adaptée au contexte d'application et au scénario d'usage. La gestion du mode déconnecté (offline) est parfois très pertinent, parfois non. Mettre en place un mécanisme de cache côté utilisateur, en frontend (cache HTTP par exemple).",
      "controle": "Vérifier la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "6.4",
      "critere": "Le service numérique utilise-t-il un stockage côté client de certaines ressources afin d’éviter des échanges réseaux inutiles ?",
      "thematique": "Frontend",
      "objectif": "",
      "miseEnOeuvre": "",
      "controle": "",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.5",
      "critere": "Le service numérique a-t-il mis en place des techniques de compression sur la totalité des ressources transférées dont il a le contrôle ?",
      "thematique": "Frontend",
      "objectif": "Réduire ou limiter les données téléchargées.",
      "miseEnOeuvre": "Compression, minification des fichiers de scripts par exemple. Attention toutefois à ne pas générer de la consommation de ressource si il y a besoin de puissance de calcul pour \"décompresser\" les fichiers : la compression systématique de type .tgz par exemple pour des petits fichiers peut être contre-productif.\nCe critère s'applique uniquement aux fichiers texte (HTML, CSS, javascript par exemple). Ne pas confondre avec le critère 5.2 sur la compression des images.",
      "controle": "Vérifier que les fichiers téléchargés sont compressés.",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "6.6",
      "critere": "Le service numérique affiche-t-il majoritairement des éléments graphiques et des médias dont les dimensions d'origine correspondent aux dimensions du contexte d'affichage ?",
      "thematique": "Frontend",
      "objectif": "Réduire ou limiter les données téléchargées.",
      "miseEnOeuvre": "Par exemple, lors de l'ajout des médias ou des éléments graphiques au service numérique, les dimensions d'affichages sont requises. Autre possibilité, valable surtout pour les images, un redimensionnement est réalisé coté serveur lors de l'ajout du fichier par un contributeur.\nException à cette règle : le cas des images pour écran Retina (l'image affichée dont la taille d'origine est généralement supérieure à son contexte d'affichage car la densité de pixels - device pixel ratio - est supérieure pour les images Retina).",
      "controle": "Contrôler que les images exploitées ou les médias utilisés sont affichés dans leur taille d'origine.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.7",
      "critere": "Le service numérique propose-t-il un mécanisme de chargement progressif pour les éléments graphiques et les médias le nécessitant ?",
      "thematique": "Frontend",
      "objectif": "Réduire ou limiter les données téléchargées.",
      "miseEnOeuvre": "Exemples : streaming pour la vidéo, chargement uniquement des images ou ressources affichées à l'écran (\"lazy loading\")...",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.8",
      "critere": "Le service numérique évite-t-il de déclencher le chargement de ressources et de contenus inutilisés pour chaque fonctionnalité ?",
      "thematique": "Frontend",
      "objectif": "Il est souvent plus simple pour l'équipe de développement de charger tous les composants, packagés dans un fichier compressé quelque soit la fonctionnalité. Il en résulte que l'utilisateur charge des composants qui ne seront pas forcément utilisés.\nN'utiliser que ce dont il est effectivement nécessaire pour le fonctionnement du service permet d'économiser ainsi de la ressource informatique.",
      "miseEnOeuvre": "Ne charger les ressources et des composants que lorsqu'ils sont effectivement utilisés.\nVoir aussi critère 6.7 pour les composants d'interface.",
      "controle": "Vérifier le contenu des ressources chargées et leur utilisation effective.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.9",
      "critere": "Le service numérique restreint-il l'usage des capteurs des terminaux utilisateur au besoin du service plutôt qu'en permanence ?",
      "thematique": "Frontend",
      "objectif": "Réduire ou limiter les données échangées, dont des données personnelles (comme la webcam, le micro ou la géolocalisation, par exemple), avec le service numérique.",
      "miseEnOeuvre": "Validation de mécanismes d'alerte et de consentement avant tout déclenchement de capteur du terminal accepté par l'utilisateur.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "6.10",
      "critere": "Le service numérique héberge-t-il les ressources statiques transférées dont il est l'émetteur sur un même domaine ?",
      "thematique": "Frontend",
      "objectif": "Limiter le nombre de domaines différents et donc de serveurs sollicités.",
      "miseEnOeuvre": "Limiter le nombre de domaines différents pour les ressources utilisées afin notamment de profiter du multiplexing proposé par HTTP/2",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "7.1",
      "critere": "Le service numérique a-t-il recours à un système de cache serveur pour les données les plus utilisées ?",
      "thematique": "Backend",
      "objectif": "Limiter la consommation de ressources informatiques.",
      "miseEnOeuvre": "Identifier les données, entrées API, ressources les plus utilisées à mettre en cache afin d'éviter de les regénérer. Prévoir une durée d'expiration pour les rafraichir.",
      "controle": "Quels sont les caches serveur mis en place ?",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "7.2",
      "critere": "Le service numérique est-il configuré pour transmettre depuis le serveur des contenus compressés au client qui les accepte ?",
      "thematique": "Backend",
      "objectif": "Réduire la quantité de ressources transférées sur le réseau.",
      "miseEnOeuvre": "Mettre en place une compression de bout en bout (par exemple : https://developer.mozilla.org/fr/docs/Web/HTTP/Compression)",
      "controle": "Vérifier la mise en place d'une compression des données",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "7.3",
      "critere": "Le service numérique définit-il des durées de conservation sur les données et documents qui le nécessitent ?",
      "thematique": "Backend",
      "objectif": "Alléger les bases de données et les serveurs physiques de données non utiles.",
      "miseEnOeuvre": "Définir des dates d'expiration sur les données (fichiers, entrées en base de données...) permettant par la suite d'archiver et/ou de supprimer cette donnée. Cf critère : 7.4",
      "controle": "Demande déclarative à l'équipe de développement. Ceci peut être tracé dans un document sur la politique/stratégie de la gestion des données.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "7.4",
      "critere": "Le service numérique archive-t-il ou supprime-t-il les données et documents après expiration de leur durée de conservation ?",
      "thematique": "Backend",
      "objectif": "Alléger les bases de données et les serveurs physiques de données non utiles.",
      "miseEnOeuvre": "Mettre en place un processus (de préférence automatique) d'archivage ou de suppression des données (fichiers, entrées en base de données...) dont la durée de conservation est dépassée. Cf critère 7.3",
      "controle": "Suivi de l'évolution du poids des fichiers stockés et des bases de données",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "7.5",
      "critere": "Le service numérique informe-t-il l'utilisateur d'un traitement en cours en arrière-plan ?",
      "thematique": "Backend",
      "objectif": "Éviter les requêtes simultanées provoquées par l'utilisateur s'il ne sait pas que son action est en cours de prise en compte.",
      "miseEnOeuvre": "Rendre indisponible l'action qui génère le traitement (par exemple un bouton de soumission de formulaire) et informer l'utilisateur que le traitement est en cours, éventuellement une durée approximative de traitement.",
      "controle": "Contrôler la mise en œuvre",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "7.6",
      "critere": "Le service numérique s’appuie-t-il sur un mécanisme de consensus qui minimise sa consommation de ressources ?",
      "thematique": "Backend",
      "objectif": "",
      "miseEnOeuvre": "",
      "controle": "",
      "difficulte": "Moyen",
      "priorite": "Prioritaire"
    },{
      "id": "8.1",
      "critere": "Le service numérique utilise-t-il un hébergement signataire du Code de Conduite européen sur les Datacentres ?",
      "thematique": "Hébergement",
      "objectif": "Favoriser un hébergement qui a des engagements en faveur de l'environnement.",
      "miseEnOeuvre": "Sélectionner un hébergeur engagé dans cette démarche.\nOu demander des engagements à l'hébergeur en ce sens.\nProposé par la Commission Européenne, le Code de conduite européen est une initiative volontaire qui a été créée en réponse à l'augmentation de la consommation d'énergie dans les centres de données et à la nécessité de réduire les impacts environnementaux. L'objectif est d'informer et d'encourager les opérateurs et les propriétaires de centres de données à réduire la consommation d'énergie sans entraver la fonction critique des centres de données. Le Code de conduite vise à atteindre cet objectif en améliorant la compréhension de la demande d'énergie au sein du centre de données, en sensibilisant et en recommandant les meilleures pratiques et objectifs en matière d'efficacité énergétique.\nLes parties signataires doivent suivre ce code de conduite et respecter un ensemble d'engagements.\nEn savoir plus sur le [Code de conduite européen](https://e3p.jrc.ec.europa.eu/sites/default/files/documents/publications/jrc128184_jrc128184_jrc128184_2022_best_practice_guidelines-1.pdf) (pdf, 2022).",
      "controle": "Justificatif de l'hébergeur de sa ratification du Code de Conduite et des actions associées",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "8.2",
      "critere": "Le service numérique utilise-t-il un hébergement ayant une démarche de réduction de son impact écologique ?",
      "thematique": "Hébergement",
      "objectif": "Favoriser un hébergement qui a des engagements en faveur de l'environnement, autres que le Code de Conduite européen sur les datacentres.",
      "miseEnOeuvre": "Sélectionner un hébergeur ayant des engagements environnementaux ou demander des engagements à l'hébergeur en ce sens :\n- charte, politique\n- certification environnementale : ISO14001, ISO50001, LEED, BREAM, HQE...\n- mesure et communication des impacts\n- mutualisation des ressources machines\n- type de refroidissement utilisant des sources d'énergies renouvelables (eau, air...) ou récupération de la chaleur fatale\n- analyse d'impact environnemental du \"move to cloud\" pour les acteurs ayant leur cloud on premise ? calculettes proposées par les fournisseurs en amont de la migration ?\n- comment a été construit le datacenter ? artificialisation des sols\n- etc.\n\nAttention au greenwashing lorsqu'il s'agit de communications sur la neutralité carbone, une charte, une politique ou une feuille de route interne, sans possibilité de vérifier la mise en œuvre ou sans un tiers indépendant qui certifie la mise en œuvre.",
      "controle": "Justificatif des engagements environnementaux de l'hébergeur",
      "difficulte": "Moyen",
      "priorite": "Prioritaire"
    },{
      "id": "8.3",
      "critere": "Le service numérique utilise-t-il un hébergement qui fournit une politique de gestion durable des équipements ?",
      "thematique": "Hébergement",
      "objectif": "Favoriser un hébergement qui a des engagements en faveur de l'environnement notamment sur sa gestion des équipements : impacts environnementaux de l'achat de ces équipements, politique d'achat (achat durable, réparable), politique d'usage (upgrade, réparation par exemple) et politique de fin d'usage (réemploi et gestion des DEEE, les Déchets d’équipements électriques et électroniques).",
      "miseEnOeuvre": "Sélectionner un hébergeur ou demander des engagements à un hébergeur ayant une politique transparente et écologique de sa gestion des équipements.\nPar exemple, il serait intéressant que l'hébergeur indique une durée de vie totale de ses équipements > 8 ans.",
      "controle": "Politique d'achat et de gestion des équipements de l'hébergeur",
      "difficulte": "Fort",
      "priorite": "Prioritaire"
    },{
      "id": "8.4",
      "critere": "Le service numérique utilise-t-il un hébergement qui fournit des indicateurs d'impacts environnementaux liés à son activité ?",
      "thematique": "Hébergement",
      "objectif": "Favoriser un hébergement qui mesure et qui rend disponibles les impacts environnementaux liés à son usage.",
      "miseEnOeuvre": "Sélectionner un hébergeur ou demander des engagements à un hébergeur proposant des métriques environnementales, par exemple les indicateurs standard PUE, WUE, REF...",
      "controle": "Indicateurs environnementaux et / ou à défaut, mais non suffisant, de consommation énergétique indiqués par l'hébergeur.",
      "difficulte": "Moyen",
      "priorite": "Modéré"
    },{
      "id": "8.5",
      "critere": "Le service numérique utilise-t-il un hébergement dont le PUE (Power Usage Effectiveness) est minimisé ?",
      "thematique": "Hébergement",
      "objectif": "Connaitre le PUE de son hébergement.\nRéduire ou limiter la consommation d'énergie nécessaire au bon fonctionnement et au refroidissement des serveurs.",
      "miseEnOeuvre": "Sélectionner un hébergeur qui indique son PUE et la stratégie mise en oeuvre pour le réduire.\nLe PUE est un indicateur d'efficacité énergétique qui est un ratio entre l'énergie totale consommée par l'ensemble du centre d'exploitation (avec entre autres, le refroidissement, le traitement d'air, les onduleurs...) et la partie qui est effectivement consommée par les systèmes informatiques que ce centre exploite (serveurs, stockage, réseau).\nPlus ce PUE est proche de 1, mieux c'est.\nGénéralement, il est constaté un PUE à 1,1 pour les hyperscalers et de 2 pour les plus vieux centres de données. Un PUE > 2,5 est trop élevé.\nCependant, améliorer cet indicateur peut dégrader d'autres indicateurs, sans que cela réduise ni l’impact global, ni la consommation d’énergie, d'où l'intérêt de suivre plusieurs indicateurs (consommation d'énergie, consommation d'eau, politique de gestion du matériel, etc.).",
      "controle": "Quel est le PUE de l'hébergeur du service numérique ?",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "8.6",
      "critere": "Le service numérique utilise-t-il un hébergement dont son WUE (Water Usage Effectiveness) est minimisé ?",
      "thematique": "Hébergement",
      "objectif": "Connaitre le WUE de son hébergement, indicateur souvent peu pris en compte.\nRéduire ou limiter la consommation d'eau nécessaire au refroidissement des serveurs.\nÉviter le stress hydrique (c’est-à-dire de pénurie d’eau potable). On peut également prendre en compte notamment le stress hydrique local : un WUE élevé dans une zone sans stress hydrique sera moins problématique.",
      "miseEnOeuvre": "Sélectionner un hébergeur qui indique son WUE. Cet indicateur est un ratio entre la quantité d'eau consommée et l'énergie totale utilisé par le centre de données. Il est mesuré en L/kWh.\nNB : actuellement, il y a peu ou pas de données ouvertes sur le sujet du stress hydrique local.\nComme pour le PUE, améliorer cet indicateur peut dégrader d'autres indicateurs, sans que cela réduise ni l’impact global, ni la consommation d’énergie, d'où l'intérêt de suivre plusieurs indicateurs (consommation d'énergie, consommation d'eau, politique de gestion du matériel, etc.).",
      "controle": "Quel est le WUE de l'hébergeur du service numérique ?",
      "difficulte": "Moyen",
      "priorite": "Recommandé"
    },{
      "id": "8.7",
      "critere": "Le service numérique utilise-t-il un hébergement dont la consommation d'électricité est majoritairement d'origine renouvelable ?",
      "thematique": "Hébergement",
      "objectif": "Promouvoir la transition vers des énergies renouvelables.",
      "miseEnOeuvre": "Demander à l'hébergeur sa politique en terme d'achat d'électricité. Les PPA (Power Purchage Agreement), des contrats d’énergie renouvelable de long terme sont considérés de meilleure qualité que les certificats d'origine de l'électricité. [Voir à ce sujet, le rapport Development of the EU Green Public Procurement (GPP) criteria for data centres, server rooms and cloud services, Renewable Energy Factor, page 99](https://op.europa.eu/en/publication-detail/-/publication/89971797-a9fa-11ea-bb7a-01aa75ed71a1/language-en/format-PDF/source-search). Un indicateur normé peut être suivi : le [REF, le Renewable Energy Factor](https://www.iso.org/obp/ui/#iso:std:iso-iec:30134:-3:ed-1:v1:en).",
      "controle": "Demander des justificatifs sur la provenance de l'électricité consommée par l'hébergeur (PPA - Power Purchase Agreement en priorité, sinon Certificat d'origine de l'électricité).",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "8.8",
      "critere": "Le service numérique utilise-t-il un hébergement dont la localisation géographique est en cohérence avec celle de ses utilisateurs et de ses activités ?",
      "thematique": "Hébergement",
      "objectif": "Réduire la distance parcourue par les données et donc réduire l'infrastructure réseau mobilisée.",
      "miseEnOeuvre": "Sélectionner un hébergeur dont la localisation de ses serveurs est proche des utilisateurs ou des activités identifiées. Cela ne correspond pas à adopter les technologies Edge Computing mais de choisir un centre de données proches des utilisateurs.",
      "controle": "Contrôler la mise en œuvre : l'identification de la localisation des utilisateurs et la localisation des serveurs.",
      "difficulte": "Fort",
      "priorite": "Recommandé"
    },{
      "id": "8.9",
      "critere": "Le service numérique héberge-t-il de façon distincte les données « chaudes » et « froides » ?",
      "thematique": "Hébergement",
      "objectif": "Les données chaudes sont des données très utilisées alors que les données froides sont des données archivées. Utiliser des hébergements différents (bases de données différentes par exemple) permettrait de réduire les impacts environnementaux.",
      "miseEnOeuvre": "Séparer les données chaudes des données froides en utilisant des solutions techniques adaptées au contexte d'utilisation.\nIl convient d'avoir une réflexion sur le mode de stockage des données froides : il existe plusieurs technologies sur le marché, toutes n'ont pas nécessairement le même impact.",
      "controle": "Vérification de la mise en œuvre",
      "difficulte": "Fort",
      "priorite": "Modéré"
    },{
      "id": "8.10",
      "critere": "Le service numérique duplique-t-il les données uniquement lorsque cela est nécessaire ?",
      "thematique": "Hébergement",
      "objectif": "Réduire les ressources informatiques et les ressources de stockage utilisées.\nIl s'agit de se poser la question du bon niveau de service sélectionné par rapport au besoin. Plus le taux de disponibilité demandé est haut, plus cela mobilise une infrastructure coûteuse financièrement et environnementalement.",
      "miseEnOeuvre": "Ne pas systématiquement dupliquer toutes les données. Identifier les données nécessaires à être dupliquées (données critiques ou données très sollicitées par exemple). Un équilibre est à trouver entre sécurisation (pour éviter les pertes de données) et dissémination (en avoir trop partout).",
      "controle": "Document de référence, spécifications indiquant les choix de conception quant à la redondance des données, ajustés selon les besoins.",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "8.11",
      "critere": "Le service numérique utilise-t-il une redondance uniquement lorsque cela est nécessaire ?",
      "thematique": "Hébergement",
      "objectif": "Réduire les ressources informatiques et les ressources de stockage utilisées.\nIl s'agit de se poser la question du bon niveau de service sélectionné par rapport au besoin. Plus le taux de disponibilité demandé est haut, plus cela mobilise une infrastructure coûteuse financièrement et environnementalement.",
      "miseEnOeuvre": "Se questionner sur la pertinence de la redondance du service. Est-ce critique si le service numérique n'est pas disponible pendant un certain temps ?\n* Le Backup & Restore est ce qu’il y a de moins cher, parfaitement adapté aux applications qui ont un RTO (Recovery Time Objective) ou RPO (Recovery Point Objective) de quelques heures.\n* Le Pilot Light, c’est par exemple une base de données \"mirrorée\" / dupliquée mais avec des VMs éteintes, procédé un peu plus cher qu’un Backup & Restore cela fonctionne pour la plupart des applications qui n’ont pas des exigences SLA extrêmes (inférieures à 1 heure).\n* Le Warm Standby, c’est lorsque les VMs tournent déjà mais dans une scalabilité limitée, quasiment en temps réel mais potentiellement en qualité légèrement dégradée si incident.\n* Le Hot Standby Multi-Site : total résilience pour des SLAs temps réel. Aucune perte de service n’est tolérée, mais forcément cela a un coût.",
      "controle": "Vérification de la présence d'un SLA (Service Level Agreement) ajusté selon les besoins par exemple",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "8.12",
      "critere": "Le service numérique utilise-t-il un hébergement qui récupère la chaleur fatale produite par les serveurs ?",
      "thematique": "Hébergement",
      "objectif": "Encourager les initiatives permettant de récupérer l'énergie produite, par exemple pour chauffer des batiments en hiver. [Définition de la chaleur fatale selon l'ADEME](https://grand-est.ademe.fr/expertises/produire-autrement/chaleur-fatale/chaleur-fatale-de-quoi-parle-t)",
      "miseEnOeuvre": "Sélectionner un hébergeur ou demander des engagements à un hébergeur de réutiliser la chaleur fatale générée, par exemple, pour chauffer directement les bureaux ou d'autres installations à proximité.",
      "controle": "Documentation des initiatives mises en place par l'hébergeur pour la récupération et la réutilisation de la chaleur fatale. Si non applicable, le justifier. Il est nécessaire que le bilan environnemental global de la réutilisation de la chaleur produite soit positif, en tenant compte de l'investissement initial pour la construction ou l'adaptation des installations.",
      "difficulte": "Faible",
      "priorite": "Modéré"
    },{
      "id": "8.13",
      "critere": "Les calculs asynchrones nécessaires au service numérique sont-ils exécutés en minimisant leurs impacts en tenant compte de contraintes externes ?",
      "thematique": "Hébergement",
      "objectif": "",
      "miseEnOeuvre": "",
      "controle": "",
      "difficulte": "Faible",
      "priorite": "Recommandé"
    },{
      "id": "9.1",
      "critere": "Le service numérique nécessite-t-il l’inclusion d’une phase d’entraînement ?",
      "thematique": "Apprentissage",
      "objectif": "La phase d’apprentissage repose sur une infrastructure numérique qui, dans certains cas, peut nécessiter l’utilisation d’un important volume de données et de calculs. Largement répandue dans le domaine de l’intelligence artificielle, la phase d’entraînement peut engendrer une grande consommation d’énergie et de ressources. L’objectif est donc de réduire l’empreinte environnementale de la phase d’apprentissage en choisissant une méthode adaptée et proportionnée aux caractéristiques du service numérique.\nIl s’agira donc de s’interroger sur la nécessité d’inclure une phase d’entraînement dans le service numérique. Ne pas inclure une phase d’entraînement si ce n’est pas nécessaire pour améliorer le service.",
      "miseEnOeuvre": "Identifier les cibles utilisatrices et leurs besoins (voir mise en œuvre de la pratique 1.2) vis-à-vis du service numérique. Lister les fonctionnalités du service essentielles à ces besoins et se poser la question de la nécessité ou non de l’inclusion d’une phase d’entraînement\nS’interroger régulièrement sur la valeur ajoutée espérée par la phase d’entraînement : l’ajout d’une phase d’entraînement améliore-t-il significativement le service numérique dans l’atteinte des besoins de ses cibles ? L’amélioration est-elle effectivement perceptible et utile pour l’utilisateur ?",
      "controle": "Vérifier la consommation énergétique et en ressources matérielles de la méthode d’entraînement utilisée par le service numérique : la méthode d’entraînement doit être testée ou reconnue comme pauvre en consommation d’énergie et ressources.\nSi le service ne repose pas sur des méthodes de régression ou autres méthodes peu coûteuses (low- complex, low-cost), justifier dans la déclaration d’écoconception du service le besoin de méthodes plus consommatrices par une référence à un état de l’art précisant la nécessité de méthodes plus complexes pour le cas d’usage cible.\nLe critère est validé si le choix de la méthode d’apprentissage est l’alternative la plus sobre disponible selon l’état de l’art et les caractéristiques du service et que ces choix sont documentés dans la déclaration d’écoconception associée et auditables par un tiers.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "9.2",
      "critere": "Le service numérique utilise-t-il une phase d’apprentissage avec un niveau de complexité minimisé et proportionné à l’usage effectif du service ?",
      "thematique": "Apprentissage",
      "objectif": "L’objectif est de mettre en question le choix de la méthode d’apprentissage pour le service numérique et de choisir la méthode d’entraînement la plus sobre, adéquate et proportionnée à l’usage du service.",
      "miseEnOeuvre": "Faire le choix de la frugalité en privilégiant des méthodes simples comme une régression ou à défaut des réseaux de neurones simples à des technologies de deep-learning plus consommatrices de ressources de calcul.",
      "controle": "",
      "difficulte": "Faible",
      "prioritée": "Prioritaire"
    },{
      "id": "9.3",
      "critere": "Le service numérique a-t-il mis en place des mécanismes visant à limiter la quantité d’entraînement nécessaire à son fonctionnement ?",
      "thematique": "Apprentissage",
      "objectif": "Limiter la phase d’entraînement utilisée par le service numérique en choisissant des modèles déjà existants et pré-entraînés. Éviter le surentraînement en maitrisant la consommation énergétique du mécanisme choisi.",
      "miseEnOeuvre": "Utiliser un modèle déjà entraîné ou, à défaut, utilisé un fine-tuning d’un modèle pré-entraîné.\nMettre en œuvre les outils permettant la production de métriques de consommation de ressources (CPU/énergies, etc.) et les mettre en corrélation avec des métriques de qualité (précision, etc.) afin de limiter la consommation au juste nécessaire.",
      "controle": "Avant la conception du service, faire un état de l’art des modèles existants pouvant s’apparenter à la fonctionnalité visée. Utiliser un modèle pré-entraîné, si nécessaire en ajoutant des composants complémentaires (fine-tuning). Si le service n’utilise pas un modèle préexistant (déjà entraîné ou pré- entraîné), justifier dans la déclaration d’écoconception en quoi le cas d’usage est différent de ce qui existe dans l’état de l’art.\nPar ailleurs, pour valider le critère, le service devrait avoir mis en place le suivi d’indicateurs de consommation de ressources et de qualité des fonctions de la phase d’apprentissage pour assurer l’optimisation de la quantité d’entraînement sous-jacente au fonctionnement du service.",
      "difficulte": "Moyen",
      "priorite": "Prioritaire"
    },{
      "id": "9.4",
      "critere": "",
      "thematique": "Apprentissage",
      "objectif": "L’objectif est de s’interroger sur les données collectées et de minimiser les impacts environnementaux associés à leur collecte et traitement pour la phase d’entraînement, en privilégiant des données existantes et en limitant la collecte de nouvelles données. Ce critère est pertinent pour la phase d’apprentissage, caractérisée le plus souvent par une forte obsolescence des bases de données utilisées",
      "miseEnOeuvre": "Veiller à réutiliser, si possible, des données existantes afin de limiter la collecte de nouvelles données.\nVeiller à limiter la captation de nouvelles données pour la phase d’apprentissage.\nAppliquer les bonnes pratiques 7.1 à 7.4 pour la mise en place de cache, compression et politique de gestion pour les données de la phase d’apprentissage.",
      "controle": "Utiliser des bases de données existantes pour l’entraînement de son service numérique. Vérifier que la collecte de donnée est minimisée et mentionner les méthodes mises en œuvre dans la déclaration d’écoconception du service numérique.\nVérifier la mise en place des bonnes pratiques 7.1 à 7.4 pour la mise en place de cache, compression et politique de gestion pour les données utilisées pour la phase d’apprentissage.\nLe critère est validé si le service utilise, dès que cela est possible, des bases de données existantes et applique les pratiques 7.1. à 7.4 pour phase d’apprentissage tout en documentant sa gestion de données dans sa déclaration d’écoconception.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    },{
      "id": "9.5",
      "critere": "Le service numérique utilise-t-il des techniques de compression pour les modèles utilisées lors de la phase d’entraînement ?",
      "thematique": "Apprentissage",
      "objectif": "Compresser les modèles d’intelligence artificielle (réduction de complexité des modèles) pour réduire l’impact environnemental.",
      "miseEnOeuvre": "Compresser les modèles via les méthodes suivantes :\n- sparsification\n- pruning\n- unification\n- local scaling (pour limiter l’impact de la quantification)\n- batch norm folding (réduire la redondance de certains paramètres)\n- quantification\n- distillation\n- …",
      "controle": "Le critère est validé si le service numérique justifie de la mise en œuvre de méthodes de compression de modèles, en indiquant les gains réalisés dans la déclaration d’écoconception du service numérique.",
      "difficulte": "Faible",
      "priorite": "Prioritaire"
    }
  ]
}
