{
  "glossary": [
    {
      "title": "Accessible and operable by keyboard and any pointing device",
      "body": "<ul> <li>A user interface component (link, button, etc.) can be accessed from the keyboard and by any pointing device when the user can focus it either by using the pointer or the tab key;</li> <li>A user interface component (link, button, etc.) can be activated from the keyboard and by any pointing device when the user can initiate the action provided for by the interface component by pressing either the pointer or the enter key on the keyboard;</li> <li>Note: for some user interface components such as sliders (sliding or rotating knobs, etc.), it is not possible to control the component using the enter key alone. In these situations, other keys (such as arrow keys) can be used. In particular, for elements with a WAI-ARIA role corresponding to a design pattern, it is recommended to consider the document <a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a> when implementing them.</li> </ul> <p>In the framework, the expression &quot;operable by keyboard and any pointing device&quot; also refers to this definition.</p> <p>Important note: the use of certain technologies may make focus management too complex or too unstable to rely solely on tab, arrow and enter keys. In this case, providing keyboard shortcuts may be the only way to make the component usable.</p> <p>The criterion can only be considered compliant if the keyboard shortcuts used are properly documented, functional and comply with <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.10\">critère 12.10</a>.</p> "
    },
    {
      "title": "Label and field located next to each other",
      "body": "<p>The label and its field must be visually close so that the relationship between the two cannot lead to confusion.</p> "
    },
    {
      "title": "Help with creating accessible content",
      "body": "<p>Any feature available from a content editing interface, whatever the target format, which supports the author of the content in taking into account digital accessibility rules.</p> <p>Help with creating accessible content can be an automatic assistance tool or documentation. Aids to content creation include</p> <ul> <li>automatic or semi-automatic tests available from the editing functions;</li> <li>other automatic tools (a <i lang=\"en\">chatbot</i>, for example);</li> <li>documentation explaining how to define accessibility properties for each content item;</li> <li>manual tests available from the editing functions to guide authors in detecting errors.</li> </ul> "
    },
    {
      "title": "Alternative (to a script)",
      "body": "<p>Text or process associated with the script by means of an appropriate technique and enabling a function or content similar to that offered by the script to be made available.</p> <p>Note: when an alternative to a JavaScript process or functionality is proposed, the means of accessing it must be provided by the site itself. This may be a link or a button allowing access to an alternative page operating without JavaScript or allowing the component(s) to be replaced by an alternative component operating without JavaScript, for example.</p> "
    },
    {
      "title": "Short and concise alternative",
      "body": "<p>The conditions for rendering a text alternative using assistive technologies (e.g. a screen magnifier) require it to be as short as possible. A maximum length of 80 characters is strongly recommended; this will limit the number of manipulations required to read the alternative by users of Braille displays or screen magnifiers in particular.</p> "
    },
    {
      "title": "Text alternative (image)",
      "body": "<p>&quot;Accessible name&quot; rendered by assistive technologies for graphic elements such as:</p> <ul> <li>Image (<code>&lt;img&gt;</code> tag or opening tag with a WAI-ARIA <code>role=&quot;img&quot;</code> attribute);</li> <li>Image map area (<code>&lt;area&gt;</code> tag);</li> <li>Image type button (<code>&lt;input&gt;</code> tag with the <code>type=&quot;image&quot;</code> attribute);</li> <li>Object image (<code>&lt;object type=&quot;image/…&quot;&gt;</code> tag);</li> <li>Vector image (<code>&lt;svg&gt;</code> tag);</li> <li>Bitmap image (<code>&lt;canvas&gt;</code> tag);</li> <li>Embedded image (<code>&lt;embed&gt;</code> tag).</li> </ul> <p>In the case of a graphic element, the &quot;accessible name&quot; is obtained in the following order:</p> <ul> <li>Passage of text associated via the WAI-ARIA <code>aria-labelledby</code> attribute for the tags: <ul> <li><code>&lt;img&gt;</code>;</li> <li><code>&lt;input type=&quot;image&quot;&gt; </code>;</li> <li><code>&lt;svg&gt; </code>;</li> <li><code>&lt;object type=&quot;image/…&quot;&gt; </code>;</li> <li><code>&lt;embed type=&quot;image/…&quot;&gt; </code>;</li> <li><code>&lt;canvas&gt; </code>;</li> <li>tags with a WAI-ARIA <code>role=&quot;img&quot;</code> attribute.</li> </ul> </li> <li>Otherwise, value of the WAI-ARIA <code>aria-label</code> attribute for elements: <ul> <li><code>&lt;img&gt;</code>;</li> <li><code>&lt;area&gt;</code>;</li> <li><code>&lt;input type=&quot;image&quot;&gt;</code>;</li> <li><code>&lt;svg&gt; </code>;</li> <li><code>&lt;object type=&quot;image/…&quot;&gt;</code>;</li> <li><code>&lt;embed type=&quot;image/…&quot;&gt;</code>;</li> <li><code>&lt;canvas&gt;</code>;</li> <li>opening tags with a WAI-ARIA <code>role=&quot;img&quot;</code> attribute.</li> </ul> </li> <li>Otherwise, value of the <code>alt</code> attribute for tags: <ul> <li><code>&lt;img&gt;</code>;</li> <li><code>&lt;area&gt;</code>;</li> <li><code>&lt;input type=&quot;image&quot;&gt; </code>.</li> </ul> </li> <li>Otherwise, the value of the <code>title</code> attribute for the tags: <ul> <li><code>&lt;img&gt;</code>;</li> <li><code>&lt;input type=&quot;image&quot;&gt; </code>;</li> <li><code>&lt;object type=&quot;image/…&quot;&gt; </code>;</li> <li><code>&lt;embed type=&quot;image/…&quot;&gt; </code>.</li> </ul> </li> </ul> <p>This order must be used to determine what constitutes the text alternative.</p> <p>However, in the case of partial support of the algorithm for calculating the &quot;accessible name&quot;, it is the value actually rendered by the assistive technologies used in the test environment (or &quot;baseline&quot;) that should be considered as the text alternative.</p> <p>For example:</p> <ul> <li>In the case of the joint presence of a WAI-ARIA <code>aria-label</code> attribute and a WAI-ARIA <code>aria-labelledby</code> attribute on an <code>&lt;img&gt;</code> tag, it is the passage of text referenced by the WAI-ARIA <code>aria-labelledby</code> attribute that must be considered as the alternative text if the content of the passage of text is actually rendered by the assistive technologies used in the test environment;</li> <li>In the case of the joint presence of a WAI-ARIA <code>aria-label</code> attribute and an <code>alt</code> attribute on an <code>&lt;img&gt;</code> tag, it is the value of the WAI-ARIA <code>aria-label</code> attribute that must be considered as the alternative text if the content of the WAI-ARIA <code>aria-label</code> attribute is actually rendered by the assistive technologies used in the test environment.</li> </ul> <p>Reference: <span lang=\"en\"><a href=\"https://www.w3.org/TR/html-aam-1.0/#accessible-name-and-description-computation\">Accessible Name and Description Computation</a></span>.</p> <p>RAWeb considers three types of text alternative linked to the nature of the image:</p> <ul> <li>For an image conveying information, the text alternative provides the information needed to understand the content it conveys;</li> <li>For a decorative image, no text alternative should be provided;</li> <li>For a <a href=\"#captcha\">CAPTCHA</a> image or a <a href=\"#test-image\">test image</a>, the text alternative only describes the nature and function of the image. The text alternative cannot provide the information conveyed by the image without rendering the associated function inoperative.</li> </ul> <p>Note 1: for a <a href=\"#captcha\">CAPTCHA</a> image, the alternative could be, for example: &quot;Anti-spam security code&quot; or &quot;code to verify that you are a human&quot; or any other alternative that allows the user to understand the nature and function of the image.</p> <p>Note 2: For a group of images, for example a voting system made up of several star images, it is strongly recommended to use either the first image of the group to give a coherent alternative to the group of images (see <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G196\">WCAG2.1 technique G196</a>), or a container tag with a WAI-ARIA <code>img</code> role and a text alternative (image). In the first case, the other images in the group are considered to be decorative images. In the second case, all the images in the group are considered to be decorative images.</p> <p>Note 3: for image links, the alternative text must allow the function and destination of the link to be understood; this is covered in the links theme.</p> <p>Note 4: for vector images (<code>&lt;svg&gt;</code> tag) the text alternative could also be present in a <code>&lt;title&gt;</code> or in a <code>&lt;text&gt;</code> tag whether or not the latter tag is visible, even if this is not the role assigned to this element in SVG.</p> <p>Note 5: As the use of the <code>alt</code> attribute is the only technique fully supported by assistive technologies, it is recommended that this solution be preferred when implementing an alternative to an <code>&lt;img&gt;</code>, <code>&lt;area&gt;</code> and <code>&lt;input type=&quot;image&quot;&gt;</code> tag.</p> <p>Note 6: although the <code>title</code> attribute is considered to be a possible text alternative (image), its use can cause problems, in particular because an image with an absent or empty <code>alt</code> attribute is considered to be an image with a <code>role=&quot;presentation&quot;</code> by WAI-ARIA: <a href=\"https://www.w3.org/TR/html-aam-1.0/#details-id-54\">https://www.w3.org/TR/html-aam-1.0/#details-id-54</a>. It is important to ensure that the assistive technologies present in the selected test environment correctly render the alternative proposed by the <code>title</code> attribute.</p> "
    },
    {
      "title": "Ambiguous to users in general",
      "body": "<p>Intent cannot be determined from the link and all the information on the web page presented to the user at the same time as the link (i.e. a reader with no functional limitations would not know the function of a link before activating it). Example: the word &quot;guava&quot; in the following sentence used as a link: &quot;One of the important exports is guava&quot;. This link could lead to a definition of guava, a graph showing a list of the quantities of guavas exported or a photo of people harvesting guavas. Until the link is activated, all users are in the dark, so a person with disabilities is not at a disadvantage.</p> "
    },
    {
      "title": "Two-way voice communication web application",
      "body": "<p>Two-way voice communication web applications are applications that allow 2 or more people to speak simultaneously. Videoconferencing web applications that allow people to speak at the same time are an example.</p> "
    },
    {
      "title": "Synchronised audio description (time-based media)",
      "body": "<p>Narration added (via a sound file) to an audio track to describe important visual details that cannot be understood from the main audio track alone. The audio description must be synchronised with the time-based media by a feature of the player itself or provided by the developer, for example with JavaScript.</p> <p>Note 1: the audio description of a video provides information about actions, characters, scene changes, on-screen text and other visual content.</p> <p>Note 2: in a standard audio description, narration is added during pauses in the dialogue (see also extended audio description).</p> <p>Note 3: when all the information in the video is already given in the audio track, no additional audio description is required.</p> "
    },
    {
      "title": "Button (form)",
      "body": "<p>Element of a form that allows you to perform a predefined action. For example, the submit button on a form sends the collected information to the server for processing. The accessible name of a button must describe the action resulting from its activation (for example: &quot;Start your search&quot;, &quot;Send your message&quot;).</p> <p>In HTML, there are three types of form buttons:</p> <ul> <li>The <code>&lt;input&gt;</code> tag of type <code>submit</code>, <code>reset</code> or <code>button</code>;</li> <li>The <code>&lt;input&gt;</code> tag, of type <code>image</code>;</li> <li>The <code>&lt;button&gt;</code> tag.</li> </ul> <p>It is also possible to render a button using the WAI-ARIA <code>button</code> role.</p> <p>The accessible name of a button can be of six types:</p> <ul> <li>The content of the passage of text associated with the button via the WAI-ARIA <code>aria-labelledby</code> attribute when it is present;</li> <li>The value of the <code>aria-label</code> attribute when it is present;</li> <li>The value of the <code>alt</code> attribute of an <code>image</code> type button;</li> <li>The value of the <code>value</code> attribute for buttons of type <code>submit</code>, <code>reset</code> or <code>button</code>;</li> <li>The content of the <code>&lt;button&gt;</code> tag;</li> <li>The value of the <code>title</code> attribute when it is present.</li> </ul> <p>Important note: when several of these techniques are present on the same button, the calculation of the &quot;accessible name&quot;, i.e. what will be rendered, follows a strict order:</p> <ul> <li><code>aria-labelledby</code>;</li> <li>Otherwise <code>aria-label</code>;</li> <li>Otherwise <code>alt</code> for <code>image</code> <span lang=\"en\">inputs</span>;</li> <li>Otherwise <code>value</code> for <code>submit</code>, <code>reset</code> or <code>button</code> <span lang=\"en\">input</span>;</li> <li>Otherwise the content of the <code>&lt;button&gt;</code> tag;</li> <li>Otherwise <code>title</code>.</li> </ul> <p>This order should be used to assess the relevance of the button's &quot;accessible name&quot;. For example, even if there is a <code>title</code> and a passage of text referenced by <code>aria-labelledby</code> on the same button, it is the passage of text referenced by <code>aria-labelledby</code> that should be evaluated.</p> <p>Reference: <span lang=\"en\"><a href=\"https://www.w3.org/TR/html-aam-1.0/#accessible-name-and-description-computation\">Accessible name and description calculation</a></span>.</p> <p>Furthermore, an &quot;accessible name&quot; will be considered irrelevant if it does not include the visible text of the button. For example: <code>&lt;button aria-label=&quot;confirm input&quot;&gt;validate entry&lt;/button&gt;</code> will be considered as not conforming to <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#11.9\">critère 11.9</a>.</p> "
    },
    {
      "title": "Frame",
      "body": "<p>Frame: HTML element (<code>&lt;frame&gt;</code> tag) used to display content on the web page in which it is implemented.</p> <p>Inline frame: HTML element (<code>&lt;iframe&gt;</code> tag) used to display content on the web page in which it is implemented.</p> "
    },
    {
      "title": "CAPTCHA",
      "body": "<p>A CAPTCHA is a test used to distinguish a human user from a computer. The test often uses images containing distorted text, mixed with other shapes or using altered colour schemes, which the user is asked to retype. Other forms of CAPTCHA may be based on logical questions or sound clips.</p> "
    },
    {
      "title": "Biological characteristics",
      "body": "<p>User identification or control methods based on biological characteristics may be, for example</p> <ul> <li>fingerprint recognition;</li> <li>facial recognition;</li> <li>voice recognition.</li> </ul> "
    },
    {
      "title": "Key features of captions",
      "body": "<p>It is possible to apply presentation effects to captions (text colour, style, font) in order to convey information to users (e.g. identify the person speaking). These key features of captions are essential for users to understand them and should be retained during the transformation process (sending or recording the video, for example) if they are present.</p> "
    },
    {
      "title": "Form input field",
      "body": "<p>Object of a form allowing the user to:</p> <ul> <li>Enter textual or pre-formatted data: <ul> <li><code>input type=&quot;text&quot;</code>;</li> <li><code>input type=&quot;password&quot;</code>;</li> <li><code>input type=&quot;search&quot;</code>;</li> <li><code>input type=&quot;email&quot;</code>;</li> <li><code>input type=&quot;number&quot;</code>;</li> <li><code>input type=&quot;tel&quot;</code>;</li> <li><code>input type=&quot;url&quot;</code>;</li> <li><code>textarea</code>.</li> </ul> </li> <li>Select predefined values: <ul> <li><code>input type=&quot;checkbox&quot;</code>;</li> <li><code>input type=&quot;radio&quot;</code>;</li> <li><code>input type=&quot;date&quot;</code>;</li> <li><code>input type=&quot;range&quot;</code>;</li> <li><code>input type=&quot;color&quot;</code>;</li> <li><code>input type=&quot;time&quot;</code>;</li> <li><code>input type=&quot;month&quot;</code>;</li> <li><code>input type=&quot;week&quot;</code>;</li> <li><code>input type=&quot;datetime-local&quot;</code>;</li> <li><code>select</code>;</li> <li><code>datalist</code>;</li> <li><code>optgroup</code>;</li> <li><code>option</code>.</li> </ul> </li> <li>Download files: <ul> <li><code>input type=&quot;file&quot;</code>.</li> </ul> </li> <li>Or display results: <ul> <li><code>output</code>;</li> <li><code>progress</code>;</li> <li><code>meter</code>.</li> </ul> </li> <li>Tags with a WAI-ARIA role for rendering a form field are also covered by this definition: <ul> <li><code>progressbar</code>;</li> <li><code>slider</code>;</li> <li><code>spinbutton</code>;</li> <li><code>textbox</code>;</li> <li><code>listbox</code>;</li> <li><code>searchbox</code>;</li> <li><code>combobox</code>;</li> <li><code>option</code>;</li> <li><code>checkbox</code>;</li> <li><code>radio</code>;</li> <li><code>switch</code>.</li> </ul> </li> <li>The following WAI-ARIA form objects and roles are not considered to be form fields: <ul> <li><code>input type=&quot;submit&quot;</code>;</li> <li><code>input type=&quot;reset&quot;</code>;</li> <li><code>input type=&quot;hidden&quot;</code>;</li> <li><code>input type=&quot;image&quot;</code>;</li> <li><code>input type=&quot;button&quot;</code>;</li> <li><code>button</code>;</li> <li>WAI-ARIA <code>role=&quot;button&quot;</code> attribute.</li> </ul> </li> </ul> "
    },
    {
      "title": "Related form controls",
      "body": "<p>In a form, a set of fields which can be grouped together according to the nature of the information required. The purpose of grouping is to identify which fields should be treated as a whole.</p> <p>Here are a few examples:</p> <ul> <li>Three successive fields for entering a date (day/month/year);</li> <li>Successive fields for a telephone number;</li> <li>A block for entering the user's identity and address, when the form contains several contact blocks;</li> <li>A set of radio buttons or tick boxes relating to a question.</li> </ul> <p>These fields must be grouped together when the labels are not sufficient to inform the user that the fields are part of a group.</p> "
    },
    {
      "title": "Sudden change in brightness or blinking",
      "body": "<p>Alternation of relative luminance which can cause seizures in some people if they are large enough in a specific frequency range.</p> "
    },
    {
      "title": "Changes of context",
      "body": "<p>Major changes in the content of a web page which, if made without the user being aware of them, can disorientate the user who cannot see the whole page at once. Changes of context include changes of:</p> <ul> <li>user agent;</li> <li>viewport;</li> <li>focus;</li> <li>content that modifies the meaning of the web page.</li> </ul> <p>Note: A change in content is not always a change of context. A change in content, such as the expansion of a tree structure, a dynamic menu or a tab move, does not necessarily change the context unless it also changes one of the elements listed above (the focus, for example).</p> <p>For example, opening a new window, moving the focus to a different component, moving to a new page (including anything that, to the user, would look like moving to another page) or significantly reorganising the content of a page are all examples of a change of context.</p> "
    },
    {
      "title": "Language change",
      "body": "<p>Indicating language changes is necessary to tell assistive technologies to modify the speech output of an element. Language changes affect all content, including the values of certain attributes such as <code>title</code>.</p> <p>Note: it is not possible to indicate language changes in an attribute value itself, in which case the language change is indicated on the element containing the attribute. For example, a link with a <code>title</code> in French must include a <code>lang=&quot;fr&quot;</code> attribute. When the attribute contains several passages of text in different languages, the criterion is not applicable.</p> "
    },
    {
      "title": "Language code",
      "body": "<p>A 2-character (ISO 639-1) or 3-character (ISO 639-2 and following) code used to indicate the language of a document or passage of text. The language code is made up of two parts separated by a hyphen on the <code>lang=&quot;[code]-[option]&quot;</code> model.</p> <ul> <li>[code] represents a valid language code of 2 or 3 characters;</li> <li>[option] is an indication left to the author's discretion.</li> </ul> <p>When a country code is used as an option, it can be used to indicate a regionalisation of the language, e.g. &quot;en-us&quot; indicates American English. The language code indication only concerns the [code] part before the hyphen.</p> "
    },
    {
      "title": "Real-time text communication",
      "body": "<p>Real-time text (RTT) communication is a form of written communication which allows the other party to read the text being written by the sender, without waiting for the sender to confirm (e.g. by pressing the <kbd>enter</kbd> key).</p> <p>Collaborative editing tools (e.g. online office suites) are an example of the operating principle of real-time text (RTT) communication: the various participants can see the texts being written and modified by each other at the same time as the modifications are being applied to the texts. This is very different from a common online conversation system (such as instant messaging), which only transmits a written message to the other party when a key or button is pressed (for example, the <kbd>enter</kbd> key).</p> <p>Example of real-time text communication integrated into a platform: <a lang=\"en\" hreflang=\"en\" href=\"https://support.apple.com/en-us/HT207033\">Answer or make RTT or TTY calls from iPhone</a>.</p> "
    },
    {
      "title": "Compatible with assistive technologies",
      "body": "<p>Content or feature must be compatible with assistive technologies and with the accessibility functions of browsers and other user agents via an accessibility API.</p> <p>This concerns both the technology and its features and uses:</p> <ul> <li>The way in which web technology is used must be compatible with assistive technologies. This means that the way the technology is used has been tested for interoperability with users of assistive technologies in the language(s) of the content;</li> <li>The technology runs natively in widely available user agents that are, themselves, compatible with accessibility (such as HTML and CSS) or with a widely available plug-in that is, itself, compatible with accessibility.</li> </ul> <p>Verifying compatibility with assistive technologies requires carrying out a number of tests specific to the technology used, for example</p> <ul> <li>Checking the name, role, value, properties and changes of state of user interface components;</li> <li>Checking that a user interface component is correctly rendered (by assistive technologies).</li> </ul> "
    },
    {
      "title": "User interface component",
      "body": "<p>A user interface component is an element with which the user can interact, for example a button, a link or an input zone. Some components can be more complex, such as a menu, a dialogue window or a tab system. Finally, a user interface component can be based on native HTML elements or developed from scratch using JavaScript and WAI-ARIA attributes. In particular, for elements with WAI-ARIA attributes corresponding to a <a href=\"#design-pattern\">design pattern</a> it is recommended to consider the <a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a> document when implementing them.</p> "
    },
    {
      "title": "Understandable (reading order)",
      "body": "<p>Understandable content is readable (the order of the elements is logical) and coherent (the reading sequence is consistent).</p> "
    },
    {
      "title": "Alternative content",
      "body": "<p>Content that replaces another providing the same information but may be presented in a different way. This content may be in text form, but it may also be implemented using tags. Alternative content must comply with all the RAWeb criteria applicable to it in order to be considered an accessible alternative to the element it replaces. Example: a data table can be the alternative content for a bitmap image (<code>&lt;canvas&gt;</code> tag) displaying a statistical graph.</p> "
    },
    {
      "title": "Hidden content",
      "body": "<p>Assistive technologies (in particular screen readers) do not render content hidden via</p> <ul> <li><code>display</code> with the value <code>none</code> (<code>display: none</code>);</li> <li><code>visibility</code> with the value <code>hidden</code> (<code>visibility: hidden</code>);</li> <li><code>font-size</code> set to <code>0</code> (<code>font-size: 0</code>);</li> <li>HTML5 <code>hidden</code> attribute;</li> <li>WAI-ARIA <code>aria-hidden=&quot;true&quot;</code> attribute.</li> </ul> <p>All content using one or more of these properties and attributes is applicable for the <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#10.8\">critère 10.8</a>.</p> "
    },
    {
      "title": "Visible content",
      "body": "<p>For the <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#10.2.1\">test 10.2.1</a>: &quot;Present content&quot; means that visible content remains present when CSS is deactivated. For example, an image conveying information as a CSS background property invalidates this test because the information is no longer &quot;present&quot; when CSS is deactivated. On the other hand, an image conveying information as a CSS background property but accompanied by hidden text validates this test because the information is indeed &quot;present&quot; when CSS is deactivated.</p> <p>Note: the practice of managing images as background properties of elements via CSS is formally not recommended, even if accompanied by hidden text.</p> "
    },
    {
      "title": "Link context",
      "body": "<p>The link context represents the additional information (referred to as context information) that can be related by a computer program to the <a href=\"#accessible-name-of-a-link\">accessible name of a link</a>. The contextual information used to complete the <a href=\"#accessible-name-of-a-link\">accessible name of a link</a> is as follows:</p> <ul> <li>The content of the sentence in which the text link is present;</li> <li>The content of the paragraph (<code>&lt;p&gt;</code> tag) in which the text link is present;</li> <li>The content of the list item (<code>&lt;li&gt;</code> tag) or the content of a parent list item (<code>&lt;li&gt;</code> tag) in which the text link is present;</li> <li>The content of the title (<code>&lt;hx&gt;</code> tag) preceding the text link;</li> <li>The content of the table header cell(s) (<code>&lt;th&gt;</code> tag(s)) associated with the data cell (<code>&lt;td&gt;</code> tag) in which the text link is present;</li> <li>The content of the data cell (<code>&lt;td&gt;</code> tag) in which the text link is present.</li> </ul> <p>Note 1: One of the 6 link contexts combined with the <a href=\"#accessible-name-of-a-link\">accessible name of a link</a> should make it possible to understand the function and destination of the link.</p> <p>Note 2: RAWeb considers that an e-mail address of the type <code>xxx@xxx.yyy</code> is a sufficient link text to understand the function of the link and does not require the action to be indicated more explicitly.</p> "
    },
    {
      "title": "Contrast",
      "body": "<p>Marked opposition between the luminosity of a foreground colour and a background colour. The contrast ratio is based on the difference in relative luminance between the background and foreground according to the rule (L1 + 0.05) / (L2 + 0.05) where L1 is the brightest relative luminance and L2 is the darkest relative luminance. Luminosity is calculated using the following formula: L = 0.2126 * R + 0.7152 * G + 0.0722 * B. Where R, G and B are defined by</p> <ul> <li>If R sRGB ≤ 0.03928 then R = R sRGB /12.92 otherwise R = ((R sRGB +0.055)/1.055) ^ 2.4;</li> <li>If G sRGB ≤ 0.03928 then G = G sRGB /12.92 otherwise G = ((G sRGB +0.055)/1.055) ^ 2.4;</li> <li>If B sRGB ≤ 0.03928 then B = B sRGB /12.92 otherwise B = ((B sRGB +0.055)/1.055) ^ 2.4.</li> </ul> <p>and R sRGB, G sRGB and B sRGB are defined by</p> <ul> <li>R sRGB = R8bit/255;</li> <li>G sRGB = G8bit/255;</li> <li>B sRGB = B8bit/255.</li> </ul> <p>The &quot;^&quot; character is the power operator.</p> <p>Note: the contrast measurement concerns text, image of text, text and image of text in animations, caption text and embedded text in videos. For text and image of text in animations, caption text and inlay text in videos, the font size should be measured in relation to the default display size (as displayed). Text present in the elements of an image or video (e.g. a sign, poster, etc.) is not affected.</p> <p>Source: <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G18#procedure\">WCAG contrast calculation procedure</a>.</p> "
    },
    {
      "title": "Control (moving or blinking content)",
      "body": "<p>The ability for the user to control the display or playback of moving or blinking content using at least the keyboard and mouse.</p> <p>All moving content, with the exception of time-based media supported by the multimedia theme, is covered: animated images (e.g. an animated gif), moving content offered via an <code>&lt;object&gt;</code> tag, JavaScript code or CSS effects, for example.</p> <p>Note 1: where appropriate, the control method should be available as the first element of the page.</p> <p>Note 2: The control (moving or blinking content) method must allow the user to interact with the rest of the page. Consequently, stopping or pausing via an event triggered only when focused does not validate the criterion.</p> <p>Note 3: In some cases, movement is an integral part of the component and it is not possible to give the user control of it, for example a progress bar whose function is to indicate the progress of an event such as a download by movement. In this case the criterion is Not Applicable.</p> "
    },
    {
      "title": "Viewing control (time-based media)",
      "body": "<p>Possibility for the user to control the viewing of time-based media by means of the keyboard and any pointing device, at least. The following points must be respected:</p> <ul> <li>List of mandatory features for controlling consultation <ul> <li>The multimedia object must always have at least the following functions: play, pause or stop;</li> <li>If the multimedia object has sound, it must have a sound on/off function;</li> <li>If the multimedia object has subtitles or captions that are not embedded, it must have a function for controlling the appearance / disappearance of the subtitles or captions;</li> <li>If the multimedia object has audio description, it must have a function for controlling the appearance / disappearance of the audio description.</li> </ul> </li> <li>Each feature must be accessible from the keyboard, via the tab key, and by any pointing device at least.</li> <li>Each feature must be activatable via the keyboard and by at least one pointing device.</li> </ul> <p>Note: if there is no sound in a time-based medium, there is no point in adding a sound activation/deactivation function. If, however, this functionality is present and requires a text alternative to be understood by certain users, then it should be given one since the user is likely to access it and want to activate it.</p> "
    },
    {
      "title": "Error management (form)",
      "body": "<p>A set of processes that warn the user of mandatory fields, expected type or format indications and input errors in a form. Error management can be implemented by the content author or be based on attributes (such as <code>required</code> or <code>pattern</code>), WAI-ARIA attributes (such as <code>aria-required</code>) or field types that automatically produce input or error indications (such as <code>url</code>, <code>email</code>, <code>date</code>, <code>time</code> types, for example).</p> "
    },
    {
      "title": "Control (automatically triggered sound)",
      "body": "<p>Allows the user to stop or restart an automatically triggered sound.</p> <p>Note: the sound control method should be available as the first element on the page.</p> "
    },
    {
      "title": "Correctly rendered (by assistive technologies)",
      "body": "<p>When a criterion, test or test condition requires the rendering of a device to be checked, it must be ensured that the rendering is compatible with accessibility.</p> <p>The test consists of verifying that the rendition is relevant for at least one of the combinations of the test environment (or &quot;baseline&quot;) used to declare that an element, device or alternative is &quot;compatible with accessibility&quot;.</p> <p>For example: the <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#1.3.8\">test 1.3.8</a> asks you to check that the alternative of a bitmap image (<code>&lt;canvas&gt;</code> tag) conveying information is correctly rendered.</p> <p>A test is then carried out using the tools in the test environment defined for the site.</p> <p>If it is found that the alternative is correctly rendered, the test is validated.</p> "
    },
    {
      "title": "Adjacent background colour and adjacent colour",
      "body": "<p>Adjacent background colour: background colour directly in contact with the outer edge of the user interface component or <a href=\"#graphic-element\">graphic element</a>.</p> <p>Examples:</p> <ul> <li>For a white button with a blue border on a white background, the white background outside the blue border corresponds to the adjacent background colour;</li> <li>For a red button on a white background, the white background outside the red border corresponds to the adjacent background colour;</li> <li>For a white button with a green border which becomes black when focused and hovered, the white background outside the green border of the default state and the black border of the state when focused and hovered corresponds to the adjacent background colour.</li> </ul> <p>Adjacent colour: colour directly in contact with another colour. For example, in a &quot;no entry&quot; sign, the red of the sign is the colour adjacent to the white line in the centre of the sign.</p> <p>Note 1: in the case of a gradient, the adjacent colour with the least contrast in the gradient is considered to be the adjacent colour or adjacent background colour.</p> <p>Note 2: if several colours are present, all the colours will be considered as the adjacent colour or adjacent background colour.</p> "
    },
    {
      "title": "Detailed description (image)",
      "body": "<p>Content associated with an image in addition to its text alternative in order to fully describe the information conveyed by the image. The detailed description can be associated with the image via</p> <ul> <li>A reference to a detailed description adjacent to the image in the text alternative (image);</li> <li>An <a href=\"#adjacent-link-or-button\">adjacent link or button</a> which allows you to access the detailed description on the page or on another page;</li> <li>One or more passages of text identified by an id and linked by a WAI-ARIA <code>aria-describedby</code> attribute based on the model <code>aria-describedby=&quot;ID1 ID2 ID3...&quot;</code>.</li> </ul> <p>Note 1: If the <code>aria-describedby</code> attribute is not supported, it is possible to use one or more passages of text identified by an <code>id</code> and linked by a WAI-ARIA <code>aria-labelledby</code> attribute following the text alternative.</p> <p>Note 2: To ensure maximum compatibility with user agents, in particular Internet Explorer 11, it is recommended to implement a <code>tabindex=&quot;-1&quot;</code> on tags which contain a passage of text and which are not interactive elements (buttons, links, form elements, etc.).</p> "
    },
    {
      "title": "Documentation",
      "body": "<p>The documentation for a website or <a href=\"#support-service\">support service</a> can be</p> <ul> <li>a help page;</li> <li>an <a href=\"../obligations.html#accessibility-statement\">accessibility statement</a>;</li> <li>any other content that serves as documentation (PDF document, external HTML page readable in a web browser).</li> </ul> "
    },
    {
      "title": "Graphic element",
      "body": "<p>Element using a visual representation such as images, pictograms or graphics.</p> <p>This element may be made up of one or more parts that need to be visible in order to be understood (for example, each point on each line of a statistics graph).</p> "
    },
    {
      "title": "Column or row header",
      "body": "<p>The content of a cell in a data table (usually the first cell in a column or row) which serves as the heading for all or some of the cells in the column or row. A column or row may contain several headers (intermediate header). When the headers apply to an entire row or column, they can be implemented with a <code>&lt;th&gt;</code> tag or a tag with a <code>role=&quot;rowheader&quot;</code> or <code>role=&quot;columnheader&quot;</code> WAI-ARIA attribute. Otherwise, only a <code>&lt;th&gt;</code> tag can be used.</p> <p>Note: as only the <code>&lt;th&gt;</code> tag is fully supported by all assistive technologies, it is strongly recommended that this solution be chosen for implementation in order to avoid numerous checks in the various combinations provided for in the test environment (or &quot;baseline&quot;).</p> "
    },
    {
      "title": "Set of web pages",
      "body": "<p>Web pages linked together to form a coherent set of web pages within a website. For example, the pages of a specific section, the pages of a blog or the administration pages of a customer account are all sets of pages.</p> <p>Note: the home page of a website can, on its own, constitute a &quot;set of web pages&quot; because of its uniqueness.</p> "
    },
    {
      "title": "Controlled environment",
      "body": "<p>Any environment in which access to information, technologies, conditions of use and user profiles can be known and controlled. The main elements whose control is essential are</p> <ul> <li>Browser type and version;</li> <li>Supported technologies, their version and activation (JavaScript, WAI-ARIA, etc.);</li> <li>Assistive technologies and any devices used specifically by users with disabilities;</li> <li>Operating systems and accessibility APIs supported;</li> <li>Training for users of assistive technologies in the use of any specific device (interface, online application, etc.).</li> </ul> <p>Authors and administrators must guarantee the compatibility of the technologies used and their use by users and their technologies (including assistive technologies). Information services or Websites, whatever their status, which offer public access cannot be considered controlled environments.</p> "
    },
    {
      "title": "Form field label",
      "body": "<p>Text close to the form field that indicates the nature, type or format of the information expected. The label can be associated with the form field in several ways:</p> <ul> <li>By using a <code>&lt;label&gt;</code> tag;</li> <li>By using the WAI-ARIA <code>aria-label</code> attribute;</li> <li>By linking the text to the field using the WAI-ARIA <code>aria-labelledby</code> attribute;</li> <li>By using the <code>title</code> attribute.</li> </ul> <p>Important note: when several of these techniques are used on the same field, the calculation of the &quot;accessible name&quot;, i.e. what will be rendered, follows a strict order:</p> <ul> <li><code>aria-labelledby</code>;</li> <li>Otherwise <code>aria-label</code>;</li> <li>Otherwise <code>&lt;label&gt;</code>;</li> <li>Else <code>title</code>.</li> </ul> <p>This order must be used to assess the relevance of the label (<a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#11.2\">critère 11.2</a>). For example, even in the case of the presence of a <code>&lt;label&gt;</code>, it is the passage of text referenced by <code>aria-labelledby</code> that should be taken into account.</p> <p>Reference: <a href=\"https://www.w3.org/TR/html-aam-1.0/#accessible-name-and-description-computation\">Accessible name and description calculation</a>.</p> <p>Important note about the use of <code>placeholder</code>: when the <code>placeholder</code> attribute is present, it is likely to be returned instead of the <code>title</code> attribute. Consequently, when these two attributes <code>title</code> and <code>placeholder</code> are present, they must be identical.</p> <p>Note about labels linked with <code>aria-labelledby</code>: these are one or more passages of text identified by <code>id</code>s and linked by <code>aria-labelledby</code> according to the following model: <code>aria-labelledby=&quot;ID1 ID2 ID3...&quot;</code>. To ensure maximum compatibility with user agents, in particular Internet Explorer 11, we recommend implementing a <code>tabindex=&quot;-1&quot;</code> on passages of text that are not interactive elements (buttons, links, form elements, etc.).</p> <p>Note: the <code>aria-label</code> attribute cannot be used to indicate the mandatory nature of a field.</p> "
    },
    {
      "title": "Consistent labels",
      "body": "<p>Form field labels present on the same page or in a set of web pages and requiring the same information to be entered must be worded unambiguously so that the user knows that the information he is required to communicate is the same.</p> "
    },
    {
      "title": "Style sheet",
      "body": "<p>The CSS language for formatting content elements (examples: page background colour, font size/colour, positioning of information on the web page, etc.). CSS styles can be external (CSS file), embedded (declared in the page header) or inline (declared via the <code>style</code> attribute of a tag).</p> "
    },
    {
      "title": "Accessibility feature",
      "body": "<p>Examples of accessibility features</p> <ul> <li>a component for loading a more contrasting colour palette for users;</li> <li>a font size enlargement component;</li> <li>a component for accessing a simplified language version;</li> <li>special keyboard shortcuts available for certain assistive technologies;</li> <li>gestures or device movements that trigger features.</li> </ul> "
    },
    {
      "title": "Main features (of a time-based media player)",
      "body": "<p>The main functions are the basic functions of a media player: play, pause, stop, sound control.</p> "
    },
    {
      "title": "Voice-based services",
      "body": "<p>In a spoken communication system (e.g. telephony), functions can be made available, for example</p> <ul> <li>voice mail (answering machine);</li> <li>an automatic switchboard that requires you to say a number between 1 and 4 to be redirected to a service;</li> <li>or any other interactive voice server.</li> </ul> "
    },
    {
      "title": "Form",
      "body": "<p><code>&lt;form&gt;</code> tag or tag with a WAI-ARIA <code>role=&quot;form&quot;</code> attribute.</p> "
    },
    {
      "title": "Template",
      "body": "<p>A template is a document format with predefined parameters. It is used to insert content edited by the author. A template has presentation, usage and technical parameters that are not visible.</p> <p>A template may concern an entire page (home page template, etc.) or specific types of content (forms, images, videos, etc.)</p> <p>A set of templates is a group of templates that allow different formatting of the same element. For example</p> <ul> <li>templates for the application's home screen;</li> <li>templates for screens containing interactive elements;</li> <li>templates for creating a PDF.</li> </ul> "
    },
    {
      "title": "Complex and simple gestures",
      "body": "<p>A simple gesture involves touching a single point on the screen. It can be a single press or click, a double press or click, or a long press.</p> <p>A complex gesture can be both a gesture involving several points of contact on the screen (e.g. a gesture with two fingers on the screen to zoom in or out on a map) and a gesture based on following a particular path on the screen (e.g. a JavaScript function that detects the movement of a finger to the left or right on a tactile surface to trigger switching to the previous/next item in a carousel).</p> "
    },
    {
      "title": "Time stamp",
      "body": "<p>The video time stamp is the time value declared in the caption file.</p> <pre><code>1 00:00:03,000 --&gt; 00:00:06,999 The title should appear when the video reaches 3 seconds. </code></pre>"
    },
    {
      "title": "Decorative image",
      "body": "<p>Image with no function and conveying no particular information in relation to the content with which it is associated.</p> <p>Examples</p> <ul> <li>An image preceding each item in a list;</li> <li>An image used to set the page layout;</li> <li>A rounded corner image to dress up a block of information;</li> <li>An illustrative image that does not provide any information necessary for understanding the text to which it is associated.</li> </ul> <p>Note: tags with a WAI-ARIA <code>role=&quot;img&quot;</code> attribute can only be used as decorative images if they have a WAI-ARIA <code>aria-hidden=&quot;true&quot;</code> attribute.</p> "
    },
    {
      "title": "Object image",
      "body": "<p>Image embedded in or generated by an <code>&lt;object&gt;</code> tag.</p> "
    },
    {
      "title": "Image conveying information",
      "body": "<p>An image that conveys information necessary for understanding the content with which it is associated.</p> <p>Note 1: when the image is the only content of a link, its alternative is the link accessible name. In this case, the image alternative should be evaluated using the &quot;Links&quot; theme.</p> <p>Note 2: When a form button, inserted with the element <code>&lt;button&gt;</code>, contains only an image (<code>&lt;img&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;embed&gt;</code>, <code>&lt;canvas&gt;</code> or <code>&lt;svg&gt;</code> tag), the alternative for the image is the button accessible name. There are two possible cases:</p> <ul> <li>The button is controlled by its type, for example, the <code>submit</code> or <code>reset</code> type, and is part of a form. In this case, the image button should be evaluated using the &quot;Forms&quot; theme;</li> <li>The button is controlled by a JavaScript device. In this case, the image button must be evaluated under the &quot;Scripts&quot; theme.</li> </ul> "
    },
    {
      "title": "Image map",
      "body": "<ul> <li>Client-side image map (<code>usemap</code> attribute): image divided into clickable or neutral areas (<code>nohref</code> attribute);</li> <li>Server-side image map (<code>ismap</code> attribute): image for which the browser transmits the coordinates of the pointer to the server, each set of coordinates corresponding to a resource (web page). Server-side image maps are extremely rare.</li> </ul> <p>Note: in HTML5, the <code>ismap</code> attribute is obsolete and non-compliant for <code>image</code> type buttons (<code>input type=&quot;image&quot;</code>).</p> "
    },
    {
      "title": "Test image",
      "body": "<p>Image used in a test, captcha or image used as a test in a quiz or game.</p> <p>Example: a series of images shows a detail from a famous painting; you have to recognise the title and the painter of each painting. In this situation, it is not possible to give a relevant alternative (for example the name of the painting and/or the painter) without rendering the test unusable. In this case, the alternative must simply give the possibility of identifying the image, for example &quot;test image 1&quot;.</p> "
    },
    {
      "title": "Image of text object",
      "body": "<p>Image generated by the <code>&lt;object&gt;</code> tag and displaying text.</p> "
    },
    {
      "title": "Image of text",
      "body": "<p>Image displaying text.</p> <p>Note: the use of image of text is not recommended. Where it is possible to reproduce the same effects in CSS, <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#1.8\">critère 1.8</a> requires that the text be reproduced in styled text, or that a replacement mechanism allows the user to replace these images with <a href=\"#styled-text\">styled text</a> in CSS.</p> "
    },
    {
      "title": "Image conveying information (provided by colour)",
      "body": "<p>An image in which all or part of the content visually conveys information through colour alone.</p> "
    },
    {
      "title": "Mandatory field indication",
      "body": "<p>Textual or graphic indication (icon) letting the user know that a field is mandatory before entering it.</p> <p>Note: If this indication is not made explicitly in text (icon, &quot;*&quot;, &quot;!&quot;, etc.), the explanation of the meaning of this indication must be located, visually and in the order of the source code, before the indication is used for the first time.</p> "
    },
    {
      "title": "Indication conveyed by shape, size or location",
      "body": "<p>For example</p> <ul> <li>The presence of a visual marker, to indicate the active page in a navigation menu (indication given by position);</li> <li>Foregrounding to indicate an active tab (indicated by its shape);</li> <li>A change in font size in a tag cloud (indicated by size).</li> </ul> <p>Or any other similar graphic effect.</p> "
    },
    {
      "title": "Indication of data type and/or format",
      "body": "<p>Text indication enabling the user to know what type of data and/or input format is required for a mandatory field, before filling it in.</p> <p>Examples</p> <ul> <li>Email (format: you@domain.com);</li> <li>Postcode (format: 00000);</li> <li>Date (format: DD/MM/YYYY).</li> </ul> "
    },
    {
      "title": "Accessibility information",
      "body": "<p>Accessibility information is all the information (attributes, programmatic relationships, alternatives, etc.) required to make content accessible. For example: the alternative of a graphic element, the semantics of a passage of text, the title of an iframe, etc.</p> <p>For example, in HTML, the <code>alt</code> attribute of an image is accessibility information.</p> <p>An editing tool should have functions that allow you to define all the information needed to create accessible content, for example</p> <ul> <li>defining the alternative of an image or, on the contrary, declaring it decorative;</li> <li>the ability to define section headings;</li> <li>define the language of a passage of text;</li> <li>define labels for form fields.</li> </ul> <p>All the accessibility criteria relating to the content technology in question are concerned. For example, for an HTML page, all the RAWeb level A and AA criteria must be met. For the creation of a document in PDF format, all the criteria of the <a href=\"../rapdf1/index.html\">PDF accessibility assessment framework (RAPDF)</a> level A and AA must be met.</p> "
    },
    {
      "title": "Information (provided by colour)",
      "body": "<p>Information conveyed visually through colour. The indication that fields in red are mandatory in a form, the use of a blue background to indicate the page currently being consulted in a menu with a green background, the change of colour of an item name to indicate its unavailability in a list of items are all examples of information given by colour.</p> <p>When information (provided by colour) is accompanied by another method aimed at users who cannot see or perceive colours or their associations well, the criterion will be considered as not applicable.</p> <p>Means of conveying information other than by colour may be</p> <ul> <li>A visible text indication;</li> <li>Means involving graphics (pictogram, background image, shape, different border style, etc.) and through a complement to the code (<code>aria-label</code>, <code>title</code>, hidden text, <code>aria-current</code>, etc.);</li> <li>A different typographic style (bold, italic, text size, different font, etc.) and by means of a supplement in the code (<code>aria-label</code>, <code>title</code>, hidden text, <code>aria-current</code>, etc.).</li> </ul> "
    },
    {
      "title": "Accessible name (of a link)",
      "body": "<p>&quot;Accessible name&quot; rendered by assistive technologies.</p> <p>In the case of an HTML link, the &quot;accessible name&quot; is obtained in the following order:</p> <ul> <li>passage of text associated with the WAI-ARIA <code>aria-labelledby</code> attribute;</li> <li>otherwise, value of the WAI-ARIA <code>aria-label</code> attribute;</li> <li>otherwise, content of the link;</li> <li>otherwise, value of the <code>title</code> attribute.</li> </ul> <p>This order must be used to determine what constitutes the accessible name of a link. For example</p> <ul> <li>if a WAI-ARIA <code>aria-label</code> attribute and a WAI-ARIA <code>aria-labelledby</code> attribute are present together, the passage of text referenced by the WAI-ARIA <code>aria-labelledby</code> attribute must be considered as the heading;</li> <li>if there is both a WAI-ARIA <code>aria-label</code> attribute and content in the link, the value of the WAI-ARIA <code>aria-label</code> attribute must be considered as the heading.</li> </ul> <p>Reference: <span lang=\"en\"><a href=\"https://www.w3.org/TR/html-aam-1.0/#accessible-name-and-description-computation\">Accessible name and description calculation</a></span>.</p> <p>If the &quot;accessible name&quot; is obtained from the content of the link, this will vary according to the following cases:</p> <p>Text link</p> <p>In HTML, the &quot;accessible name&quot; corresponds to the text made up of</p> <ul> <li>the text contained in the link;</li> <li>the text contained in the link's child elements.</li> </ul> <p>Image link</p> <p>In HTML, the &quot;accessible name&quot; corresponds to the text made up from the text alternative of one or more images in the link of the type</p> <ul> <li>Image (element <code>&lt;img&gt;</code> or opening tag with WAI-ARIA <code>role=&quot;img&quot;</code> attribute);</li> <li>Object image (element <code>&lt;object&gt;</code>);</li> <li>Bitmap image (element <code>&lt;canvas&gt;</code>);</li> <li>Vector image (element <code>&lt;svg&gt;</code>).</li> </ul> <p>Composite link</p> <p>In HTML, the &quot;accessible name&quot; corresponds to the text made up from the set</p> <ul> <li>the text contained in the link;</li> <li>the text contained in the child elements of the link;</li> <li>the content of the alternative text of the image(s) included in the link.</li> </ul> <p>In the case of an SVG link (version 1.1), the &quot;accessible name&quot; is obtained as follows:</p> <ul> <li>Passage of text associated with the WAI-ARIA <code>aria-labelledby</code> attribute;</li> <li>Otherwise, value of the WAI-ARIA <code>aria-label</code> attribute;</li> <li>Otherwise, content of the <code>&lt;title&gt;</code> element, the direct child of the link;</li> <li>Otherwise, value of the <code>xlink:title</code> attribute;</li> <li>Otherwise, text content of one or more <code>&lt;text&gt;</code> elements.</li> </ul> <p>However, care must be taken as this calculation algorithm is not yet taken into account and effective within the various screen readers. To date, support is available with VoiceOver, but incomplete with JAWS and NVDA. As a result, the lowest common denominator on which it is possible to rely to provide an accessible name for the link is the <code>&lt;text&gt;</code> element.</p> <p>Note 1: the accessible name of a link will be considered as non-explicit if it does not include the <a href=\"#visible-label\">visible label</a> of the link.</p> <p>Note 2: due to the possible configuration of assistive technologies allowing the &quot;accessible name&quot; derived from the value of the <code>title</code> attribute to be forced to the detriment of the &quot;accessible name&quot; derived from the content of the link. The accessible name of a link will be considered as non-explicit if the link has a <code>title</code> attribute whose value does not include at least the &quot;accessible name&quot; taken from the content of the link.</p> <p>Note 3: In the case of several links with different destinations whose &quot;accessible name&quot; is identical. The accessible name of a link alone will be considered non-explicit if the link context does not allow them to be differentiated.</p> <p>Note 4: when a link contains no content, it will be non-compliant with regard to <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#10.2\">critère 10.2</a> and <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#6.2\">critère 6.2</a>.</p> <p>Note 5: Although the calculation of the accessible name of a link takes into account text content generated in CSS via the <code>::before</code> and <code>::after</code> pseudo-elements, this practice must not be used, as it constitutes non-compliance with <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr> 2.1 criterion 1.3.1 (see <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F87\">F87</a>).</p> "
    },
    {
      "title": "Visible label",
      "body": "<p>Text displayed as a visible label on the screen within a button or link.</p> <p>Text displayed as a <a href=\"#form-field-label\">label</a> for a form field.</p> <p>This text can be text or an image containing text.</p> "
    },
    {
      "title": "Items of the same type in a combobox",
      "body": "<p>In a drop-down list (<code>&lt;select&gt;</code> tag), a set of items (<code>&lt;option&gt;</code> tags) which can be grouped together according to their nature. The purpose of grouping is to identify items that should be treated as a whole (for example, a list of departments grouped by region).</p> "
    },
    {
      "title": "Landmarks",
      "body": "<p>WAI-ARIA provides roles for indicating the main areas (regions) of the document. These roles are very useful for screen reader users in particular, but also for keyboard navigation users who can benefit from quick navigation functions in the <a href=\"#document-structure\">document structure</a>.</p> <p>The roles must be defined in the document according to the nature of the zone:</p> <ul> <li>The <a href=\"#header-region\">header region</a> must have a WAI-ARIA <code>role=&quot;banner&quot;</code> attribute;</li> <li>The main <a href=\"#menu-and-navigation-bar\">navigation menu</a> must have a WAI-ARIA <code>role=&quot;navigation&quot;</code> attribute;</li> <li>The <a href=\"#main-content-region\">main content region</a> must have a WAI-ARIA <code>role=&quot;main&quot;</code> attribute;</li> <li>The <a href=\"#footer-region\">footer region</a> must have a WAI-ARIA <code>role=&quot;contentinfo&quot;</code> attribute;</li> <li>The <a href=\"#search-engine-internal-to-a-website\">search engine</a> region on the website must have a WAI-ARIA <code>role=&quot;search&quot;</code> attribute.</li> </ul> <p>Note 1: While most screen readers provide these functions, browsers have yet to offer a dedicated navigation function for users who cannot use the mouse. The implementation of skip links therefore remains to be favored over landmarks.</p> <p>Note 2: The WAI-ARIA <code>banner</code>, <code>main</code> and <code>contentinfo</code> roles must be unique in the page. The WAI-ARIA <code>navigation</code> role is reserved for main and secondary navigation zones. When there are several WAI-ARIA <code>navigation</code> roles, it may be useful to differentiate them by specifying a name for each of the zones using the WAI-ARIA <code>aria-label</code> or <code>aria-labelledby</code> attribute.</p> "
    },
    {
      "title": "Default language",
      "body": "<p>Indication of the document's main processing language, which may be present on the <code>html</code> root element or on each element of the relevant page via the <code>lang</code> and/or <code>xml:lang</code> attributes, according to the following scheme:</p> <ul> <li>For HTML up to version 4.01: <code>lang</code> attribute mandatory, <code>xml:lang</code> attribute not supported;</li> <li>For XHTML 1.0 served as &quot;text/html&quot;: <code>lang</code> and <code>xml:lang</code> attributes mandatory;</li> <li>For XHTML 1.0 served as <code>&quot;application/xhtml+xml&quot;</code> <code>xml:lang</code> attribute mandatory, <code>lang</code> attribute recommended;</li> <li>For XHTML 1.1: <code>xml:lang</code> attribute mandatory, <code>lang</code> attribute not supported;</li> <li>For HTML5: <code>lang</code> attribute mandatory.</li> </ul> "
    },
    {
      "title": "Name, role, value, properties and changes of state",
      "body": "<p>A component must have an appropriate role and name. Its values, states and any parameters must also be accessible and correctly passed on to the accessibility APIs in particular.</p> <p>A component can be based on an interactive HTML element or on a non-interactive element overloaded by WAI-ARIA via an ad hoc role. Important: buttons (<code>&lt;button&gt;</code> or <code>&lt;input type=&quot;button&quot;&gt;</code> tags) when controlled via JavaScript must be evaluated with <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#7.1\">critère 7.1</a>.</p> <p>The name is the accessible name of the component (the accessible name of a button, for example).</p> <p>The value is, for example, the selected item in a drop-down list or the current value of a cursor (<code>slider</code>).</p> <p>The role corresponds to the type of element defined by the HTML or WAI-ARIA specification (such as the <code>&lt;button&gt;</code> tag or the WAI-ARIA <code>role=&quot;button&quot;</code> attribute).</p> <p>Properties correspond to specific information about a component, generally provided by WAI-ARIA. For example, <code>aria-controls</code> is a property that sends APIs the information that the component controls any given content (referenced by its identifier -- <code>id</code> attribute).</p> <p>Changes of state are also made available by WAI-ARIA. For example, <code>aria-expanded</code> is a state that tells APIs whether the component is &quot;open&quot; or &quot;closed&quot;. Note that a state can also be transmitted via the name, when it is dynamically changed to correspond to the state of the controlled zone in particular.</p> <p>These properties are not mandatory, but may be required if they are essential to make the component accessible. It is up to the auditor to consider the cases where these properties are essential, depending on the context in which the component is used.</p> <p>The auditor must also check that, where they are present, these properties are used correctly.</p> <p>To do this (if they deem it relevant, given the context in which the components are implemented and the ergonomic choices made), they can use the WAI-ARIA usage recommendations for components with WAI-ARIA attributes corresponding to a design pattern as described in the document <a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a>.</p> <p>Note: WAI-ARIA roles, properties and states are implemented via attributes, for example <code>role=&quot;banner&quot;</code>, <code>aria-hidden=&quot;true&quot;</code>.</p> "
    },
    {
      "title": "Image caption",
      "body": "<p>When a text adjacent to an image contains information about the image (e.g. copyright, date, author, etc.) or is intended to supplement the information provided by the image (e.g. a text associated with an image in an image gallery), it is referred to as an image caption.</p> <p>When an image is captioned, the image caption needs to be linked to the image by a structural relationship, so that assistive technologies can treat the image and its caption as a single whole.</p> <p>HTML5 suggests associating a legend with an image via the <code>figure</code> (the whole image and the caption) and <code>figcaption</code> (the caption) elements.</p> <p>An image without a caption can define</p> <ul> <li>An image which is not inserted into a <code>figure</code> element;</li> <li>An image inserted in a <code>figure</code> element without a <code>figcaption</code> element.</li> </ul> <p>Note: when the text adjacent to the image can be used as replacement text, it is not necessary to use the <code>figure</code>, <code>figcaption</code> set, as the image can simply be treated as a decorative image.</p> <p>On this subject, you can consult the W3C note <a href=\"https://www.w3.org/TR/html51/semantics-embedded-content.html#alt-text\">Requirements for providing text to act as an alternative for images</a>.</p> "
    },
    {
      "title": "Legend",
      "body": "<p>HTML provides a way of titling groups of related form controls using the elements <code>&lt;fieldset&gt;</code> and <code>&lt;legend&gt;</code>.</p> <p>It is also possible to create groups with the WAI-ARIA <code>group</code> role and a passage of text, acting as a legend, linked by the WAI-ARIA <code>aria-labelledby</code> attribute or provided by a WAI-ARIA <code>aria-label</code> attribute.</p> <p>Note 1: Field groupings can use other methods that associate the grouping information directly into the field label. For example, via a <code>title</code> attribute, a WAI-ARIA <code>aria-label</code> attribute, a <code>aria-labelledby</code> link acting as a label, or the WAI-ARIA <code>aria-describedby</code> attribute associating additional text. In this case, field grouping becomes unnecessary because the labels are sufficiently relevant.</p> <p>Note 2: When the form consists of a single block of information of the same kind (the user's identity and address, for example) or a single field (a search engine, for example), field grouping is not mandatory.</p> "
    },
    {
      "title": "Composite link",
      "body": "<p>In HTML, <a href=\"#link\">link</a> containing both text and one or more image children:</p> <ul> <li>Image (<code>&lt;img&gt;</code> tag or opening tag with WAI-ARIA <code>role=&quot;img&quot;</code> attribute);</li> <li>Clickable area (<code>&lt;area&gt;</code> tag) with a <code>href</code> attribute;</li> <li>Object image (<code>&lt;object&gt;</code> tag);</li> <li>Bitmap image (<code>&lt;canvas&gt;</code> tag);</li> <li>Vector image (<code>&lt;svg&gt;</code> tag).</li> </ul> <p>Important note: the use of two adjacent and identical links (image link and text link) is a major inconvenience for the user. Even if this does not constitute non-compliance, it should be avoided. One way of dealing with this type of link is to include the image in the text link to form a composite link, thus avoiding redundancy.</p> <p>You can consult the technique <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/html/H2\">H2: Combining adjacent image and text links for the same resource</a>.</p> "
    },
    {
      "title": "Link whose nature is not obvious",
      "body": "<p>A link which can be confused with normal text when it is indicated by colour alone by certain types of user who have little or no perception of colour. For example, in this text &quot;New strike at SNCF&quot;, if the word &quot;strike&quot; is a link indicated by colour only, its nature may be ignored by non-colour-perceptive users accessing the activated CSS content.</p> <p>Note: &quot;indicated only by colour&quot; means that the link is not accompanied by any visual marker (icon, underline, border, etc.). Consequently, a link of the same colour as the surrounding text is affected by this criterion.</p> "
    },
    {
      "title": "Image link",
      "body": "<p>In HTML, <a href=\"#link\">link</a> containing only one or more children of the image type</p> <ul> <li>Image (<code>&lt;img&gt;</code> tag or opening tag with WAI-ARIA <code>role=&quot;img&quot;</code> attribute);</li> <li>Clickable area (<code>&lt;area&gt;</code> tag) with a <code>href</code> attribute;</li> <li>Object image (<code>&lt;object&gt;</code> tag);</li> <li>Bitmap image (<code>&lt;canvas&gt;</code> tag);</li> <li>Vector image (<code>&lt;svg&gt;</code> tag).</li> </ul> "
    },
    {
      "title": "Adjacent link or button",
      "body": "<p>Link or button presented adjacent to an element on the page. The link or button must be visually adjacent in the graphic representation (CSS enabled) and in the HTML code. In the HTML code, the link or button must be located just before or just after the element to which it is adjacent.</p> "
    },
    {
      "title": "SVG link",
      "body": "<p>Link contained in a <code>&lt;svg&gt;</code> element.</p> <p>In the case of an SVG link (version 1.1), the &quot;accessible name&quot; is obtained as follows:</p> <ul> <li>Passage of text associated with the WAI-ARIA <code>aria-labelledby</code> attribute;</li> <li>Otherwise, value of the WAI-ARIA <code>aria-label</code> attribute;</li> <li>Otherwise, the content of the <code>&lt;title&gt;</code> element, the direct child of the link;</li> <li>Otherwise, the value of the <code>xlink:title</code> attribute;</li> <li>Otherwise, the text content of one or more <code>&lt;text&gt;</code> elements.</li> </ul> <p>However, this calculation algorithm is not yet supported by the various screen readers. To date, support is available with VoiceOver, but incomplete or deficient with JAWS and NVDA. As a result, the lowest common denominator on which it is possible to rely to provide an accessible name for the link is the <code>&lt;text&gt;</code> element.</p> "
    },
    {
      "title": "Text link",
      "body": "<p>In HTML, <a href=\"#link\">link</a> containing no child element of type</p> <ul> <li>Image (<code>&lt;img&gt;</code> tag or opening tag with WAI-ARIA <code>role=&quot;img&quot;</code> attribute);</li> <li>Object image (<code>&lt;object&gt;</code> tag);</li> <li>Bitmap image (<code>&lt;canvas&gt;</code> tag);</li> <li>Vector image (<code>&lt;svg&gt;</code> tag).</li> </ul> "
    },
    {
      "title": "Link",
      "body": "<p>In HTML</p> <ul> <li><code>&lt;a&gt;</code> tag with a <code>href</code> attribute;</li> <li>Tag with a WAI-ARIA <code>role=&quot;link&quot;</code> attribute and whose navigation action is handled by a script.</li> </ul> <p>In SVG</p> <ul> <li><code>&lt;a&gt;</code> tag with <code>xlink:href</code> attribute in SVG 1.1.</li> </ul> "
    },
    {
      "title": "Bypass or skip links",
      "body": "<p>Links whose function is to allow navigation within the page (skip link, link to the search form or menu, etc.). These links can be used either to access an area of the page (quick access link) or to skip an area of the page (bypass link).</p> <p>Note 1: A functional bypass or skip link is a link whose activation makes it possible to resume reading and keyboard navigation from the target of the link when using the browsers and assistive technologies selected in the test environment (or &quot;baseline&quot;) of the audit.</p> <p>Note 2: Bypass or skip links must be located at the same place in the presentation and in the same relative order in the source code in order to comply with <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2\">critère 12.2</a>.</p> "
    },
    {
      "title": "List of possible values for the `autocomplete` attribute",
      "body": "<p><a href=\"https://www.w3.org/TR/WCAG21/#input-purposes\">The list of available values</a> is provided by the WCAG 2.1 specification:</p> <ul> <li><code>name</code> -- Full name;</li> <li><code>honorific-prefix</code> -- Abbreviation, title;</li> <li><code>given-name</code> -- First name;</li> <li><code>additional-name</code> -- Additional first names;</li> <li><code>family-name</code> -- Family name;</li> <li><code>honorific-suffix</code> -- Honorific suffix;</li> <li><code>nickname</code> -- Nickname, diminutive;</li> <li><code>organisation-title</code> -- Function, job title;</li> <li><code>username</code> -- User name;</li> <li><code>new-password</code> -- New password (for example, when creating an account or changing a password);</li> <li><code>current-password</code> -- Current password for the account identified by the <code>username</code> field (for example, when logging in);</li> <li><code>organization</code> -- The name of the organization corresponding to the person, address or contact information in the other fields associated with this field;</li> <li><code>street-address</code> -- Postal address (multi-line, new lines retained);</li> <li><code>address-line1</code> -- Postal address (one line per field, line 1);</li> <li><code>address-line2</code> -- Postal address (one line per field, line 2);</li> <li><code>address-line3</code> -- Postal address (one line per field, line 3);</li> <li><code>address-level4</code> -- The most detailed administrative level, for addresses with four administrative levels;</li> <li><code>address-level3</code> -- The third administrative level, for addresses with three or more administrative levels;</li> <li><code>address-level2</code> -- The second administrative level, for addresses with two or more administrative levels;</li> <li><code>address-level1</code> -- The highest administrative level of an address, i.e. the province in which the locality is located;</li> <li><code>country</code> -- Country code;</li> <li><code>country-name</code> -- Country name;</li> <li><code>postal-code</code> -- Postcode;</li> <li><code>cc-name</code> -- Full name appearing on the means of payment;</li> <li><code>cc-given-name</code> -- First name shown on the means of payment;</li> <li><code>cc-additional-name</code> -- Additional first names appearing on the means of payment;</li> <li><code>cc-family-name</code> -- Family name appearing on the means of payment;</li> <li><code>cc-number</code> -- Code identifying the means of payment (e.g. a bank card number);</li> <li><code>cc-exp</code> -- Expiry date of the payment method;</li> <li><code>cc-exp-month</code> -- The month in which the payment method expires;</li> <li><code>cc-exp-year</code> -- The year of the expiry date of the means of payment;</li> <li><code>cc-csc</code> -- Payment method security code (also known as the card security code (CSC), card validation code (CVC), card verification value (CVV), signature panel code (SPC), credit card ID (CCID), etc.);</li> <li><code>cc-type</code> -- Type of payment method (e.g. Visa);</li> <li><code>transaction-currency</code> -- The currency preferred by the user during a transaction;</li> <li><code>transaction-amount</code> -- The amount preferred by the user in a transaction (e.g., in response to an auction or clearance price);</li> <li><code>language</code> -- Preferred language;</li> <li><code>bday</code> -- Birthday;</li> <li><code>bday-day</code> -- The day of the birthday;</li> <li><code>bday-month</code> -- The month of the birthday;</li> <li><code>bday-year</code> -- The year of the birthday;</li> <li><code>sex</code> -- Gender identity;</li> <li><code>url</code> -- Home page or other web page corresponding to the organisation, person, address or contact information in the other fields associated with this field;</li> <li><code>photo</code> -- A photograph, icon or other image that matches the organisation, person, address or contact information in other fields associated with this field;</li> <li><code>tel</code> -- Full telephone number, including country code;</li> <li><code>tel-country-code</code> -- Country code of the phone number;</li> <li><code>tel-national</code> -- Telephone number without the country code part, with an internal country prefix if applicable;</li> <li><code>tel-area-code</code> -- Area code of the telephone number, with an internal country prefix, if applicable;</li> <li><code>tel-local</code> -- Telephone number without the country code part and the area code;</li> <li><code>tel-local-prefix</code> -- The first part of the telephone number component following the area code, when that component is split into two parts;</li> <li><code>tel-local-suffix</code> -- The second part of the telephone number component following the area code, when this component is split into two parts;</li> <li><code>tel-extension</code> -- The telephone number of an internal extension;</li> <li><code>email</code> -- E-mail address;</li> <li><code>impp</code> -- Corresponding URL of an instant messaging protocol (for example, <code>&quot;aim:goim?screenname=example&quot;</code> or <code>&quot;xmpp:fred@example.net&quot;</code>).</li> </ul> "
    },
    {
      "title": "Lists",
      "body": "<p>A sequence of elements which can be grouped together in the form of a structured ordered, unordered or definition list. For example, the sequence of links in a navigation menu is an unordered list of links, the various steps in a procedure are an ordered list of elements, the term/description pair in a glossary is a list of descriptions. In HTML, lists use the following tags:</p> <ul> <li>Ordered list: <code>&lt;ol&gt;</code> and <code>&lt;li&gt;</code> tags (each element of the list is assigned an indexed marker);</li> <li>Unordered list: <code>&lt;ul&gt;</code> and <code>&lt;li&gt;</code> tags (each item in the list is assigned an unindexed marker);</li> <li>Description list: <code>&lt;dl&gt;</code>, <code>&lt;dt&gt;</code> (term to be described) and <code>&lt;dd&gt;</code> tags (description).</li> </ul> <p>Note 1: In HTML5, the <code>&lt;dl&gt;</code> tag no longer represents just a list of definitions, but generically any list of descriptions which may include, as a group of terms-descriptions, names and definitions, questions and answers, categories and subjects, etc.</p> <p>Note 2: It is also possible to structure lists using the WAI-ARIA attributes <code>role=&quot;list&quot;</code> and <code>role=&quot;listitem&quot;</code> for ordered and unordered lists.</p> <p>Note 3: the notion of &quot;visually grouped in the form of a list&quot; is characterised by</p> <ul> <li>The presence of a visual marker making it clear that it is an unordered list, for example <code>-</code>, <code>•</code>, <code>*</code>, etc.;</li> <li>The presence of a visual marker to indicate that it is an ordered list, e.g. a number, a Greek letter, etc.; and</li> <li>The presence of a series of elements that visually follow on from each other, with an identical visual form, nature and function, but without directly having a visual list marker (unordered or ordered), for example a navigation menu.</li> </ul> <p>However, not all lists require a list structure, for example a series of terms separated by a comma.</p> "
    },
    {
      "title": "Replacement mechanism",
      "body": "<p>Mechanism generally based on CSS, allowing the user to replace text with image of text and vice versa on the principle of style switcher. The mechanism can use a server-side scripting language or a client-side scripting language.</p> "
    },
    {
      "title": "Mechanism for enabling an accessibility feature",
      "body": "<p>User interface component or set of user interface components used to activate a functionality that takes into account one or more adaptation needs of the interface. For example: a button for displaying a page with the correct contrasts, or a button for increasing paragraph spacing.</p> <p>We also talk about a <strong>set of components</strong> when, in certain interfaces, the component that enables the functionality to be activated is only made available after one or more other components have been activated. For example: a button can be used to display a modal window which itself contains a button which can be used to display a page with conforming contrasts. In this case, the button that displays the modal window <strong>and</strong> the button that activates the display of compliant contrasts together constitute the mechanism.</p> <p>This mechanism must maintain the same content and functionality as the site or page it modifies.</p> "
    },
    {
      "title": "Mechanism for displaying a compliant contrast ratio",
      "body": "<p>A user interface component whose activation allows the appearance of the site or page to be modified so that content is displayed with a sufficient contrast ratio. The design of this user interface component must comply with <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#3.2\">critère 3.2</a> and <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#3.3\">critère 3.3</a> without itself using a mechanism to display a compliant contrast ratio. This mechanism must maintain the same content and functionality of the site or page that it modifies.</p> "
    },
    {
      "title": "Non-time-based media",
      "body": "<p>Content that does not take place in time, which can be viewed using <code>svg</code> and <code>canvas</code> elements; for example, an interactive animation created using a <code>canvas</code> tag. Non-time-based media can contain time-based media (for example, a slideshow created with <code>canvas</code> which offers a list of videos to view).</p> "
    },
    {
      "title": "Time-based media (audio, video and synchronised)",
      "body": "<ul> <li>Time-based media audio-only: sound content (Wav, Mp3...);</li> <li>Time-based media video-only: moving or sequenced images or photos;</li> <li>Synchronised time-based media: audio or video streams synchronised with another format to present information and/or including interactive temporal components. Time-based media can be viewed in 2 different ways:</li> </ul> <ul> <li>Downloadable file that can be viewed with software external to the web page;</li> <li>Content embedded in the web page which can be consulted within the web page via <ul> <li>The <code>&lt;video&gt;</code> element (e.g. a video);</li> <li>The <code>&lt;audio&gt;</code> element (e.g. a podcast);</li> <li>The <code>&lt;svg&gt;</code> element (for example, a vector cartoon);</li> <li>The <code>&lt;canvas&gt;</code> element (for example, a bitmap cartoon);</li> <li>The <code>&lt;bgsound&gt;</code> element to broadcast a background sound to the web page.</li> </ul> </li> </ul> <p>Time-based media can be broadcast in real time or offered for playback asynchronously (pre-recorded media).</p> <p>Note 1: animated gifs and image animations created using JavaScript or CSS are not considered to be time-based media.</p> <p>Note 2: the <code>&lt;bgsound&gt;</code> element is specific to Internet Explorer and should not be used.</p> "
    },
    {
      "title": "Menu and navigation bar",
      "body": "<p>A list of links for specific navigation within the site, a section or a collection of pages.</p> <p>The main navigation bars (<a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2\">critère 12.2</a>) are</p> <ul> <li>A navigation menu;</li> <li>A breadcrumb trail;</li> <li>A navigation list for a list of results;</li> <li>Skip links.</li> </ul> <p>There are different types of navigation menu (<a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.1\">critère 12.1</a> and <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.2\">critère 12.2</a>):</p> <ul> <li>Main navigation menu;</li> <li>Sub-heading menu;</li> <li>Context menu;</li> <li>Table of contents for a set of web pages.</li> </ul> <p>Note: Footer links to the legal aspects, site map and other information about the site are not considered to be a main navigation menu.</p> "
    },
    {
      "title": "Status message",
      "body": "<p>A status message informs the user of a content change on the page without interrupting their main activity (there is no change of context, for example a shift of focus to the message).</p> <p>A status message can inform about</p> <ul> <li>The success or result of an action;</li> <li>The busy state of an application;</li> <li>The progress of a process;</li> <li>The existence of an error.</li> </ul> "
    },
    {
      "title": "Modify or cancel data and carried out actions",
      "body": "<p>Procedures by which a user can modify the data they have entered, have their entry cancelled or have the actions resulting from their entry cancelled, for example cancelling an order or a bank transfer.</p> <p>Note: The page containing a form which modifies or deletes data, or which transmits answers to a test or examination, or whose validation has financial or legal consequences, must explicitly indicate the period during which the user can request the cancellation of their input. It must also contain the procedure for cancelling the entry. This procedure does not have to be available online, although it is recommended.</p> "
    },
    {
      "title": "Search engine (internal to a website)",
      "body": "<p>Area giving direct access (form) or indirect access (interface element giving access to the form) to the search engine which enables searches to be made on the content of the entire site.</p> <p>Note: Be careful not to confuse this search zone, which is unique on the site, with any other search engine that can be used, for example, to search a restricted part of the site: a catalogue, offers in a public procurement section, etc.</p> <p>See the technical definition of search region provided by WAI-ARIA <a href=\"https://www.w3.org/TR/wai-aria-1.1/#search\"><code>search(role)</code></a>.</p> "
    },
    {
      "title": "Design pattern",
      "body": "<p>A design pattern is a model defined in the <a href=\"http://www.w3.org/TR/wai-aria-practices/\">WAI-ARIA 1.1 Authoring Practices</a> document which describes the structure, roles and properties and keyboard behaviour that a JavaScript component (widget) must respect.</p> <p>It is recommended that components developed in JavaScript using WAI-ARIA attributes corresponding to a design pattern comply with it. Please note, however, that not all design patterns are suitable for non-application use, particularly for sites displaying in a mobile context.</p> <p>Note 1: given the lack of support for certain WAI-ARIA properties and roles, and the wide variety of situations in which a JavaScript component may be proposed, it is possible to adapt design patterns to particular contexts or uses. In this case, the adapted design pattern must</p> <ul> <li>Respect the general structure: for example, a set of panels (WAI-ARIA <code>tabpanel</code> role) in a tab system is necessarily linked to a set of tabs (WAI-ARIA <code>tablist</code> role);</li> <li>Use an equivalent WAI-ARIA role or property to replace a poorly supported WAI-ARIA role or property, offering similar behaviour and output.</li> </ul> <p>Note 2: Enriching a design pattern with additional WAI-ARIA roles or properties whose accessibility compatibility is checked by the rendition test on the test environment (or &quot;baseline&quot;) does not constitute an adaptation of a design pattern. For example, adding the WAI-ARIA <code>aria-hidden</code> attribute to the panels (WAI-ARIA <code>tabpanel</code> role) of a tab system does not define an adapted design pattern.</p> "
    },
    {
      "title": "Navigation sequence",
      "body": "<p>Order in which the focus moves (to the next element or to the previous element). The natural order is the one implemented in the source code. When it is modified using the <code>tabindex</code> attribute or using a JavaScript command, it is the modified order that is referred to.</p> <p>Warning: when an element initiates a change in the page (change of context, management of hidden zones, addition of content, management of form fields, etc.), the element initiating the change must be activated in order to test the consistency of the navigation sequence.</p> "
    },
    {
      "title": "Editing tool",
      "body": "<p>A web application or editing component in a web page that allows content to be created or modified for distribution to other users. An editing tool can be used by one or more users working collaboratively.</p> <p>An editing tool can be</p> <ul> <li>the tool as delivered by the publisher;</li> <li>the tool augmented with extensions not developed by the publisher;</li> <li>a set of tools.</li> </ul> <p>Examples of editing tools</p> <ul> <li>application for editing and controlling the content of websites or applications, e.g. CMS (Content Management System), LMS (Learning Management System), LCMS (Learning Content Management System), content aggregator;</li> <li>applications for creating office documents (e.g. for distribution in PDF format);</li> <li>multimedia editing tools;</li> <li>application for creating web applications;</li> <li>application for editing code;</li> <li>application for exporting to web technology format (e.g. software for saving in HTML);</li> <li>application that generates content based on templates, scripts, command lines, etc.;</li> <li>application or functionality of a web page enabling the editing of portions of web pages or applications (typically, blog systems, comment features on websites, forums or wiki systems);</li> <li>mail application used to send e-mails.</li> </ul> <p>Examples of editing tools that are not included in the scope:</p> <ul> <li>An application where the content created is not made available to other users (note-taking application with no sharing functionality, for example). In this case, the edited content is only available to the owner and is not made available to other users.</li> <li>Forms intended for users. For example, an order form for an e-commerce application. Although forms allow content to be edited, this content is not made available to other users.</li> <li>Independent accessibility control tools: these tools do not modify the content they control.</li> </ul> <p>Editing tools should not be systematically included in the sample. For example, when auditing a news website, the RAWeb does not require the editing tool (e.g. a CMS) used to create the content to be audited. If the purpose of the audit is to evaluate the public consultation interface, the sample must contain only the representative public pages, but not the content management system.</p> "
    },
    {
      "title": "Site map page",
      "body": "<p>Dedicated page presenting the tree structure of a website, generally in the form of lists of links organised into headings and sub-headings giving access to all the pages on the site.</p> <p>Note 1: Site map links can be made up of <code>&lt;a&gt;</code> tags or <code>&lt;area&gt;</code> tags.</p> <p>Note 2: the site map does not have to contain links to all the pages on the site, but the user must be able to access all the pages on the site from the site map.</p> "
    },
    {
      "title": "Passage of text linked by `aria-labelledby` or `aria-describedby`",
      "body": "<p>One or more passages of text identified by <code>id</code> values which are unique in the page and associated with an element (form field, button, etc.) by the WAI-ARIA <code>aria-labelledby</code> or <code>aria-describedby</code> attributes on the following model: <code>aria-labelledby=&quot;ID1 ID2 ID3...&quot;</code> where the value of the attribute used is equal to the list of <code>id</code> attribute values of the passages of text to be associated present in the page.</p> <p>Note 1: to ensure maximum compatibility with user agents, in particular Internet Explorer 11, we recommend implementing a <code>tabindex=&quot;-1&quot;</code> on passages of text which are not interactive elements (buttons, links, form elements, etc.).</p> <p>Note 2: the value of the WAI-ARIA attributes <code>aria-labelledby</code> or <code>aria-describedby</code> must not create a recursive reference (A refers to B which refers to A) or a traversal reference (A which refers to B which refers to C).</p> "
    },
    {
      "title": "Presentation of information",
      "body": "<p>Visual rendering of content via a browser in graphic mode. Presentation concerns the style, position and dimensions of HTML elements and their content. The presentation of information must be achieved using CSS. The elements (<code>basefont</code>, <code>big</code>, <code>blink</code>, <code>center</code>, <code>font</code>, <code>marquee</code>, <code>s</code>, <code>strike</code> and <code>tt</code>) and attributes (<code>align</code>, <code>alink</code>, <code>background</code>, <code>bgcolor</code>, <code>border</code>, <code>cellpadding</code>, <code>cellspacing</code>, <code>char</code>, <code>charoff</code>, <code>clear</code>, <code>compact</code>, <code>color</code>, <code>frameborder</code>, <code>hspace</code>, <code>link</code>, <code>marginheight</code>, <code>marginwidth</code>, <code>text</code>, <code>valign</code>, <code>vlink</code>, <code>vspace</code>) are prohibited.</p> <p>Notes</p> <ul> <li>The <code>width</code> and <code>height</code> attributes used on elements other than the <code>&lt;img&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;embed&gt;</code>, <code>&lt;canvas&gt;</code> and <code>&lt;svg&gt;</code> elements are also prohibited;</li> <li>The <code>size</code> attribute used on elements other than the <code>&lt;select&gt;</code> element is also prohibited;</li> <li>The <code>&lt;u&gt;</code> element is prohibited only if the DOCTYPE of the document does not correspond to HTML 5.</li> </ul> "
    },
    {
      "title": "Pressed",
      "body": "<p>Corresponds to JavaScript event handlers considered as down events (<code>mousedown</code>, <code>touchstart</code> for example).</p> "
    },
    {
      "title": "When focused",
      "body": "<p>Focus is the state returned by an element that receives attention following a user action. There are three ways in HTML to give focus to an element:</p> <ul> <li>By activating the element using a pointing device (e.g. mouse);</li> <li>By reaching the element using the tab or shift + tab key;</li> <li>By activating the element using a keyboard shortcut (<code>accesskey</code>).</li> </ul> <p>Some elements naturally receive the focus, for example: <code>&lt;a href&gt;</code>, <code>&lt;area href&gt;</code>, <code>&lt;button&gt;</code>, <code>&lt;input&gt;</code>, <code>&lt;object&gt;</code>, <code>&lt;select&gt;</code>, <code>&lt;label&gt;</code>, <code>&lt;legend&gt;</code>, <code>&lt;optgroup&gt;</code>, <code>&lt;option&gt;</code> and <code>&lt;textarea&gt;</code>. The behaviour of the element when focused depends on its nature; a link, for example, should be activated after the focus is set (unless a script is used). On the other hand, a form element, such as <code>&lt;textarea&gt;</code>, should allow input when focused. The elements <code>&lt;label&gt;</code> and <code>&lt;legend&gt;</code> only receive the focus when focused via the mouse pointer. For the <code>&lt;label&gt;</code> element, the expected behaviour is to transfer the focus to the element associated with it.</p> <p>Note 1: the WAI-ARIA specification extends the role assigned to the <code>tabindex</code> attribute by defining that any HTML element can acquire the ability to receive focus by assigning it the value <code>tabindex=&quot;0&quot;</code>. On the other hand, no behaviour is assigned by the mere presence of <code>tabindex</code>. Similarly, the value <code>tabindex=&quot;-1&quot;</code>, when used on an element which naturally receives focus, removes the affected element from the tab plane by inhibiting its ability to signal when focused. The use of <code>tabindex</code>, in accordance with the WAI-ARIA specification, can validate certain tests relating to the management of tabulation focus, in particular.</p> <p>Note 2: The browser's visual indication of focus must not be removed or degraded unless a focus style defined by the author is visible and sufficiently contrasting with respect to <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#3.3\">critère 3.3</a>.</p> "
    },
    {
      "title": "Refresh process",
      "body": "<p>A technique for modifying the content of one or more elements of a web page. The refresh process can be carried out by automatically reloading the page or dynamically without reloading the page (via AJAX, for example). The user must be able to control each refresh process independently.</p> "
    },
    {
      "title": "CSS property defining a colour",
      "body": "<p>This concerns the following properties: <code>color</code>, <code>background-color</code>, <code>background</code>, <code>border-color</code>, <code>border</code>, <code>outline-color</code>, <code>outline</code>.</p> <p>Note: the use of a background image to insert a colour (property <code>background:url...</code>) is also affected.</p> "
    },
    {
      "title": "QVGA",
      "body": "<p>QVGA (Quarter Video Graphics Array) resolution is a display standard corresponding to a size of 320 pixels X 240 pixels (i.e. 76,800 pixels).</p> "
    },
    {
      "title": "Keyboard shortcut",
      "body": "<p>A means of triggering an action associated with a user interface component by pressing one or more keys.</p> <p>Note: &quot;Access keys&quot; (HTML <code>accesskey</code> attribute) are indeed keyboard shortcuts, but they are not affected by <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#12.10\">critère 12.10</a> insofar as their activation already requires the use of modifier keys (which vary depending on the browser).</p> "
    },
    {
      "title": "Redirect",
      "body": "<p>Process which consists of redirecting the user to another page, on the same domain or on a different domain, when displaying a page on the client workstation.</p> "
    },
    {
      "title": "Digital accessibility rules",
      "body": "<p>The generic term &quot;digital accessibility rules&quot; refers to the <a href=\"../raweb1/index.html\">RAWeb</a>, the <a href=\"../raam1.1/index.html\">RAAM</a>, the <a href=\"../rapdf1/index.html\">RAPDF</a> or the <a href=\"https://www.etsi.org/deliver/etsi_en/301500_301599/301549/03.02.01_60/en_301549v030201p.pdf\">EN 301 549 standard</a>, depending on the context of use.</p> "
    },
    {
      "title": "Writing rules",
      "body": "<p>The source code must comply with the following rules in accordance with the document type declaration used in the page</p> <ul> <li>No opening or closing tags without <code>&lt;</code> ou <code>&gt;</code> (example of error: <code>li&gt;bike</code>);</li> <li>no closing tag with <code>/</code> missing (example of error: <code>&lt;li&gt;bike&lt;li&gt;</code>);</li> <li>no attribute values with <code>&quot;</code> or <code>'</code> missing (example of error: <code>alt=&quot;bike</code>);</li> <li>no multiple attribute values separated by a space without <code>&quot;</code> or <code>'</code> (example of error: <code>alt=my beautiful bike</code>);</li> <li>no missing spaces between attributes (example: <code>alt=&quot;bike&quot;title=&quot;bike&quot;</code>);</li> <li>no missing closing tag for elements that require one (example of error: <code>&lt;object&gt;</code> without <code>&lt;/object&gt;</code>).</li> </ul> "
    },
    {
      "title": "Released",
      "body": "<p>Corresponds to JavaScript event handlers considered as up events (<code>mouseup</code>, <code>touchend</code> for example).</p> "
    },
    {
      "title": "Summary (of table)",
      "body": "<p>A summary (of table) is a passage of text associated with a complex data table. It provides information about the nature and structure of the table to make it easier to use for users of assistive technologies, for example.</p> <p>Note: in HTML5, the only technique that can currently be used is to insert the summary directly into the title (using the <code>&lt;caption&gt;</code> tag), masking the summary using CSS if necessary.</p> <p>In previous versions of HTML, the summary could be inserted via a <code>summary</code> attribute on the <code>&lt;table&gt;</code> tag.</p> <p>In the case of a tag with the WAI-ARIA <code>role=&quot;table&quot;</code> attribute, the summary must be provided using an <code>aria-describedby</code> attribute and be correctly rendered (by assistive technologies).</p> "
    },
    {
      "title": "Script",
      "body": "<p>Code generally written in the form of a list of commands (e.g. JavaScript). Client-side interpreted languages require a compatible browser on which execution of the language is active. The commands in a client-side scripting language may be embedded or contained in an external file. In both cases, they are inserted using the <code>&lt;script&gt;</code> tag.</p> "
    },
    {
      "title": "Reading direction",
      "body": "<p>Indicates the reading direction of the document or a passage of text via the <code>dir</code> attribute, <code>dir=&quot;ltr&quot;</code>, for example. The two recognised values are</p> <ul> <li><code>ltr</code> (left to right) indicates a reading direction from left to right;</li> <li><code>rtl</code> (right to left) indicates a reading direction from right to left.</li> </ul> <p>Note: if there is no indication of reading direction via the <code>dir</code> attribute on the <code>html</code>, <code>body</code> element, or one of the parents of the text being analysed, the default reading direction is left to right (value <code>ltr</code>).</p> "
    },
    {
      "title": "Support service",
      "body": "<p>A support service can be</p> <ul> <li>the feedback mechanism identified in the website's accessibility statement,</li> <li>a help desk,</li> <li>a call centre,</li> <li>technical support,</li> <li>a <a href=\"#relay-service\">relay service</a>,</li> <li>a training service.</li> </ul> "
    },
    {
      "title": "Relay service",
      "body": "<p>Relay services allow users, regardless of their mode of communication (text, sign, speech) to interact during real-time remote communication with other participants, by providing conversion between modes of communication.</p> <p>For example, if a user who communicates using sign language wants to talk to someone who does not, a relay service will provide live interpreting so that they can communicate.</p> "
    },
    {
      "title": "Website",
      "body": "<p>Set of all web pages</p> <ul> <li>Connected by web links;</li> <li>Belonging to the same domain name (e.g. design.numerique.gouv.fr);</li> <li>Which form a coherent whole from the user's point of view.</li> </ul> <p>Special case of web pages in a sub-domain; a sub-domain can</p> <ul> <li>Either belong to the website attached to the domain name, if the user perceives them to be consistent with the other pages of the website (for example: same structure, same navigation, etc.);</li> <li>Or not belong to the website attached to the domain name (for example: different blogs in the sub-domain of a domain name and unrelated to each other).</li> </ul> "
    },
    {
      "title": "Subtitles",
      "body": "<p>Subtitles are in a language other than the language of the video.</p> <p>Subtitles are different from <a href=\"#synchronised-captions-media-object\">captions for the deaf and hard of hearing</a>.</p> "
    },
    {
      "title": "Synchronised captions (media object)",
      "body": "<p>Text of audio information (a character's words, noise that is important for understanding the action, etc.) present in a time-based medium and displayed synchronously with the flow of the multimedia object.</p> <p>Note 1: to differentiate between audio sources (different characters, voice-over, etc.), it is recommended that an appropriate mechanism be used (bracketing, italics, explicit announcement such as &quot;voice-over: ...&quot;).</p> <p>Note 2: subtitling for translation (the <code>kind=&quot;subtitles&quot;</code> attribute of the <code>&lt;track&gt;</code> tag in HTML5, for example) should not be confused with captioning for the deaf and hard of hearing (the <code>kind=&quot;captions&quot;</code> attribute of the <code>&lt;track&gt;</code> tag in HTML5, for example). Subtitling and captioning serve different purposes. Only the presence and relevance of captions for the deaf and hard of hearing will ensure compliance.</p> "
    },
    {
      "title": "Document structure",
      "body": "<p>Set of elements used to define the main areas of an HTML page, such as the page header region, the main and secondary navigation regions, the main content region and the footer region.</p> "
    },
    {
      "title": "Navigation system",
      "body": "<p>Any process enabling navigation within the site or within a page. The navigation systems used are</p> <ul> <li>Main navigation menu;</li> <li>Table of contents;</li> <li>Site map;</li> <li>Search engine.</li> </ul> "
    },
    {
      "title": "Data table with a title",
      "body": "<p>Data table with an attribute or containing a tag whose content acts as a title.</p> <p>Data table preceded or followed by a passage of text associated with the table acting as the title.</p> <p>Provided it is correctly rendered and associated with the data table by assistive technologies, the associated title can be</p> <ul> <li>In a <code>&lt;caption&gt;</code> tag;</li> <li>In a <code>title</code> attribute;</li> <li>In a WAI-ARIA <code>aria-label</code> attribute;</li> <li>In a tag associated with the data table via a WAI-ARIA <code>aria-labelledby</code> attribute on the table.</li> </ul> <p>Note: as only the <code>&lt;caption&gt;</code> tag is fully supported by all assistive technologies, it is strongly recommended that this solution be chosen during implementation in order to avoid numerous checks in the various combinations provided by the test environment (or &quot;baseline&quot;).</p> "
    },
    {
      "title": "Complex data table",
      "body": "<p>A data table is a structure introduced by a <code>&lt;table&gt;</code> tag or when it is correctly rendered by assistive technologies by a tag with a WAI-ARIA <code>role=&quot;table&quot;</code> attribute.</p> <p>When a data table contains headers that are not distributed solely over the first row and/or column of the grid, or whose scope does not apply to the entire column or row, it is referred to as a complex data table. It is then necessary to provide a &quot;summary&quot; to explain its nature and structure in order to make it easier to consult for users of assistive technologies, for example.</p> "
    },
    {
      "title": "Data table",
      "body": "<p>A data table is a structure introduced by a <code>&lt;table&gt;</code> tag or when it is correctly rendered by assistive technologies by a tag with a WAI-ARIA <code>role=&quot;table&quot;</code> attribute. This tag is used to structure information in rows and columns using data cells and header cells.</p> "
    },
    {
      "title": "Layout table",
      "body": "<p>Technique which uses an HTML element (<code>&lt;table&gt;</code> tag) to control the display of information via cells (<code>&lt;td&gt;</code> tag).</p> "
    },
    {
      "title": "Font size",
      "body": "<p>Value assigned to the fonts on a web page.</p> "
    },
    {
      "title": "Styled text",
      "body": "<p>Text whose formatting is controlled by a style sheet.</p> "
    },
    {
      "title": "Frame title",
      "body": "<p>value of the <code>title</code> attribute of the <code>&lt;iframe&gt;</code> or <code>&lt;frame&gt;</code> tag, used to identify the nature of the content displayed via the frame when the user navigates from frame to frame or displays the list of frames on the page, for example.</p> <p>Note 1: Some frames are used solely for technical operations such as application processing designed to prepare or control content displayed on the page, such as the frames used by certain social networks such as Facebook.</p> <p>If these frames do not have a frame title provided by the remote service, or if the frame titles are deemed irrelevant, generic terms may be used, for example <code>title=&quot;Facebook technical content&quot;</code>.</p> <p>Note 2: If this does not hinder the operation of this type of frame, it is possible to make them unavailable to assistive technologies by using the WAI-ARIA <code>aria-hidden=&quot;true&quot;</code> attribute. In this case, <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#2.1\">critère 2.1</a> and <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#2.2\">critère 2.2</a> will not apply.</p> "
    },
    {
      "title": "Page title",
      "body": "<p>The content of the <code>&lt;title&gt;</code> tag on a web page, enabling the content/nature of the page to be identified clearly, concisely and uniquely (&quot;Site map www.sitename.org&quot; for a page presenting a site map, for example).</p> "
    },
    {
      "title": "Heading",
      "body": "<p>HTML element (<code>h</code> tag) with 6 levels of hierarchy (from <code>h1</code> for the most important heading to <code>h6</code> for the least important) or HTML element with WAI-ARIA <code>role=&quot;heading&quot;</code> and <code>aria-level</code> attributes used to structure the information in web content.</p> <p>Ensuring a strict hierarchy between the headings of a web page is good practice, but the presence of hierarchical jumps does not invalidate the criterion as long as this looser hierarchy remains consistent (a <code>&lt;h3&gt;</code> heading can come directly after a <code>&lt;h1&gt;</code> heading, for example). The headings hierarchy does not have to contain a <code>&lt;h1&gt;</code> heading. Although these practices are not encouraged, they do not invalidate the criterion.</p> <p>Note: headings visually hidden via CSS are considered to be present and validate the <a href=\"https://accessibilite.numerique.gouv.fr/methode/criteres-et-tests/#9.1\">critère 9.1</a>.</p> "
    },
    {
      "title": "Transcript (time-based media)",
      "body": "<p>Textual content associated with a time-based media object using the appropriate technique (text encoded in HTML or in a text file located on the same page or available via a link). This content gives the user access (independently of viewing the multimedia object) to</p> <ul> <li>All of what is expressed orally;</li> <li>All the descriptive information necessary for an equivalent understanding of the action.</li> </ul> <p>This textual information must be presented in the chronological order in which it appears in the time-based media.</p> <p>Note: the transcript must be located outside the <code>&lt;object&gt;</code> tag.</p> "
    },
    {
      "title": "Transformation",
      "body": "<p>Process managed automatically by the editing tool. There are two types of transformation:</p> <ul> <li>content restructuring: transformation during which the input format (e.g. HTML, XML...) is the same as the output one, the restructuring only modifies elements of the markup. For example: linearising a table, dividing a document into several pages.</li> <li>content recoding: transformation during which the input format is different from the ouput one (e.g. HTML to XHTML, HTML to PDF). This applies in particular to editing zones that use a different syntax from that which will be used for public display.</li> </ul> "
    },
    {
      "title": "Document type",
      "body": "<p>Set of reference data which allows user agents to know the technical characteristics of the languages used on the web page (<code>doctype</code> tag).</p> "
    },
    {
      "title": "Data type and format",
      "body": "<p>Indication of the data type and format expected when entering a form input field. For example</p> <ul> <li>Date (dd/mm/yyyy);</li> <li>Amount in euros;</li> <li>Postcode (5 digits: e.g. 75001).</li> </ul> <p>Important note: when the type of form input field offers an input mask, for example the <code>date</code> or <code>time</code> fields, the format indication is not necessary.</p> "
    },
    {
      "title": "Only for layout purposes",
      "body": "<p>Only for layout purposes: use of HTML tags for a purpose other than that specified in the specifications (with regard to the declared document type). Examples: use of the <code>h</code> tags for the sole purpose of creating a typographic effect; use of the <code>&lt;blockquote&gt;</code> tag for the sole purpose of indenting a paragraph, etc.</p> <p>Note 1: the use of <code>&lt;div&gt;</code> or <code>&lt;span&gt;</code> elements or several <code>&lt;br&gt;</code> elements to visually create a paragraph is considered non-compliant and invalidates the criterion.</p> <p>Example: <code>&lt;div&gt;</code>, <code>paragraphs in a simulated block of text</code>, <code>&lt;br&gt;</code>, <code>using several &lt;br&gt; tags</code>, <code>&lt;/div&gt;</code></p> <p>Note 2: WAI-ARIA offers a <code>presentation</code> role which can be used to suppress the semantics of an element, for example <code>&lt;h1 role=&quot;presentation&quot;&gt;Heading&lt;/h1&gt;</code>. In this case, the text will be rendered correctly but its heading role will no longer be rendered. The <code>presentation</code> role may be required when using a WAI-ARIA <a href=\"#design-pattern\">design pattern</a>.</p> <p>The WAI-ARIA <code>presentation</code> role can also be used to remove semantics from an element when it is used only for layout purposes, e.g. <code>&lt;blockquote role=&quot;presentation&quot;&gt;</code> will have the same effect as no <code>&lt;blockquote&gt;</code> element.</p> <p>Even if this use is strongly discouraged (in the case of assistive technologies that do not implement WAI-ARIA, for example), it can be considered <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG-compliant</abbr>. On the other hand, the use of a WAI-ARIA <code>presentation</code> role on an element whose nature (e.g. semantics) is essential to the understanding of the content is a violation of the <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr> rules (particularly failure <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/failures/F92\">F92</a>) and invalidates the criterion.</p> "
    },
    {
      "title": "Input unit",
      "body": "<p>For character-by-character input, the smallest text input unit is the character.</p> <p>For a system with word prediction functionality, the smallest input unit is the word.</p> <p>For some speech recognition systems, the text is not retranscribed until an entire word or phrase has been spoken. In this case, the smallest input unit is the word or phrase.</p> "
    },
    {
      "title": "Accessible version (for a downloadable document)",
      "body": "<p>Downloadable documents whose format types are recognised as compatible with accessibility must be made accessible either directly or via an accessible version or a version in HTML. The document formats recognised as compatible are:</p> <ul> <li>Microsoft Office (Word 2003, OOXML);</li> <li>Open Office Org (ODF);</li> <li>Adobe PDF;</li> <li>EPUB/Daisy.</li> </ul> <p>PDF documents must comply with the <a href=\"../rapdf1/index.html\">PDF accessibility assessment framework (RAPDF)</a>. Other types of content must comply with the criteria of <a href=\"https://www.etsi.org/deliver/etsi_en/301500_301599/301549/03.02.01_60/en_301549v030201p.pdf#page=52\">section 10 <span lang=\"en\">Non-web documents</span></a> of European standard EN 301 549 v3.2.1.</p> <p>Note: the text format (txt) cannot be used to produce an accessible version (for a downloadable document).</p> "
    },
    {
      "title": "Alternative \"audio only\" version",
      "body": "<p>An &quot;audio only&quot; version is an audio version, in the form of a simple file in MP3 format for example, used as an alternative to a video only (video without audio information). As the only users affected by accessibility are blind people, who cannot see the video, <abbr lang=\"en\" title=\"web content accessibility guidelines\">WCAG</abbr> considers it acceptable to offer an audio version as an alternative.</p> <p>The &quot;audio only&quot; version must contain all the important visual information in the video.</p> <p>It is generally easier to produce an audio version than a text version when the video is very descriptive (transcript often requires a great deal of editorial work). It should be remembered, however, that only a transcript provides universal access to the information in the video, in the event that a user is unable to launch the video, for example.</p> "
    },
    {
      "title": "Clickable area",
      "body": "<p>Region of a responsive image to which an action has been associated; for example, triggering an event by clicking on a link (for a client-side clickable area: <code>&lt;area&gt;</code> tag with the <code>href</code> attribute). The <code>&lt;area&gt;</code> tags are contained in the <code>&lt;map&gt;</code> tag.</p> <p>For server-side image maps, the coordinates are held on the server.</p> "
    },
    {
      "title": "Header region",
      "body": "<p>Area at the top of the document generally containing the document title, a logo, a slogan, etc</p> <p>Note: Be careful not to confuse this header region, which is unique on the site, with any content that can be tagged in HTML5 with the <code>&lt;header&gt;</code> element.</p> <p>See the technical definition provided by WAI-ARIA: <a href=\"https://www.w3.org/TR/wai-aria-1.1/#banner\"><code>Banner (role)</code></a>.</p> "
    },
    {
      "title": "Image map area",
      "body": "<p>The clickable or non-clickable area of a client-side image map, or the clickable area of a server-side image map.</p> "
    },
    {
      "title": "Main content region",
      "body": "<p>Area containing the main content of the page, where the background information and functions are located (i.e. outside the menus, search or secondary areas for advertising, related news, etc.).</p> <p>Note: This zone is unique on the page. It can be difficult to determine on certain pages, such as the home page.</p> <p>See the technical definition provided by WAI-ARIA: <a href=\"https://www.w3.org/TR/wai-aria-1.1/#main\"><code>Main (role)</code></a>.</p> "
    },
    {
      "title": "Footer region",
      "body": "<p>This contains information about the operation of the site or legal information. For example, you will find the legal notice, credits, terms of use, site map and possibly the accessibility page.</p> <p>Note: Be careful not to confuse this footer region, which is unique on the site, with any content that can be tagged in HTML5 with the <code>&lt;footer&gt;</code> element.</p> <p>See the technical definition provided by WAI-ARIA: <a href=\"https://www.w3.org/TR/wai-aria-1.1/#contentinfo\"><code>Contentinfo (role)</code></a>.</p> "
    },
    {
      "title": "Non-clickable area",
      "body": "<p>Region of an image map to which no action is associated. A client-side non-clickable area is contained in an <code>&lt;area&gt;</code> tag:</p> <ul> <li>With the <code>nohref</code> attribute when the HTML code of the page is not HTML5;</li> <li>Without the <code>href</code> attribute in HTML5.</li> </ul> <p>The <code>&lt;area&gt;</code> tags are contained in the <code>&lt;map&gt;</code> tag.</p> "
    }
  ]
}